{
  "paperId": "0031171a2a5f1a9bf4e060fc5a5d03da069bad11",
  "title": "The Role of Perceived Social Support in the Association Between Stress and Creativity Self-Efficacy Among Adolescents With Attention Deficit Hyperactivity Disorder.",
  "year": 2025,
  "openAccessPdf": {
    "url": "",
    "status": null,
    "license": null,
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1111/jpm.13171?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1111/jpm.13171, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "authors": [
    {
      "authorId": "2275136320",
      "name": "M. H. Atta"
    },
    {
      "authorId": "2291927489",
      "name": "Shaimaa Mohamed Amin"
    },
    {
      "authorId": "2104468442",
      "name": "N. Hamad"
    },
    {
      "authorId": "2315267017",
      "name": "A. A. Othman"
    },
    {
      "authorId": "2125303968",
      "name": "Y. Sayed"
    },
    {
      "authorId": "2222059934",
      "name": "H. Sanad"
    },
    {
      "authorId": "2140146129",
      "name": "A. El-Sayed"
    }
  ],
  "abstract": "INTRODUCTION\nAdolescents with attention deficit hyperactivity disorder (ADHD) face significant challenges related to stress, inattention and impulsivity, which can impair their creativity self-efficacy. Social support is a critical protective factor that mitigates stress and enhances resilience, yet its role in fostering creativity self-efficacy among adolescents with ADHD remains underexplored.\n\n\nAIM\nTo examine the levels of stress, perceived social support and creativity self-efficacy among adolescents with ADHD and to explore the mediating role of social support in the relationship between stress and creativity self-efficacy.\n\n\nMETHODS\nA cross-sectional study was conducted with 305 adolescents diagnosed with ADHD from six preparatory schools. Validated tools, including the Adolescence Stress Scale, Creative Self-Efficacy Scale and Multidimensional Scale of Perceived Social Support, were used to measure key variables. Data were analysed using Pearson correlation and mediation analysis.\n\n\nRESULTS\nStress was negatively correlated with CSE (r = -0.791, p < 0.001), while perceived social support positively correlated with creativity self-efficacy (r = 0.548, p < 0.001). Social support significantly mediated the relationship between stress and creativity self-efficacy, buffering the negative impact of stress on creativity (B = -0.149, t = 7.987, p < 0.001).\n\n\nDISCUSSION\nThe findings underscore the vital role of social support in alleviating stress and bolstering creativity self-efficacy among adolescents with ADHD. Supportive relationships from family, peers, and mentors enhance confidence in creative abilities, creating a nurturing framework for resilience and innovation.\n\n\nCONCLUSION\nPerceived social support effectively mitigates the adverse effects of stress on creativity self-efficacy, highlighting its importance in promoting adaptive outcomes for adolescents with ADHD.\n\n\nIMPLICATIONS FOR PRACTICE\nNursing interventions should prioritise strengthening social support systems for adolescents with ADHD. Educating families, schools and communities about the impact of social support can foster resilience, reduce stress and enhance creativity."
}