{
  "doi": "10.19044/esj.2017.v13n5p270",
  "slug": "10.19044-esj.2017.v13n5p270",
  "title": "Indicators of Conduct Disorders Among Adolescents in Saudi Arabia",
  "abstract": "This study aims to explore and explain the degree of CDs&quot; indicators among adolescents in school, society, and the home; and also the differences in these indicators based on the boys&quot; age, school class, and parental status. This involves interpreting qualitatively the quantitative outcomes. Mixed methodology was used to answer the research questions. A sample of 1,245 students from five intermediate schools in Taif, Saudi Arabia was selected randomly by using cluster sampling. A structural questionnaire was administered on these students. Then, a semi-structured interview was developed and applied on a non-random sample of 15 students. The outcomes show that CDs&quot; indicators are higher in society compared with the indicators at home and in schools. The results also show that the adolescents&quot; age (from 13 to less than 14, and from 15 to less than 16), in the third year in intermediate school, and whose parents are either separated or are both dead, represent the highest means in CDs&quot; indicators. All the interviewed boys discussed their aversion to school, their community, and home, as well as their beliefs about others&quot; bad opinions of them. The current data provides a strong hint that there are high degrees of CDs&quot; indicators among Saudi teenagers, and there are differences in these indicators in school, society, and at home (and also differences based on the boys&quot; ages, school class, and parental status), which would contribute to more understanding of adolescent psychological disorders in general and specifically in teenagers with CD in Saudi Arabia.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "CDs",
    "Conduct Disorder",
    "Taif",
    "adolescents"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "European Scientific Journal",
    "abbreviation": "ESJ",
    "volume": "13",
    "issue": "5",
    "pages": {
      "start": "270",
      "end": "284"
    }
  },
  "authors": [
    {
      "given": "Ahmed",
      "family": "Al Hariri",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.19044__esj.2017.v13n5p270.pdf",
    "sourceUrl": "http://eujournal.org/index.php/esj/article/download/8871/8437"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.19044-esj.2017.v13n5p270",
  "language": "English"
}
