{
  "doi": "10.1007/s10803-025-07079-1",
  "slug": "10.1007-s10803-025-07079-1",
  "title": "Comparing DSM-5 Pathological Personality Traits in Youths With ADHD, Subthreshold ADHD, and Healthy Controls Using the Personality Inventory for DSM-5 (PID-5): A Network Analysis Study",
  "abstract": "This study aimed to examine and compare maladaptive personality trait profiles and their symptom network structures&#8212;assessed via the Personality Inventory for DSM-5 (PID-5)&#8212;in adolescents with full-syndrome ADHD, subthreshold ADHD, and healthy controls A total of 601 participants aged 15&#8211;24 years were recruited in Saudi Arabia and assigned to three age-matched groups based on SCID-5-RV interview results: 200 with DSM-5 ADHD, 187 with subthreshold ADHD (endorsing four or five core symptoms), and 214 healthy controls. All participants completed the 220-item PID-5 and a demographic checklist. Network models were estimated separately for each group, and centrality and bridge metrics were computed. ANOVA and LSD post hoc tests compared PID-5 domain scores. NOVA confirmed a graded pattern across five PID-5 domains, including disinhibition and negative affectivity, following the trend ADHD&#8239;&amp;gt;&#8239;Subthreshold&#8239;&amp;gt;&#8239;Control. Network analysis revealed a strong psychoticism cluster between perceptual dysregulation and eccentricity (edge&#8239;=&#8239;0.25) and a bridge between emotional lability and impulsivity (0.16) in ADHD. In subthreshold ADHD, detachment facets dominated, with anxiousness&#8211;withdrawal linking domains (0.20). Healthy controls exhibited a detachment core (withdrawal&#8211;anhedonia, 0.30) with anhedonia&#8211;depressivity bridging domains (0.20). Centrality analyses identified intimacy avoidance (De3; betweenness&#8239;=&#8239;2.234) and risk taking (Na6; strength&#8239;=&#8239;1.744) as key hubs in ADHD; callousness and irresponsibility (Di3; strength&#8239;=&#8239;1.444) in subthreshold ADHD; and depressivity (An2; strength&#8239;=&#8239;3.074) and perceptual dysregulation in controls. These findings demonstrate distinct maladaptive trait interconnections and central features across ADHD severity, highlighting potential intervention targets such as emotional lability and impulsivity in ADHD, callousness in subthreshold cases, and depressivity in non-clinical youth to disrupt maladaptive personality networks.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Abdullah",
      "family": "Alrubaian",
      "orcid": "https://orcid.org/0000-0002-7733-6931",
      "sequence": 1
    }
  ],
  "access": {
    "status": "closed",
    "sourceUrl": "https://link.springer.com/content/pdf/10.1007/s10803-025-07079-1.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1007-s10803-025-07079-1",
  "publication": {
    "year": 2025
  },
  "journal": {
    "name": "Journal of Autism and Developmental Disorders",
    "issn": "0162-3257"
  },
  "identifiers": {
    "doi": "10.1007/s10803-025-07079-1"
  },
  "language": "English"
}
