{
  "doi": "10.1007/s00127-012-0487-8",
  "slug": "10.1007-s00127-012-0487-8",
  "title": "Mental health research in the Arab world",
  "abstract": "Purpose: To assess the progression of mental health research over four decades in the Arab world. Methods: Publications on mental health in 21 Arab countries from 1966 to 2006 were screened using PubMed and Psychinfo. Data were collected and analyzed for Arab authors and affiliations, publication year, topic and type of journal. Results: In 40 years (1966-2005), the Arab world published 2,213 articles on a vast variety of topics, most common being mood, anxiety and substance use disorders, and mostly in international journals. By the last decade, the total yearly publications increased about eightfold since the first two decades, and nearly doubled from the third one. The disparity of output was high across countries. The highest yearly output was from Egypt, Saudi Arabia, Kuwait and Lebanon. Per million population, the top four producing countries were Kuwait, Bahrain, Lebanon and United Arab Emirates. Conclusions: Over a decade, the Arab world produced approximately 17% of the global output of mental health publications/million population and was comparative to Latin American and Caribbean countries. There is a wide gap in comparison with the industrialized world, with a fertile ground for cross-cultural and genetic studies.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "mental health",
    "research",
    "study"
  ],
  "publication": {
    "year": 2012
  },
  "journal": {
    "name": "Social Psychiatry and Psychiatric Epidemiology",
    "abbreviation": "Soc Psychiatry Psychiatr Epidemiol",
    "volume": "47",
    "issue": "11",
    "pages": {
      "start": "1727",
      "end": "1731"
    }
  },
  "authors": [
    {
      "given": "Doris",
      "family": "Jaalouk",
      "sequence": 1
    },
    {
      "given": "Ahmed",
      "family": "Okasha",
      "sequence": 2
    },
    {
      "given": "Mariana M",
      "family": "Salamoun",
      "sequence": 3
    },
    {
      "given": "Elie G",
      "family": "Karam",
      "sequence": 4
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.1007__s00127-012-0487-8.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1007-s00127-012-0487-8",
  "language": "English"
}
