{
  "doi": "10.14621/tna.20150201",
  "slug": "10.14621-tna.20150201",
  "title": "Furnishing and Indoor Environment for Hyperactivity and Distracted Attention (in the Context of Sustainable Design)",
  "abstract": "Non-government institutions have been upgrading the level of services provided to people with special needs since their numbers have increased worldwide, due to the recognition of new diseases, such as hyperactivity, distracted attention and learning difficulties, which increase in number annually. The main aim of the research is to investigate the criteria of furniture design and class arrangement which reflect the needs and desires of students with ADHD and staff, but unfortunately, schools are often designed and built without fully considering the needs of the community who uses them. Such considerations contribute to develop their ability to learn, i.e. create an appropriate and compatible learning environment with student&quot;s abilities to enhance academic performance. To achieve the aim of the research, the researcher reviewed the literature and previous research to identify: 1- the characteristics and behaviour of ADHA students, as well as the patterns of their movement behaviour in the classrooms; 2- the problems of the students and teachers, which are related to dealing with the elements of furniture. The researcher conducted a field study to observe the behaviour of a group of students, as well as the problems related to the elements of furniture. This is in addition to an interview with a group of specialists to deal with such students. However, this methodology depends on exploring possible options for choosing suitable materials. Since there are many options for choosing sustainable materials that have garnered little attention, material efficiency, using less new materials to achieve the same goals is a rich opportunity to create sufficient spaces for students who suffer from hyperactivity and distracted attention. The research method involved a selected sample of teachers of ADHD students aged from 4 to 12 years from five schools in Riyadh. The aim of this study is to develop design criteria that reflects the foundations and considerations of interior design in the context of the Saudi Code of designing special places for people with special needs according to principles of sustainable material use.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "classroom",
    "design",
    "environment",
    "furnishing",
    "indoor",
    "riyadh",
    "sustainable materials"
  ],
  "publication": {
    "year": 2015
  },
  "journal": {
    "name": "International Journal of Contemporary Architecture The New Arch",
    "abbreviation": "International Journal of Contemporary Architecture",
    "volume": "2",
    "issue": "1",
    "pages": {
      "start": "1",
      "end": "10"
    }
  },
  "authors": [
    {
      "given": "Laila Amer",
      "family": "Alqahtani",
      "sequence": 1
    }
  ],
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/doi__10.14621__tna.20150201.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.14621-tna.20150201",
  "language": "English"
}
