{
  "doi": "10.1016/j.eurpsy.2017.01.407",
  "slug": "10.1016-j.eurpsy.2017.01.407",
  "title": "Knowledge of kindergarten and elementary schools’ teachers regarding attention deficit hyperactivity disorder (Conference Abstract)",
  "abstract": "BackgroundAttention deficit hyperactivity disorder (ADHD) is one of the most common mental disorders that manifest among children. Despite the fact that the teacher&#39;s role is essential in the assessment and management of pupils with ADHD and the recommendation of participation of teachers for the success and efficiency of diagnoses and treatment, the vast majority of teachers have neither understanding nor knowledge of ADHD.ObjectivesThe current study explores the kindergarten and elementary school teachers’ knowledge regarding early detection and management of ADHD.MethodsCross sectional survey using stratified random sampling technique was carried out in governmental and private elementary and kindergarten schools in four cities of Qassim region, Saudi Arabia.ResultsThe study included 1095 teachers, 711 (59.3%) did not get information about ADHD during undergraduate studies. Teachers’ overall ADHD knowledge mean was 21.7 + 5.5 out of 38 marks. Teachers with high qualification degree and kindergarten specialty scored 56.4% and 60.2%, respectively. Teachers who attended conferences related to ADHD scored 64.5%, while teachers who read about ADHD or have been ever asked to diagnose/teach an ADHD student had 59.4% and 62.1%, respectively. The sources for those who got their information through reading were statistically significant in overall knowledge, general knowledge and treatment dimensions. As scientific studies and books were the highest with percentage of 24.6% and 23.3%, respectively, 4% and 3.6%, respectively, 3% and 3%, respectively. The level of ADHD knowledge perception showed that 76% of teachers were knowledgeable in relation to overall ADHD perception.ConclusionTeachers who have higher qualifications or training in identifying ADHD children scored higher in our study.Disclosure of interestThe authors have not supplied their declaration of competing interest.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "S.",
      "family": "Almutairi",
      "sequence": 1
    },
    {
      "given": "M.",
      "family": "Almutairi",
      "sequence": 2
    },
    {
      "given": "A.",
      "family": "Al Harbi",
      "sequence": 3
    },
    {
      "given": "M.",
      "family": "Alsuhaibani",
      "sequence": 4
    },
    {
      "given": "N.",
      "family": "Alkeaid",
      "sequence": 5
    },
    {
      "given": "T.",
      "family": "Albatti",
      "sequence": 6
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.1016__j.eurpsy.2017.01.407.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1016-j.eurpsy.2017.01.407",
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "European Psychiatry",
    "issn": "0924-9338",
    "volume": "41",
    "issue": "S1"
  },
  "identifiers": {
    "doi": "10.1016/j.eurpsy.2017.01.407"
  },
  "language": "English"
}
