{
  "doi": "10.1016/j.ijpam.2017.02.003",
  "slug": "10.1016-j.ijpam.2017.02.003",
  "title": "Prevalence of attention deficit hyperactivity disorder among primary school-children in Riyadh, Saudi Arabia; 2015-2016",
  "abstract": "Objectives: The aim of the study was to 1) determine the prevalence of Attention Deficit Hyperactivity Disorder (ADHD) among both governmental and private primary Saudi school children, 2) measure the gender difference of ADHD prevalence, and 3) determine any association between the socio-demographic characteristic of the parents of children with ADHD. Methods: This is an observational cross-sectional study of 1000 primary school children belonging to 1st, 2nd and 3rd grade. The selected students were screened by the ADHD rating scale using multistage sampling technique. The first stage was selection of 20 schools from all Riyadh regions by simple randomization. The second stage was choosing children whom serial numbers were multiples of five in each class. The ADHD rating scale was filled by both parents and teachers along with a socio-demographic questionnaire for the parents. Results: The estimated prevalence of ADHD was 3.4%. ADHD manifestations affect boys more than girls. In addition, ADHD was more frequent among children of illiterate mothers. Finally, ADHD was significantly more prevalent among first grade children. Conclusion: This epidemiological study filled the data gap of ADHD prevalence in Riyadh. The study&rsquo;s findings go in line with many nearby and global studies.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "ADHD",
    "Socio-demographics",
    "children",
    "featured",
    "prevalence",
    "research",
    "riyadh",
    "saudi arabia",
    "study"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "International Journal of Pediatrics and Adolescent Medicine",
    "abbreviation": "ijpam",
    "volume": "4",
    "issue": "3",
    "pages": {
      "start": "91",
      "end": "94"
    }
  },
  "authors": [
    {
      "given": "Turki Homoud",
      "family": "Albatti",
      "sequence": 1
    },
    {
      "given": "Zhour",
      "family": "Alhedyan",
      "sequence": 2
    },
    {
      "given": "Norah",
      "family": "Alnaeim",
      "sequence": 3
    },
    {
      "given": "Anjod",
      "family": "Almuhareb",
      "sequence": 4
    },
    {
      "given": "Jawaher",
      "family": "Alabdulkarim",
      "sequence": 5
    },
    {
      "given": "Rawan",
      "family": "Albadia",
      "sequence": 6
    },
    {
      "given": "Khawla",
      "family": "Alshahrani",
      "sequence": 7
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.1016__j.ijpam.2017.02.003.pdf",
    "sourceUrl": "https://doi.org/10.1016/j.ijpam.2017.02.003",
    "license": "cc-by-nc-nd"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1016-j.ijpam.2017.02.003",
  "language": "English"
}
