{
  "doi": "10.21608/sero.2020.104313",
  "slug": "10.21608-sero.2020.104313",
  "title": "Level of Awareness among Teachers about Attention Deficit Hyperactivity Disorder (ADHD) (A field study in the Eastern Province of Saudi Arabia)",
  "abstract": "The present study aimed to identify the Level of Awareness among Public Schools' Teachers about Attention Deficit Hyperactivity Disorder (ADHD) in the Eastern Province of Saudi Arabia. For the purposes of the study, the researcher employed the descriptive analytical method. The study sample consisted of (126) teachers whom (79) male and (47) female of the public school workers in the eastern province of Saudi Arabia that they were chosen in a simple random manner. The researcher designed the teachers' awareness scale for ADHD, extracted its connotations validity and reliability acceptable for the purposes of measuring level of awareness among public schools' teachers about ADHD.\nThe results showed that the level of awareness of teachers of public schools of the disorder was medium on the total score of scale and its' the three domains, the three domains were arranged consecutively (characteristics and diagnosis, treatment, and general knowledge of the disorder). The results also showed that there were no significant differences between male and female teachers in their level of awareness about ADHD due to specialization and teaching experience variables. Additionally, the results of the study showed that there were significant differences between male and female teachers in their level of awareness about ADHD due to school year variable in favor of the middle stage in the general knowledge domain. Moreover, the results indicated that there were statistically significant differences between male and female teachers in their level of awareness about ADHD due to the gender variable in favor of female teachers on the Total score of scale and in the characteristics and diagnosis domain.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "Level of Awareness among Teachers",
    "Attention deficit hyperactivity disorder",
    "awareness"
  ],
  "authors": [
    {
      "given": "Tareq Yousef",
      "family": "Melhem",
      "sequence": 1
    }
  ],
  "publication": {
    "year": 2020
  },
  "journal": {
    "name": "Journal of Special Education and Rehabilitation"
  },
  "access": {
    "status": "open",
    "sourceUrl": "https://sero.journals.ekb.eg/article_104313.html",
    "researchGateUrl": "https://www.researchgate.net/publication/343470114_wy_almlmyn_walmlmat_badtrab_tshtt_alantbah_wfrt_alhrkt_drast_mydanyt_fy_almntqt_alshrqyt_balswdyt_Level_of_Awareness_among_Teachers_about_Attention_Deficit_Hyperactivity_Disorder_ADHD_A_field_study_in",
    "localPdfUrl": "library/doi__10.12816__0055785.pdf"
  },
  "identifiers": {
    "doi": "10.21608/sero.2020.104313",
    "url": "https://sero.journals.ekb.eg/article_104313.html"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.21608-sero.2020.104313",
  "language": "Arabic"
}
