{
  "id": "doi-10.21608-jasht.2024.337376",
  "slug": "10.21608-jasht.2024.337376",
  "doi": "10.21608/jasht.2024.337376",
  "identifiers": {
    "doi": "10.21608/jasht.2024.337376"
  },
  "title": "The Level of Availability of International and Local Standards in Individual Educational programs for Students with Attention Deficit Hyperactivity Disorder",
  "language": "Arabic",
  "categories": [
    "Education"
  ],
  "access": {
    "status": "open",
    "licenseUrl": null,
    "sourceUrl": "https://jasht.journals.ekb.eg/article_337376_ff38462575e459574214b46ac387c947.pdf",
    "localPdfUrl": "library/doi__10.21608__jasht-2024-337376.pdf",
    "researchGateUrl": "https://www.researchgate.net/publication/377757210_mstwy_twfr_almayyr_alalmyt_walmhlyt_fy_albramj_altrbwyt_alfrdyt_lltlbt_dhwy_adtrab_frt_alhrkt_wtshtt_alantbah"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Hanan Ali Mohammad‎",
      "family": "Al-Qarni",
      "sequence": 1
    }
  ],
  "publication": {
    "year": 2024
  },
  "journal": {
    "name": "The Arab Journal of Disability and Talent Sciences",
    "issn": "2537-0499",
    "volume": "8",
    "issue": "29",
    "pages": {
      "start": "45",
      "end": "74"
    }
  },
  "abstract": "This study aimed to identify the level of availability of international and local standards in individual educational programs for students with attention deficit hyperactivity disorder and to measure the differences between them according to some variables (gender, academic qualification) for males and females. Parameters using the descriptive analytical approach. It included a sample of 234 individual educational programs for students with attention-deficit/hyperactivity disorder in general education schools in Riyadh, and 64 male and female teachers for students with attention-deficit/hyperactivity disorder in general education schools in Riyadh. The study tools were designed in light of the study objectives and questions. The results of the study showed a low level of availability of global and local standards in individual educational programs for students with attention-deficit/hyperactivity disorder, as well as the presence of statistically significant differences in the overall degree of availability of global and local standards. In individual educational programs for students with attention deficit hyperactivity disorder according to the variable (gender). ) in favor of females, while there are no differences in academic qualification. Keywords: individual educational program, international and local standards.\n\nمستوى توّفر المعايير العالميّة والمحليّة في البرامج التربوية الفردية للطلبة ‏ذوي اضطراب فرط الحركة وتشتت الانتباه\n\nهدَفَت هذه الدراسة إلى التعرف على مستوى توفر المعايير العالمية والمحلية في البرامج التربوية الفردية للطلبة ذوي اضطراب فرط الحركة وتشتت الانتباه وقياس الفروق بينها وفقاً لبعض المتغيِّرات(الجنس، والمؤهل العلمي) لمعلميهم ومعلماتهم باستخدم المنهجَ الوصفيَّ التحليلي؛ على عينةُ مكونة من 234 برنامجاً تربوياً فردياً للطلاب ذوي اضطراب فرط الحركة وتشتت الانتباه في مدارس التعليم العام بمدينة الرياض، و٦٤ معلماً ومعلمة للطلبة ذوي اضطراب فرط الحركة وتشتت الانتباه في مدارس التعليم العام بمدينة الرياض، وصممت أدوات الدراسة في ضوء أهداف وأسئلة الدراسة. وأظهرت نتائج الدراسة انخفاض مستوى توفر المعايير العالمية والمحلية في البرامج التربوية الفردية للطلبة ذوي اضطراب فرط الحركة وتشتت الانتباه، ووجود اختلافات ذات دلالة إحصائية في الدرجة الكلية لمستوى توفر المعايير العالمية والمحلية في البرامج التربوية الفردية للطلبة ذوي اضطراب فرط الحركة وتشتت الانتباه تبعاً لمتغير (الجنس) لصالح الإناث، في حين لا يوجد اختلافات في المؤهل العلمي."
}
