{
  "id": "doi-10.33193-jalhss.128.2026.1621",
  "slug": "10.33193-jalhss.128.2026.1621",
  "doi": "10.33193/jalhss.128.2026.1621",
  "identifiers": {
    "doi": "10.33193/jalhss.128.2026.1621"
  },
  "title": "The Level of Knowledge of Teachers of Students with ADHD About the “Cover-Copy-Compare” Strategy in Inclusive Elementary Schools in Riyadh",
  "language": "Arabic",
  "categories": [
    "Awareness"
  ],
  "access": {
    "status": "open",
    "licenseUrl": "https://creativecommons.org/licenses/by-sa/4.0/",
    "sourceUrl": "https://www.jalhss.com/index.php/jalhss/article/download/1621/1602",
    "localPdfUrl": "library/doi__10.33193__JALHSS-128-2026-1621.pdf",
    "researchGateUrl": "https://www.researchgate.net/publication/400207872_mstwy_mrft_mlmat_frt_alhrkt_wtshtt_alantbah_bastratyjyt_akhf_anskh_thm_qarn_fy_mdars_aldmj_llmrhlt_alabtdayyt_bmdynt_alryad",
    "license": "cc-by-sa"
  },
  "visibility": {
    "hidden": false
  },
  "abstract": "The  current  study  aims  to  identify  the  level  of  knowledge  of teachers with  ADHD about  the  \"Cover-Copy-Compare\"  strategy  in  elementary  schools  in  Riyadh. Additionally, it aims to shed light on the level of knowledge of teachers with ADHD in applying the \"Cover-Copy-Compare\" strategy anduncover the obstacles that limit teachers  of  students  with  ADHD  from  implementing  this  strategy.  To  achieve  the objectives   of   this   study,   the   descriptive   approach   was   used   by   applying   a questionnaire  distributed  to  all  teachers,  which  was  answered  by  (52)  teachers representing (72.2%) of the total study population. The study reached several results, most notably: the level of knowledge of teachers of students with ADHD about the \"Cover-Copy-Compare\" strategy was low, thelevel of application of the \"Hide, Copy, Then  Compare\"  strategy  by  teachers  with  students  with  ADHD  was  high,  and  there was high agreement among the study participants on the obstacles limiting teachers of students with ADHD from implementing the \"Hide, Copy, Then Compare\" strategy.\n\nمستوى معرفة معلمات فرط الحركة وتشتت الانتباه باستراتيجية (أخف، انسخ، ثم قارن) في مدارس الدمج للمرحلة الابتدائية بمدينة الرياض\n\nتسعى الدراسة الحالية إلى معرفة مستوى معلمات فَرْط الحركة وتَشتُّت الانتباه باستراتيجية «أخْفِ، انسَخْ، ثم قارِنْ» في المدارس الابتدائية بمدينة الرياض، بالإضافة إلى تسليط الضوء نحو مستوى معرفة معلمات فَرْط الحركة وتَشتُّت الانتباه بتطبيق استراتيجية «أخْفِ، انسَخْ، ثم قارِنْ»، والكشف عن المعوقات التي تحد من تطبيق معلمات فَرْط الحركة وتَشتُّت الانتباه لهذه الاستراتيجية. ولتحقيق أهداف هذه الدراسة تم استخدام المنهج الوصفي، وذلك بتطبيق الاستبانة -أو ما يعرف بالاستقصاء- وهي أداة تتضمَّن مجموعة من الأسئلة أو الجُمل الخبرية التي تتطلب الإجابة عنها بطريقة يُحدِّدها الباحث حسَب أغراض البحث، وقد قامت الباحثة بتوزيع أداة الدراسة على جميع المعلمات، استجاب معها (52) معلمة، وهن يُمثِّلن (72.2%) من إجمالي مجتمع الدراسة. وتوصلت الدراسة إلى جملة من النتائج، من أبرزها: أن مستوى معرفة معلمات فَرْط الحركة وتَشتُّت الانتباه باستراتيجية «أخْفِ، انسَخْ، ثم قارِنْ» جاء بدرجة منخفضة، وأن مستوى تطبيق معلمات فَرْط الحركة وتَشتُّت الانتباه لاستراتيجية «أخْفِ، انسَخْ، ثم قارِنْ» مع تلاميذ فَرْط الحركة وتَشتُّت الانتباه جاء بدرجة عالية، بالإضافة إلى أن هناك موافقة بدرجة عالية بين أفراد الدراسة على المعوقات التي تَحدّ من تطبيق معلمات فَرْط الحركة وتَشتُّت الانتباه لاستراتيجية «أخْفِ، انسَخْ، ثم قارِنْ» مع تلاميذ فَرْط الحركة وتَشتُّت الانتباه.",
  "authors": [
    {
      "given": "Bushra Jassim",
      "family": "Alenazi",
      "sequence": 1
    },
    {
      "given": "Nouf",
      "family": "Alzrayer",
      "sequence": 2
    }
  ],
  "publication": {
    "year": 2026
  },
  "journal": {
    "name": "Journal of Arts, Literature, Humanities and Social Sciences",
    "issn": "2414-3383",
    "issue": "128",
    "pages": {
      "start": "146",
      "end": "170"
    }
  }
}
