{
  "doi": "10.47750/jett.2022.13.06.065",
  "slug": "10.47750-jett.2022.13.06.065",
  "title": "Attention Deficit Hyperactivity Disorder (ADHD) And its Relationship to Depression among Male and Female Students of Primary School in Riyadh, Kingdom of Saudi Arabia",
  "abstract": "This study examined the relationship between Attention Deficit Hyperactivity Disorder (ADHD) and depression in Riyadh, Saudi Arabia, primary school kids. The study will also examine Attention Deficit Hyperactivity Disorder and sadness by gender. 200 mixed-gender primary school students from many schools were the study sample. They were 9–13. The descriptive (comparative) study used the Pearson correlation coefficient and t test. The study used Al-Naubi (2005)'s Attention Deficit Hyperactivity Disorder exam and the Scale of Children's Depression. developed by Abdul Khalique, Ahmed (1991). The questionnaire was the primary data collection technique. The study found a positive correlation and statistical significance between the total sample of primary school students (both sexes)' Attention Deficit Hyperactivity Disorder test scores and their Scale of Children's Depression test scores. The study found statistically significant differences between the average scores of the study sample members from primary school kids in the variable Attention Deficit Hyperactivity Disorder according to gender, favoring males. The average depression scores of primary school students were likewise statistically significant, favoring females. The study suggests using new and diverse educational approaches for ADHD children to create an appealing learning environment and activate family therapy for them and their families to find the optimal educational methods.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "Attention Deficit Hyperactivity Disorder",
    "family therapy",
    "depression"
  ],
  "publication": {
    "year": 2022
  },
  "journal": {
    "name": "Journal for Educators, Teachers and Trainers",
    "abbreviation": "JETT",
    "volume": "13",
    "issue": "6",
    "pages": {
      "start": "640",
      "end": "650"
    }
  },
  "authors": [
    {
      "given": "Sultan Mousa",
      "family": "Al-Owidha",
      "authorship": "Primary Author",
      "sequence": 1
    },
    {
      "given": "Nevien Mohamed",
      "family": "Zahran",
      "sequence": 2
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.47750__jett.2022.13.06.065.pdf",
    "sourceUrl": "https://jett.labosfor.com/index.php/jett/article/download/1410/842/5630"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.47750-jett.2022.13.06.065",
  "language": "English"
}
