{
  "doi": "10.4236/psych.2013.412139",
  "slug": "10.4236-psych.2013.412139",
  "title": "Teachers’ Knowledge and Misconceptions of Attention Deficit/Hyperactivity Disorder",
  "abstract": "Teachers can play a key role in identifying and supporting students with Attention Deficit/Hyperactivity Disorder (ADHD). In order to fulfill this important role, it is imperative for teachers to have explicit knowledge about ADHD. The overall aim of this study is to investigate teachers knowledge and misconceptions of ADHD. Four hundred and twenty-nine (429) teachers participated. The Knowledge of Attention Deficit Disorder Scale (KADDS) along with a demographic questionnaire was used as the survey instruments to collect data. Descriptive statistics and correlation test were used to analyze the data. Results indicated that teachers knowledge of ADHD was insufficient. Teachers level of knowledge of ADHD was positively related to their prior training and experience with ADHD (i.e., the number of ADHD courses taken in college or graduate level, and the number of workshops pertaining to ADHD). Teachers level of knowledge of ADHD also correlated positively with their level of confidence in teaching a student with ADHD. In spite of a few limitations, the results of this study are valuable for identifying areas where there is a misperception or lack of knowledge among teachers.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "featured",
    "misconceptions",
    "riyadh",
    "study",
    "teachers",
    "awareness"
  ],
  "publication": {
    "year": 2013
  },
  "journal": {
    "name": "Psychology",
    "abbreviation": "Psychology",
    "volume": "4",
    "issue": "12",
    "pages": {
      "start": "963",
      "end": "969"
    }
  },
  "authors": [
    {
      "given": "Keetam D.F.",
      "family": "Alkahtani",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.4236__psych.2013.412139.pdf",
    "sourceUrl": "http://www.scirp.org/journal/PaperDownload.aspx?paperID=40861",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4236-psych.2013.412139",
  "language": "English"
}
