{
  "doi": "10.5281/zenodo.3742099",
  "slug": "10.5281-zenodo.3742099",
  "title": "Judge the Pediatric Nurse's Information Related to Children with Attention Deficit Hyperactivity Disorders at Najran City",
  "abstract": "Background: Many children suffer from attention deficit hyperactivity disorder (ADHD), which is defined as a persistent pattern of inattention or impulsivity that is formed during growth. The aim of this study was to examine the pediatric nurses information and attitude related to children with ADHD. Research design: A descriptive research design was utilized in this study. Setting: The study was conducted at Maternity and Childhood hospital, Najran University at Saudi Arabia. Sample: Purposive sample from all pediatric nurses at previously mentioned setting were used in this study. The tools: were used in data collection. Tool 1:Part one: Involve socio-demographic characteristics of all study samples. Part two: Pediatric Nurses information related to children with ADHD. Tool 11: Pediatric nurses attitude related to children with ADHD. Results: half of pediatric nurses (53%) were in age group of 20:&lt;30 years and the mean age of them was (25.6 ±1.95 years. 83% of the pediatric nurses had positive attitude towards affective attitude of children with ADHD. There was statistically significant difference between pediatric nurses' socio-demographic characteristics and their total level of information and their attitude related to children with ADHD. Conclusion: The study concluded that there was most of the pediatric nurses, information in the present study felt inadequate to handle the responsibility of ADHD children. Recommendations: An educational program is needed for pediatric nurses to significantly improved the information and attitudes towards children with ADHD. Suggest greater efforts must be made to provide pediatric nurses training specifically in the identification, symptoms, etiology, prognosis and management of the children with ADHD.  Keyword: Nurses, pediatric, ADHD and information, attitude.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Dr. Howaida Moawad Ahmed",
      "family": "Ali",
      "sequence": 1
    }
  ],
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/doi__10.5281__zenodo.3742099.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.5281-zenodo.3742099",
  "journal": {
    "name": "Zenodo (CERN European Organization for Nuclear Research)"
  },
  "publication": {
    "year": 2020
  },
  "language": "English"
}
