{
  "doi": "10.5539/gjhs.v11n3p32",
  "slug": "10.5539-gjhs.v11n3p32",
  "title": "Saudi Arabian Pre-Service Special Education Teachers Knowledge of Attention-Deficit/Hyperactivity Disorder (ADHD)",
  "abstract": "The current study aims at detecting the level of knowledge held by special education student teachers at Umm Al-Qura University with regard to Attention-Deficit/Hyperactivity Disorder (ADHD), and comparing their level of knowledge of (ADHD) according to variables: Gender (male or female), track or specialty (special education ,mental disability, learning disabilities, hearing disability, behavioral disorders and Behavioral Disorders and Autism), school year or university level (first year, second year, third year, and fourth year). The sample of the study consists of (682) students who were selected randomly from the Department of Special Education at Umm Al-Qura University in Makkah in the Kingdom of Saudi Arabia for the academic year (1437H-1438H), and SPSS was applied for data analysis. The results showed that Saudi Arabian Pre-Service Special Education Teachers&amp;rsquo; overall knowledge is high (64.2%). The correct rate of knowledge of ADHD was (93.0 %) and (86.8) (&amp;lsquo;high&amp;rsquo;), respectively. As for the sex differences were in favor of females, as for year and track or specialty variables, Pairwise Multiple Comparisons Post Hoc Test using LSD method. Implications of the study results are discussed, and recommendations are presented.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Al-Hwaiti",
      "family": "Mohammed",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.5539__gjhs.v11n3p32.pdf",
    "sourceUrl": "http://www.ccsenet.org/journal/index.php/gjhs/article/download/0/0/38536/39158",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.5539-gjhs.v11n3p32",
  "publication": {
    "year": 2019
  },
  "journal": {
    "name": "Global Journal of Health Science",
    "issn": "1916-9744",
    "volume": "11",
    "issue": "3",
    "pages": {
      "start": "32",
      "end": null
    }
  },
  "identifiers": {
    "doi": "10.5539/gjhs.v11n3p32"
  },
  "language": "English"
}
