{
  "id": "legacy-85151e0507",
  "slug": "attention-deficit-hyperactivity-disorder-epidemiologic-pathophysiologic-diagnostic-and-treatment-perspectives-2001",
  "title": "Attention deficit hyperactivity disorder: Epidemiologic, pathophysiologic, diagnostic and treatment perspectives",
  "abstract": "Although attention deficit hyperactivity disorder is a common child psychiatric disorder, the epidemiology and pathophysiology of attention deficit hyperactivity disorder is variable in different studies. Attention deficit hyperactivity disorder and comorbid disorders in children aided both by attention deficit hyperactivity disorder diagnostic criteria and assessment scales entails a comprehensive neuropsychiatric interview plus collection of information from different sources. Although psychosocial and behavioral therapies are of great therapeutic values, the psychopharmacological drugs are often used in the treatment of patients with attention deficit hyperactivity disorder. With a combined approach, a substantial proportion of patients with attention deficit hyperactivity disorder (90%) show good recovery. The patients with attention deficit hyperactivity disorder need careful evaluation and appropriate long-term treatment in order to prevent subsequent negative consequences. In rapidly developing countries, the researchers should carry out studies, which explore different aspects of attention deficit hyperactivity disorder in children, adolescents and adults.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "ADHD",
    "buraidah",
    "epidemiology",
    "featured",
    "review",
    "study"
  ],
  "publication": {
    "year": 2001
  },
  "journal": {
    "name": "Saudi Medical Journal",
    "abbreviation": "Saudi Med J",
    "volume": "22",
    "issue": "8",
    "pages": {
      "start": "666",
      "end": "673"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/attention-deficit-hyperactivity-disorder-epidemiologic-pathophysiologic-diagnostic-and-treatment-perspectives-2001-f1a8465ad4.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Y S",
      "family": "Al-Ghamdy",
      "sequence": 1
    },
    {
      "given": "Naseem A.",
      "family": "Qureshi",
      "sequence": 2
    }
  ],
  "language": "English"
}
