{
  "id": "legacy-68980d7795",
  "slug": "awareness-of-attention-deficit-hyperactivity-disorder-among-special-education-students-in-riyadh-and-qassim-regions-of-saudi-arabia-cross-sectional-study-2023",
  "title": "Awareness of Attention Deficit Hyperactivity Disorder Among Special Education Students in Riyadh and Qassim Regions of Saudi Arabia – Cross Sectional Study",
  "abstract": "Background: ADHD is a chronic genetic neurodevelopmental disorder. Which is represented by either inattention or hyperactivity symptoms or both. Subsequently, the peak of symptoms appears during childhood and decreases with growing older. Plenty of researches showed various factors could contribute to increasing symptoms' severity. ADHD is considered as one of the most common neurodevelopmental disorders. Yet, Saudi society's awareness of it appears to be relatively lacking. Apart from that, researches showed that teachers and parents misconception about the disorder affects children's improvement as a result of decreased support and not providing a healthy environment for children's case.\n\nObjectives: The general objective is to measure awareness levels of ADHD among college students who majored in special education. Besides, other specific objectives such as assessing their knowledge about dealing with an ADHD child, assessing their thoughts about having an ADHD course and its importance in their career, and evaluating ADHD involvement within special education curriculums.\n\nMethods: Data were collected through a demographic questionnaire along with the Knowledge of Attention Deficit Disorders Scale (KADDS). Then, processed by the SPSS Statistics program.\n\nResults: The 88 participants recorded low levels of awareness (39.74%). Especially in the aspects of general features and treatment of the disorder. With a significant difference in the knowledge level regarding those who took university courses about ADHD 86.4% and those who did not. 87.5% of special education students in our sample showed interest in adding a separate course about ADHD. Finally, 89.8% of special education students found their knowledge about ADHD critical in their future careers.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "ADHD",
    "Teachers",
    "Special Education",
    "awareness"
  ],
  "publication": {
    "year": 2023
  },
  "journal": {
    "name": "Bahrain Medical Bulletin",
    "abbreviation": "Bahrain Medical Bulletin",
    "volume": "45",
    "issue": "1",
    "pages": {
      "start": "1341",
      "end": "1347"
    }
  },
  "access": {
    "status": "open",
    "license": "CC BY",
    "localPdfUrl": "library/awareness-of-attention-deficit-hyperactivity-disorder-among-special-education-students-in-riyadh-and-qassim-regions-of-saudi-arabia-cross-se-2023-9bd1eac7f3.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "language": "English"
}
