{
  "id": "legacy-2bff65a01e",
  "slug": "the-acquisition-of-discourse-markers-in-arabic-first-language-acquisition-a-case-study-of-a-saudi-adhd-child-2012",
  "title": "The Acquisition of Discourse Markers in Arabic First Language Acquisition: A Case Study of a Saudi ADHD Child",
  "abstract": "The present study investigated the acquisition of discourse markers as being part of complex structures by an Arab monolingual ADHD child, who is also a late talker. The selected child is the offspring of one of the researchers. The child had been observed since the age of five and four months to the age of seven (20 months); his conversations with his mother and family members were tape- recorded, and phonetically transcribed for analysis. The study has three main concerns: first, to examine and analyze systematically the acquisition of discourse markers in Arabic in ADHD children; secondly, trace the type of deviance and the number of deviant structures uttered by the child. Thus, we can see how long it takes the child to overcome the gap and acquire these structures as part of his language inventory. Results indicated that the verbal production of the child significantly exhibits fewer discourse markers which result in loosely connected utterances and less organized structures, i.e. ADHD children are more likely than other children to produce ungrammatical structures and less cohesive utterances. Moreover, the order of the acquisition of some connectives is in line with the literature of typical language development, nonetheless, the child was found late in his acquisition of these discourse markers. In addition, the analysis of the redundant deviant constructions indicated that the child\"s employed a number of systematic strategies (omission and/or substitution) in the formation of ungrammatical structures. It is hoped that the obtained results will contribute to the literature of first language acquisition as well as the comorbidity of ADHD and delayed language development in the affected children by providing insights into (i) how first language acquisition proceeds in an ADHD child, and (ii) how speech delay, the most common co-morbid disorder, affects normative language development of an ADHD child, by specifying and analyzing the type as well as the redundancy of deviant structures in his speech.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "Language",
    "arabic",
    "featured",
    "riyadh",
    "saudi",
    "study"
  ],
  "publication": {
    "year": 2012
  },
  "journal": {
    "name": "The Online Journal of Counselling and Education",
    "abbreviation": "TOJCE",
    "volume": "1",
    "issue": "1",
    "pages": {
      "start": "39",
      "end": "66"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/the-acquisition-of-discourse-markers-in-arabic-first-language-acquisition-a-case-study-of-a-saudi-adhd-child-2012-08071bfb16.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "language": "English"
}
