{
  "id": "legacy-fc24dce4e2",
  "slug": "the-need-for-teaching-strategies-for-students-with-attention-deficit-hyperactivity-disorder-at-saudi-arabian-schools-2016",
  "title": "The Need for Teaching Strategies for Students with Attention Deficit Hyperactivity Disorder at Saudi Arabian Schools",
  "abstract": "Attention Deficit Hyperactivity Disorder (ADHD) is prevalent in schools around the world today. Over 1.6 million Saudi children suffer from ADD/ADHD today, which is comparable with other nations. Roughly 11% of US students are effected by ADHD and 15% of Saudi students. The Saudi Arabian Ministry of Education has approved the implementation of ADD/ADHD programs in schools. However, teachers in Saudi Arabia are not well prepared to work with the issues that they are facing in their classrooms with these students. Both teachers and parents can benefit from learning new strategies to work with their ADD/ADHD students. The lack of proper instructional strategies employed and understanding of the disorder cause students to fall behind and struggle academically. There are many simple resources that teachers can tap into for help; however, many are not prepared to teach students with ADHD. This study seeks to gather information through survey questionnaires and research regarding teacher's as well as student advisor's understanding and perspectives of ADD/ADHD and to provide information in order to bring awareness of different types of strategies for Saudi teachers, student advisors and parents to implement with elementary, middle, and high school students in their academic achievements. This project also seeks to develop a program and Guidebook for teachers and parents to use providing information and instructional strategies to help them with students with ADD/ADHD.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "ADHD",
    "Students",
    "Teaching Strategies",
    "attitudes",
    "featured",
    "jeddah",
    "awareness"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "International Journal of Scientific Research in Science & Technology",
    "abbreviation": "IJSRST",
    "volume": "2",
    "issue": "6",
    "pages": {
      "start": "164",
      "end": "176"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/the-need-for-teaching-strategies-for-students-with-attention-deficit-hyperactivity-disorder-at-saudi-arabian-schools-2016-92e13e888f.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "language": "English"
}
