{
  "id": "legacy-53487fc46e",
  "slug": "the-possible-impact-of-interlocutor-familiarity-on-verbal-interaction-in-children-with-adhd-2016",
  "title": "The Possible Impact of Interlocutor Familiarity on Verbal Interaction in Children with ADHD",
  "abstract": "Previous research studies have suggested that interlocutor differences have both a quantitative and qualitative impact on Typically Developing (TD) children\"s verbal interaction. At the same time the research literature was not so clear when it comes to the influence of interlocutor differences on the verbal interaction of children with Attention Deficit Hyperactivity Disorder (ADHD). The current research study investigated the impact of the interlocutor familiarity on both the TD and ADHD Subgroups using quantitative approach. This was achieved by testing whether or not there was a statistically significant difference in the total number of words during the session, total number of verbal turns, average number of words per turn, and the average number of words per minute during the FI-child (Familiar Interlocutor-child) interaction compared to the UI-child (Unfamiliar Interlocutor-child) interaction. It was expected that interlocutor familiarity would have a greater impact on the ADHD group. The participants were twenty 4-5 year old boys. The were TD and ten had diagnosis of ADHD. A speech sample during free play was collected from each child in conversation with UI and FI in two separate sessions. All sessions were audio-visual recorded using two video cameras. Transcriptions and coding systems were used to analyse the data. Comparisons were made between the TD children and the children with ADHD using quantitative techniques. The results of the quantitative study for the interlocutor impact showed no significant effect of interlocutor was found. Between-group comparison showed no significant difference between the UI and the FI sessions in either the ADHD group or the TD group at the level of the total number of words, the total number of verbal turns, the average number of words per turn, or the average number of words per minute. It was predicted that children with ADHD would be more sensitive than TD to the interlocutor factor but the results of the current study showed that the children with ADHD are not different from TD children in terms of the difference between UI and FI sessions. On the other hand, the TD children were obviously more verbal quantitatively in terms of number of words and turns produced during the UI and the FI sessions. It was observed that during the UI and FI sessions with the children with ADHD, some interlocutors, especially mothers, were sitting quietly watching the children with ADHD playing, without trying again to communicate after a communication failure. The ADHD mothers in the current study may have expected less out of them at the verbal level. Presented during the 30th World Congress of the International Association of Logopedics and Phoniatrics, Dublin, Ireland, 21-25 August 2016. Author Affiliation: Queen Margaret University, Edinburgh, UK King Saud University, Riyadh, Saudi Arabia Psych Care Clinics, Riyadh, Saudi Arabia",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "Language",
    "Speech",
    "boys",
    "featured",
    "riyadh",
    "study"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "30th World Congress of the International Association of Logopedics and Phoniatrics, Dublin",
    "abbreviation": "IALP"
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/the-possible-impact-of-interlocutor-familiarity-on-verbal-interaction-in-children-with-adhd-2016-603be30c3e.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "language": "English"
}
