{
  "id": "legacy-9f8ee66c4e",
  "slug": "the-knowledge-and-beliefs-concerning-attention-deficit-hyperactivity-disorder-adhd-held-by-children-with-adhd-in-saudi-arabia-2014",
  "title": "The knowledge and beliefs concerning attention deficit hyperactivity disorder (ADHD) held by children with ADHD in Saudi Arabia",
  "abstract": "Attention Deficit Hyperactivity Disorder (ADHD) is considered one of the most frequently diagnosed psychiatric childhood disorders. It has an effect on 3-5% of school-aged children, and brings about difficulties in academic and social interaction with both parents and teachers. The rationale behind this study is the exploration of the knowledge and beliefs of children regarding ADHD. The results of the survey based on the responses of 58 children to the ADHD Knowledge and Opinions Questionnaires and subsequent interviews showed positive choices of evidence-based medication and psychosocial treatment, and an understanding of the range of effects of ADHD, and the possible handling strategies. Children were able to determine environments in which ADHD made it difficult for them to be, and also identify adults who they considered capable of assisting them with their condition. Overall, the findings reveal that, whilst children have some knowledge regarding ADHD, demystification workshops are required.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "beliefs",
    "children",
    "featured",
    "jeddah",
    "knowledge",
    "study",
    "awareness"
  ],
  "publication": {
    "year": 2014
  },
  "journal": {
    "name": "Turkish International Journal of Special Education and Guidance Counseling",
    "abbreviation": "TIJSEG",
    "volume": "3",
    "issue": "1",
    "pages": {
      "start": "1",
      "end": "12"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/the-knowledge-and-beliefs-concerning-attention-deficit-hyperactivity-disorder-adhd-held-by-children-with-adhd-in-saudi-arabia-2014-7f535e11bc.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Mohaned G.",
      "family": "Abed",
      "orcid": "https://orcid.org/0000-0002-3425-4725",
      "sequence": 1
    },
    {
      "given": "Susan",
      "family": "Pearson",
      "sequence": 2
    },
    {
      "given": "Philip A.",
      "family": "Clarke",
      "orcid": "https://orcid.org/0000-0002-9042-4856",
      "sequence": 3
    },
    {
      "given": "Mary E.",
      "family": "Chambers",
      "sequence": 4
    }
  ],
  "language": "English"
}
