{
  "paperId": "018f65016e0d4fbec8cf73590f3ef298556f9b1c",
  "title": "EFL Special Education Teachers’ Perspectives: Evaluating Game-Based Learning for ADHD Behavioral Disorders",
  "year": 2024,
  "openAccessPdf": {
    "url": "",
    "status": "CLOSED",
    "license": null,
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1177/10870547241265877?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1177/10870547241265877, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "authors": [
    {
      "authorId": "2084596812",
      "name": "Amr M. Mohamed"
    },
    {
      "authorId": "2090149486",
      "name": "T. Shaaban"
    },
    {
      "authorId": "2313087461",
      "name": "H. Jmaiel"
    }
  ],
  "abstract": "Objective: The purpose of this study was to examine the perspectives of English as a Foreign Language Special Education teachers (EFLSE) regarding game-based learning approaches for addressing behavioral disorders in ADHD patients. Method: The study involved a sample (n = 131) of EFLSE teachers who completed a questionnaire to determine how feasible, acceptable, and helpful they found game-based learning. Results: The study revealed that EFLSE teachers perceive game-based learning to be a feasible and acceptable method for engaging ADHD students and helping to maintain their attention during game-based learning activities. Nevertheless, implementation and individualized approaches are cited as challenges. Additionally, EFLSE teachers emphasized the benefits of game-based learning, including improved problem-solving, assessment methods, collaboration, and the acquisition of academic skills. Conclusions: The study contributes insights for educators, policymakers, and researchers that can support the development of evidence-based interventions offering game-based learning for students with ADHD."
}