{
  "paperId": "1c990bec3bc6c22ac3acebbac6d457129cca4015",
  "title": "Risk factors for ADHD and comorbid psychiatric, academic and behavior problems among primary school students in Jeddah, Saudi Arabia",
  "year": 2020,
  "openAccessPdf": {
    "url": "",
    "status": null,
    "license": null,
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1177/0091217420982266?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1177/0091217420982266, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "authors": [
    {
      "authorId": "7273185",
      "name": "F. Al Zaben"
    },
    {
      "authorId": "6334135",
      "name": "M. Sehlo"
    },
    {
      "authorId": "15434694",
      "name": "W. Alghamdi"
    },
    {
      "authorId": "6332592",
      "name": "H. Tayeb"
    },
    {
      "authorId": "2338394599",
      "name": "D. Khalifa"
    },
    {
      "authorId": "1395981114",
      "name": "A. Altowaireb"
    },
    {
      "authorId": "2256062454",
      "name": "R. Nughays"
    },
    {
      "authorId": "1676403572",
      "name": "H. Jawa"
    },
    {
      "authorId": "2038343801",
      "name": "K. Bashrahil"
    },
    {
      "authorId": "10360097",
      "name": "F. Alnemary"
    },
    {
      "authorId": "2057644038",
      "name": "H. Koenig"
    }
  ],
  "abstract": "Risk factors for attention deficit hyperactivity disorder (ADHD), psychiatric, and classroom academic/behavioral problems were examined in 929 students grades 1–6 in Jeddah, Saudi Arabia. Teachers identified ADHD by completing the Vanderbilt ADHD scale. Compared to controls without ADHD, students with ADHD were more likely to have early parental loss, head trauma, motor/language delay, family psychiatric problems, and high family stress. Among those with ADHD, risk factors for psychiatric comorbidity were older age, family psychiatric history, and motor/language delay. Risk factors for impaired academic/behavioral performance were high family stress, family psychiatric problems, and chronic illness. Identifying risk factors for ADHD and common comorbidities associated with this disorder may help parents, teachers and clinicians detect this condition, increasing effective management."
}