{
  "doi": "10.1186/s10194-016-0622-0",
  "slug": "10.1186-s10194-016-0622-0",
  "title": "The associations between psychosocial aspects and TMD-pain related aspects in children and adolescents",
  "abstract": "<strong>Background</strong>: Temporomandibular disorders (TMD) in children and adolescents is prevalent with pain as a common component, and has a comorbidity with psychosocial problems such as stress, depression, anxiety as well as somatic complaints. Therefore, the aim of the study was to investigate if psychosocial problems in children and adolescents are associated with TMD with pain (TMD-pain) and TMD without pain (TMD-painfree) when compared to children and adolescents without TMD. <strong>Methods</strong>: This cross-sectional study consisted of 456 randomly selected children and adolescents, enrolled from 10 boy's- and 10 girl's- schools in Jeddah, between 10 and 18 years of age. On the examination day, prior to the clinical examination according to Research Diagnostic Criteria for TMD Axis I and II, the participants first answered two validated questions about TMD pain, and after that the Arabic version of the Youth Self Report scale. According to their clinical examination and diagnosis the participants were divided into three groups; non-TMD group, TMD-pain group, and TMD-painfree group. <strong>Results</strong>: The TMD-pain group presents a higher frequency of the internalizing problems anxiety, depression and somatic complaints than non-TMD group (p < 0.05). Regarding externalizing problems the only significant association found was for aggressive behavior in the TMD-pain group (p < 0.05). The TMD-pain group also shows a higher frequency of social problems than the non-TMD group. However, no such difference was found when compared to the TMD-painfree group. There was also a significant association with a higher frequency of thought problems in the TMD-pain group (p < 0.05). The children's and adolescents' physical activities were within border line clinical range for all three groups, whereas the social competence was within the normal range. There were no significant associations between any of the groups in this respect. <strong>Conclusions</strong>: TMD-pain in children and adolescents does not seem to affect the social activities. However, TMD-pain seem to have a strong association to emotional, behavior and somatic functioning, with higher frequencies of anxiety, depression, somatic problems, aggressive behavior and thought problems, than children and adolescents without TMD-pain. With respect to the biopsychosocial model the present study indicates that there are significant associations to psychosocial, somatic and behavioral comorbidities and TMD-pain in children and adolescents in the Middle East region.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "dental",
    "jaw",
    "orofacial",
    "pain",
    "study"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "The Journal of Headache and Pain",
    "abbreviation": "The Journal of Headache and Pain",
    "volume": "17",
    "issue": "1",
    "pages": {
      "start": "30",
      "end": "40"
    }
  },
  "authors": [
    {
      "given": "Aron",
      "family": "Naimi-Akbar",
      "sequence": 1
    },
    {
      "given": "Nikolaos",
      "family": "Christidis",
      "sequence": 2
    },
    {
      "given": "Britt",
      "family": "Hedenberg-Magnusson",
      "sequence": 3
    },
    {
      "given": "Lanre",
      "family": "Bello",
      "sequence": 4
    },
    {
      "given": "Emad",
      "family": "Albadawi",
      "sequence": 5
    },
    {
      "given": "Mattias",
      "family": "Gjelset",
      "sequence": 6
    },
    {
      "given": "Amal",
      "family": "Al-Khotani",
      "sequence": 7
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.1186__s10194-016-0622-0.pdf",
    "sourceUrl": "https://thejournalofheadacheandpain.biomedcentral.com/track/pdf/10.1186/s10194-016-0622-0",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1186-s10194-016-0622-0"
}
