{
  "doi": "10.1007/s12402-014-0130-5",
  "slug": "10.1007-s12402-014-0130-5",
  "title": "Is high prevalence of vitamin D deficiency a correlate for attention deficit hyperactivity disorder?",
  "abstract": "The aim of the study was to determine the association between vitamin D and attention deficit hyperactivity disorder (ADHD), and difference in the level of vitamin D in ADHD children and control. This a case- control study carried out in school health and primary health care clinics. A total of 1,331 children and adoles- cents who were diagnosed with ADHD based on clinical criteria and standardized questionnaires were enrolled in this study and were matched with 1,331 controls, aged 5-18 years old. Data on body mass index (BMI), clinical biochemistry variables including serum 25-hydroxyvitamin D were collected. The study found significant association between ADHD and vitamin D deficiency after adjusting for BMI and sex (adj. OR 1.54; 95 % CI 1.32-1.81; P &#92; 0.001). Majority of the ADHD children were in the age group 5-10 years (40.7 %), followed by 11-13 years (38.4 %). The proportion of BMI &#92;85th percentile was significantly over represented in ADHD group as compared to healthy control (87.8 vs. 83 %; P &#92; 0.001, respectively), while on the other hand, BMI [95th percentile was over represented in the control than ADHD group (7.6 vs. 4.6 %; P &#92; 0.001, respectively). Mean values of vitamin D (ng/mL) were significantly lower in ADHD children (16.6 &plusmn; 7.8) than in healthy children (23.5 &plusmn; 9.0) (P &#92; 0.001). There was significant correlation between vitamin D deficiency and age (r = -0.191, P = 0.001); calcium (r = 0.272, P = 0.001); phosphorous (r = 0.284, P = 0.001); magnesium (r = 0.292, P = 0.001); and BMI (r = 0.498, P = 0.001) in ADHD children. The vitamin D deficiency was higher in ADHD children compared to healthy children.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "correlates",
    "diet",
    "etiology",
    "study",
    "vitamins"
  ],
  "publication": {
    "year": 2014
  },
  "journal": {
    "name": "Attention Deficit and Hyperactivity Disorders",
    "abbreviation": "Atten Defic Hyperac Disord",
    "volume": "6",
    "issue": "2",
    "pages": {
      "start": "73",
      "end": "78"
    }
  },
  "authors": [
    {
      "given": "Mohammad S",
      "family": "Ehlayel",
      "sequence": 1
    },
    {
      "given": "Abdulbari",
      "family": "Bener",
      "sequence": 2
    },
    {
      "given": "Madeeha",
      "family": "Kamal",
      "sequence": 3
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.1007__s12402-014-0130-5.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1007-s12402-014-0130-5",
  "language": "English"
}
