{
  "id": "doi-10.1080-21622965.2026.2613053",
  "slug": "10.1080-21622965.2026.2613053",
  "doi": "10.1080/21622965.2026.2613053",
  "identifiers": {
    "doi": "10.1080/21622965.2026.2613053"
  },
  "title": "Effects of executive function intervention based on motor activity on working memory and sustained attention of Saudi children with ADHD",
  "language": "English",
  "categories": [
    "Uncategorized"
  ],
  "access": {
    "status": "closed",
    "licenseUrl": null,
    "sourceUrl": null,
    "localPdfUrl": null,
    "researchGateUrl": null
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Malik M.",
      "family": "Alrefaei",
      "sequence": 1
    }
  ],
  "publication": {
    "year": 2026
  },
  "journal": {
    "name": "Applied Neuropsychology: Child",
    "issn": "2162-2965",
    "pages": {
      "start": "1",
      "end": "9"
    }
  },
  "abstract": "The present study aimed to investigate the effectiveness of executive function intervention based on motor activity on working memory and sustained attention of Saudi school aged- children with ADHD. It was hypothesized that the delivered executive function intervention based on motor activity would have a pre-to-post intervention effect on working memory and sustained attention. The current study employed a randomized controlled design to systematically assess the effects of executive function intervention based on motor activity on working memory and sustained attention of Saudi school aged- children with ADHD. In this study, executive function intervention based on motor activity training was considered as the independent variable and working memory and sustained attention were considered as the dependent variables. A total of 58 participants aged 7-10 years (mean= 9.3 and SD = 1.2) were included in the analyses. Children were from five schools in urban and suburban areas of Mecca. parents of children have junior high school education or above and have normal communication and cognitive abilities. Linear regression models were used to assess within-person differences within conditions for each outcome. Post-test scores were considered as dependent variables explained by condition and pretest scores as the independent variables. The results of the present study indicated significant improvements in working memory and sustained attention in children with attention deficit/hyperactivity disorder following 4 weeks of executive function training."
}
