{
  "doi": "10.1007/s00787-017-0983-1",
  "slug": "10.1007-s00787-017-0983-1",
  "title": "An international qualitative study of ability and disability in ADHD using the WHO_ICF framework",
  "abstract": "This is the third in a series of four cross-cultural empirical studies designed to develop International Classification of Functioning, Disability and Health (ICF, and Children and Youth version, ICF(-CY) Core Sets for Attention-Deficit Hyperactivity Disorder (ADHD). To explore the perspectives of individuals diagnosed with ADHD, self-advocates, immediate family members and professional caregivers on relevant areas of impairment and functional abilities typical for ADHD across the lifespan as operationalized by the ICF(-CY). A qualitative study using focus group discussions or semi-structured interviews of 76 participants, divided into 16 stakeholder groups. Participants from five countries (Brazil, India, Saudi Arabia, South Africa and Sweden) were included. A deductive qualitative content analysis was conducted to extract meaningful functioning and disability concepts from verbatim material. Extracted concepts were then linked to ICF(-CY) categories by independent researchers using a standardized linking procedure. In total, 82 ICF(-CY) categories were identified, of which 32 were related to activities and participation, 25 to environmental factors, 23 to body functions and 2 to body structures. Participants also provided opinions on experienced positive sides to ADHD. A high level of energy and drive, creativity, hyper-focus, agreeableness, empathy, and willingness to assist others were the most consistently reported strengths associated with ADHD. Stakeholder perspectives highlighted the need to appraise ADHD in a broader context, extending beyond diagnostic criteria into many areas of ability and disability as well as environmental facilitators and barriers. This qualitative study, along with three other studies (comprehensive scoping review, expert survey and clinical study), will provide the scientific basis to define ICF(-CY) Core Sets for ADHD, from which assessment tools can be derived for use in clinical and research setting, as well as in health care administration.",
  "categories": [
    "Uncategorized"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "European Journal of Child & Adolescent Psychiatry",
    "abbreviation": "Eur Child Adolesc Psychiatry",
    "volume": "3",
    "issue": "135",
    "pages": {
      "start": "994",
      "end": "1013"
    }
  },
  "authors": [
    {
      "given": "Melissa",
      "family": "Selb",
      "sequence": 1
    },
    {
      "given": "Marisa",
      "family": "Viljoen",
      "sequence": 2
    },
    {
      "given": "Soheil",
      "family": "Mahdi",
      "sequence": 3
    },
    {
      "given": "Sven",
      "family": "",
      "sequence": 4
    },
    {
      "given": "Sven",
      "family": "Rohde",
      "sequence": 5
    },
    {
      "given": "Luis",
      "family": "Rohde",
      "sequence": 6
    },
    {
      "given": "Petrus J",
      "family": "de Vries",
      "sequence": 7
    },
    {
      "given": "Sunil",
      "family": "Karande",
      "sequence": 8
    },
    {
      "given": "Omar",
      "family": "Almodayfer",
      "sequence": 9
    },
    {
      "given": "Rafael",
      "family": "Massuti",
      "sequence": 10
    }
  ],
  "access": {
    "status": "unknown"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1007-s00787-017-0983-1"
}
