{
  "doi": "10.17712/nsj.2015.2.20140678",
  "slug": "10.17712-nsj.2015.2.20140678",
  "title": "Systematic review of the epidemiology of attention deficit hyperactivity disorder in Arab countries",
  "abstract": "Objectives: To assess the epidemiology of attention deficit hyperactivity disorder (ADHD) in Arab countries, and identify gaps for future research. Methods: We searched PubMed from July 1978 to July 2014 and reviewed local journals with cross- referencing. The keywords we used were ADHD, diagnosis, prevalence, incidence, factor, diagnosis, rate, risk, and each of the names of the 22 Arab countries (Jordan, Egypt, Lebanon, Saudi Arabia, and so on). Studies were eligible for inclusion if they investigated the epidemiology of ADHD in any Arab country, and were published in English. The search was conducted from 2nd to 5th August 2014 in King Saud Bin Abdulaziz University for Health Sciences, Riyadh, Saudi Arabia. Results: A total of 22 articles were included in the review. Twenty studies were cross-sectional and found the prevalence of ADHD ranged between 1.3-16%, prevalence of hyperactive type ADHD between 1.4-7.8%, and the prevalence of inattention type between 2.1-2.7%. Only 2 case-control studies investigated potential risk factors. Evidence extracted from these studies shows a significant association between ADHD and male gender, previous psychiatric illness in the family, vitamin D deficiency, poor school performance, sleep problems, and nocturnal enuresis. Conclusions: The prevalence of ADHD in Arab countries is comparable to reports in North America, Africa, and other countries of the Middle East. Longitudinal studies are needed to investigate the prognosis and determinants of this condition in the Arab world.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "arab world",
    "epidemiology",
    "featured",
    "review",
    "riyadh",
    "study"
  ],
  "publication": {
    "year": 2015
  },
  "journal": {
    "name": "Neurosciences",
    "abbreviation": "Neurosciences",
    "volume": "20",
    "issue": "2",
    "pages": {
      "start": "137",
      "end": "144"
    }
  },
  "authors": [
    {
      "given": "Mowafa S",
      "family": "Househ",
      "sequence": 1
    },
    {
      "given": "Ashraf A",
      "family": "El-Metwally",
      "sequence": 2
    },
    {
      "given": "Ali M",
      "family": "Al-Shehri",
      "sequence": 3
    },
    {
      "given": "Anna",
      "family": "Ali",
      "sequence": 4
    },
    {
      "given": "Najla J",
      "family": "Alhraiwil",
      "sequence": 5
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.17712__nsj.2015.2.20140678.pdf",
    "sourceUrl": "https://nsj.org.sa/content/nsj/20/2/137.full.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.17712-nsj.2015.2.20140678",
  "language": "English"
}
