{
  "doi": "10.1111/edt.12065",
  "slug": "10.1111-edt.12065",
  "title": "Knowledge and attitude of Saudi teachers of students with attention-deficit hyperactivity disorder towards traumatic dental injuries",
  "abstract": "Background and Aim: Attention-deficit hyperactivity disorder (ADHD) is one of the most common childhood mental disorders that manifest with difficulties in staying focused and hyperactivity. Such children have been reported to have a higher incidence of traumatic dental injuries. The aim of this article was to study the knowledge and attitude of Saudi teachers of children with ADHD towards the management of traumatic dental injuries and compare them to their counterparts in mainstream schools. Material and Methods: A four-part structured Arabic questionnaire was administered to 281 teachers of children with ADHD and 384 teachers in mainstream schools. The questionnaire recorded the demographic data, type of children taught, experience of the teacher in dealing with traumatic dental injuries, the teachers&rsquo; perceived importance of managing traumatic dental injuries and their knowledge of emergency management of these injuries. The difference in knowledge and attitude between teachers of mainstream schools and schools for children with ADHD was assessed. Results and Conclusions: The results of the study indicate that teachers of children with ADHD have a greater experience of witnessing traumatic dental injuries and place significantly more importance towards the management of these injuries than their counterparts in mainstream schools. The influence of demographic variables on knowledge seen in teachers from mainstream schools is absent in those teaching children with ADHD.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "dental",
    "injuries",
    "knowledge",
    "riyadh",
    "trauma",
    "awareness"
  ],
  "publication": {
    "year": 2014
  },
  "journal": {
    "name": "Dental Traumatology",
    "abbreviation": "Dental Traumatology",
    "volume": "30",
    "issue": "1",
    "pages": {
      "start": "222",
      "end": "226"
    }
  },
  "authors": [
    {
      "given": "Hannan",
      "family": "Hillis",
      "sequence": 1
    },
    {
      "given": "Youmna",
      "family": "AlAttar",
      "sequence": 2
    },
    {
      "given": "Mona",
      "family": "Aboramadan",
      "sequence": 3
    },
    {
      "given": "Sharat Chandra",
      "family": "Pani",
      "authorship": "Primary Author",
      "sequence": 4
    },
    {
      "given": "Wedad",
      "family": "Al Enazi",
      "sequence": 5
    },
    {
      "given": "Tasneem",
      "family": "Chaballout",
      "sequence": 6
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.1111__edt.12065.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1111-edt.12065",
  "language": "English"
}
