{
  "doi": "10.1016/j.sbspro.2015.09.006",
  "slug": "10.1016-j.sbspro.2015.09.006",
  "title": "Combating anxiety and depression among school children and adolescents through student counselling in Saudi Arabia",
  "abstract": "Depression and anxiety are serious health problems that can affect a large number of children and adolescents. The literature has identified a high prevalence of depression, anxiety, and stress in Saudi school children and adolescent students. Student counselling practices are effective in helping students with a wide range of social and behavioural problems. The aim of the research study was to conduct an evidence-based review of the literature in order to provide new and innovative approaches to developing and improving student counselling skills, methods, and frameworks in order to directly combat anxiety and depression in Saudi schools. Non-empirical qualitative review of the literature on anxiety and depression and on student counselling in the United Kingdom and in Saudi Arabia. Main Argument: The research study argues that in theory student counsellors in Saudi schools can help to direct address and reduce the existing high prevalence of anxiety and depression in youths and adolescents attending Saudi schools. The research study concludes that student counselling in Saudi schools could potentially help in directly combating and reducing levels of anxiety and depression among Saudi school children and adolescents.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Turki",
      "family": "Alotaibi",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "sourceUrl": "https://doi.org/10.1016/j.sbspro.2015.09.006",
    "license": "cc-by-nc-nd"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1016-j.sbspro.2015.09.006",
  "publication": {
    "year": 2015
  },
  "journal": {
    "name": "Procedia - Social and Behavioral Sciences",
    "issn": "1877-0428",
    "volume": "205",
    "pages": {
      "start": "18",
      "end": "29"
    }
  },
  "identifiers": {
    "doi": "10.1016/j.sbspro.2015.09.006"
  }
}
