{
  "doi": "10.1007/s10615-024-00966-7",
  "slug": "10.1007-s10615-024-00966-7",
  "title": "Mothering Children with ADHD: The Influence of Courtesy Stigma and Psychological Distress on Family Life of Saudi Mothers",
  "abstract": "<p>An extensive body of research shows that mothers of children with Attention-Deficit/Hyperactivity Disorder (ADHD) endure a multitude of social and psychological difficulties, including discrimination, parenting stress, depression, and impaired family life, compared to mothers of neurotypical children. Research on Arab mothers of children with ADHD is limited, however. This study examined the influence of sociodemographic attributes, courtesy stigma, and psychological distress as predictors of family dynamics among 84 Saudi mothers. We used hierarchical multiple regression analysis to determine variance in family life scale accounted for by sociodemographic variables in Model (1) The same sociodemographic items with the addition of courtesy stigma and psychological distress were entered in Model (2) The first model (<i>F</i> (4, 84) = 2.50, <i>p</i> &lt;.05) accounted for 11% of the variance in the outcome variable, with educational level as the only significant predictor (β = − 0.28, <i>p</i> &lt;.001). In the second model (<i>F</i> (6, 84) = 10.25, <i>p</i> &lt;.001), courtesy stigma (β = 0.42, <i>p</i> &lt;.001) and psychological distress (β = 0.37, <i>p</i> &lt;.001) were the only two significant predictors (<i>F</i> = 8.67, <i>p</i> &lt;.001), accounting for 44% of the variance in the family life scores. Taken together, the results of this study suggest that higher levels of courtesy stigma and psychological distress are associated with greater strain in families of children with ADHD. The considerable difficulties that families with ADHD children undergo dictate enactment of family-centered interventions and a national comprehensive ADHD-stigma reduction program in Saudi Arabia that are attentive to maternal social and mental health.</p>",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "Mothers",
    "Courtesy stigma",
    "Family life",
    "Psychological distress",
    "Saudi Arabia"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2024-10-22T00:00:00+03:00",
    "year": 2024
  },
  "journal": {
    "name": "Clinical Social Work Journal",
    "abbreviation": "Clin Soc Work J",
    "issn": "0091-1674, 1573-3343"
  },
  "authors": [
    {
      "given": "Nasser",
      "family": "Aloud",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 1
    },
    {
      "given": "Abdallah",
      "family": "Badahdah",
      "orcid": "http://orcid.org/0000-0001-6230-7700",
      "sequence": 2
    }
  ],
  "access": {
    "status": "closed",
    "licenseUrl": "https://www.springernature.com/gp/researchers/text-and-data-mining",
    "sourceUrl": "http://dx.doi.org/10.1007/s10615-024-00966-7"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1007-s10615-024-00966-7"
}
