{
  "doi": "10.1016/j.ajp.2017.03.020",
  "slug": "10.1016-j.ajp.2017.03.020",
  "title": "A pilot study investigating the association between sleep and cognitive function among adolescents",
  "abstract": "<strong>Objectives</strong>: To investigate the relationship between sleep and cognitive function among adolescent subjects in Riyadh. <strong>Methods</strong>: The sample consisted of 98 (44% female) subjects aged 10-16 years. Each participant filled in a well-structured pre-coded questionnaire regarding demographic data, including a sleep questionnaire; cognitive function was assessed using the Cambridge Neuropsychological Automated Battery (CANTAB). The cognitive function outcome variables were response times in the attention-switching task (AST) and the percentage of correct answers in the pattern recognition memory (PRM) task. <strong>Results</strong>: There were significant differences in measures of AST-latency (p = 0.005), AST-congruent (p = 0.012), and AST-incongruent (p = 0.009), while no significant difference was found in the PRM task score (p = 0.336) within gender groups. There was a significant correlation between sleep and AST switching cost (0.277, p = 0.006) and sleep and AST latency (0.188, p = 0.063) across the group. <strong>Conclusion</strong>: This study showed that gender differences in cognitive function were significant in the group of adolescents. Additionally, this study shows that insufficient sleep can impair attention and accuracy in adolescents.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "adolescents",
    "attention",
    "cognitive function",
    "memory",
    "sleep"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "Asian Journal of Psychiatry",
    "abbreviation": "AJP",
    "volume": "28",
    "issue": "1",
    "pages": {
      "start": "34",
      "end": "37"
    },
    "issn": "1876-2018"
  },
  "authors": [
    {
      "given": "Shahid",
      "family": "Bashir",
      "sequence": 1
    },
    {
      "given": "Shafiq",
      "family": "Ahmad",
      "sequence": 2
    }
  ],
  "access": {
    "status": "closed"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1016-j.ajp.2017.03.020",
  "identifiers": {
    "doi": "10.1016/j.ajp.2017.03.020"
  }
}
