{
  "doi": "10.1080/21622965.2025.2495690",
  "slug": "10.1080-21622965.2025.2495690",
  "title": "Executive function as a mediator in the relationship between central auditory processing and problem behaviors in preschool children with ADHD",
  "abstract": "<p>This study intends to investigate the mediating role of executive function in the relationship between central auditory processing and problem behaviors (PBs) in preschool children with ADHD. This study proposes a mediation model to test whether executive function plays a mediating role between central auditory processing and children’s PBs. A total of 120 participants took part in the study. Structural equation modeling was used to test whether executive function plays a mediating role between central auditory processing and children’s PBs. The results of this study show that executive function has a significant mediating effect between central auditory processing and PBs, and the mediating effect accounts for 30% of the total effect. Therefore, central auditory processing can not only directly affect children’s PB but also affect PBs by affecting executive function.</p>",
  "categories": [
    "Uncategorized"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2025-04-28T00:00:00+03:00",
    "year": 2025
  },
  "journal": {
    "name": "Applied Neuropsychology: Child",
    "abbreviation": "Applied Neuropsychology: Child",
    "issn": "2162-2965, 2162-2973",
    "pages": {
      "start": "1",
      "end": "7"
    }
  },
  "authors": [
    {
      "given": "Loul Saleh",
      "family": "Al-Rasheed",
      "authorship": "Primary Author, Corresponding Author",
      "orcid": "https://orcid.org/0000-0003-0708-7420",
      "sequence": 1
    }
  ],
  "access": {
    "status": "closed",
    "sourceUrl": "https://doi.org/10.1080/21622965.2025.2495690"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1080-21622965.2025.2495690",
  "identifiers": {
    "doi": "10.1080/21622965.2025.2495690"
  },
  "language": "English"
}
