{
  "doi": "10.1007/s12144-018-0032-3",
  "slug": "10.1007-s12144-018-0032-3",
  "title": "Impulsivity among young adults: Differences between and within Western and Arabian populations in the BIS-11",
  "abstract": "Impulsivity (or impulsiveness) is a psychological trait with a long history in research and a large amount of accepted associations with other traits and with life outcomes. But it is rarely studied outside of the Western world, raising questions as to whether it can be generalized beyond this. In this study the Barratt Impulsiveness Scale 11 (BIS-11) was administered on two university student samples; one Egyptian (N = 450) and one Saudi (N = 396), in order to close this gap and to observe differences between sexes and cultures. We compared the Saudi samples with samples from typical Western countries (Germany, USA) by using Hofstede&quot;s cultural dimensions as a means of assessing cultural differences. We found no indicators of sex differences or cultural differences along the superficial division between countries from the Western and Arab-Muslim world. Also, more differentiated cultural dimensions were predominantly unrelated to BIS-11 factor scores. Implications for further research and limitations, such as the inclusion of more samples from Arab-Muslim countries and the use of samples more representative for the whole population, were discussed.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "arab world",
    "cross-cultural",
    "egypt",
    "gender differences",
    "impulsivity",
    "saudi arabia",
    "study"
  ],
  "publication": {
    "year": 2018
  },
  "journal": {
    "name": "Current Psychology",
    "abbreviation": "Current Psychology",
    "pages": {
      "start": "1",
      "end": "10"
    }
  },
  "authors": [
    {
      "given": "Khaled Elsayed",
      "family": "Ziada",
      "sequence": 1
    },
    {
      "given": "David",
      "family": "Becker",
      "sequence": 2
    },
    {
      "given": "Salaheldin Farah",
      "family": "Bakhiet",
      "sequence": 3
    },
    {
      "given": "Edward",
      "family": "Dutton",
      "sequence": 4
    },
    {
      "given": "Yossry Ahmed Sayed",
      "family": "Essa",
      "sequence": 5
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.1007__s12144-018-0032-3.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1007-s12144-018-0032-3"
}
