{
  "doi": "10.1080/21507686.2016.1260612",
  "slug": "10.1080-21507686.2016.1260612",
  "title": "How do parents view psychological assessment and intervention for their children with ADHD in Saudi Arabia?",
  "abstract": "The purpose of this study is to provide quantitative data on parental experiences with their children with attention-deficit hyperactivity disorder (ADHD) and to focus more on their opinion about medication and the role of psychological assessment and interventions. The study sample included 211 parents of children with ADHD. More than half of the parents think that ADHD could be treated without medication and that their child is too young to have psychotropic medication with its side effects. There were concerns about misdiagnosis and being too quick to prescribe medications. Psychometric assessment and psychological intervention were infrequently used and their experience with combined interventions is almost rare. Pressure from schools to prescribe medication was one of the parents concerns. Parental satisfaction with medication occurred when an improvement in school performance was noted. It is essential for health professionals to be aware of parents experiences and to develop a proper evidence-based intervention for ADHD which includes psychological counselling or combined interventions and not to rely on medication intervention alone.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "community psychology",
    "counselling",
    "featured",
    "psychiatry",
    "psychological intervention",
    "riyadh",
    "study",
    "treatment",
    "awareness"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "Asia Pacific Journal of Counselling and Psychotherapy",
    "abbreviation": "Asia Pacific Journal of Counselling and Psychotherapy",
    "volume": "8",
    "issue": "1",
    "pages": {
      "start": "41",
      "end": "52"
    }
  },
  "authors": [
    {
      "given": "Mohammed MJ",
      "family": "Alqahtani",
      "sequence": 1
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.1080__21507686.2016.1260612.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1080-21507686.2016.1260612"
}
