{
  "doi": "10.1177/1541204016639349",
  "slug": "10.1177-1541204016639349",
  "title": "Identifying Latent Classes of Antisocial Behavior Among Youth from Saudi Arabia: An Assessment of the Co-Occurrence Between Aggression, Psychopathy, Low Self-Control, and Delinquent Behavior",
  "abstract": "Despite the wealth of knowledge on subclass formation for antisocial behavior among youth from the United States and other Western industrialized countries, very little is known about the subclass structure for antisocial behavior among youth growing up in other geographical contexts. Using validated measures of aggression, psychopathy, and low self-control, we employ latent class analysis to identify latent subgroups of antisocial behavior from a sample of 324 Saudi Arabian youth. Three classes of antisocial behavior emerged and significant associations between latent class membership and different forms of delinquency were observed. The findings are the first to show a similar pattern of latent class formation for antisocial behavior and risk for violent and nonviolent delinquency among Saudi Arabian youth compared to U.S. youth.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "aggression",
    "antisocial",
    "behavior",
    "self-control",
    "study"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "Youth Violence and Juvenile Justice",
    "abbreviation": "YVJJ"
  },
  "authors": [
    {
      "given": "Eric J",
      "family": "Connolly",
      "sequence": 1
    },
    {
      "given": "Ahmed Nezar",
      "family": "Kobeisy",
      "sequence": 2
    },
    {
      "given": "Kevin M",
      "family": "Beaver",
      "sequence": 3
    },
    {
      "given": "Joseph A",
      "family": "Schwartz",
      "sequence": 4
    },
    {
      "given": "Fatiyah",
      "family": "Alquraishi",
      "sequence": 5
    },
    {
      "given": "Mohammed Said",
      "family": "Al-Ghamdi",
      "sequence": 6
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.1177__1541204016639349.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1177-1541204016639349"
}
