{
  "doi": "10.1111/jpm.13171",
  "slug": "10.1111-jpm.13171",
  "title": "The Role of Perceived Social Support in the Association Between Stress and Creativity Self‐Efficacy Among Adolescents With Attention Deficit Hyperactivity Disorder",
  "abstract": "ABSTRACT Introduction Adolescents with attention deficit hyperactivity disorder (ADHD) face significant challenges related to stress, inattention and impulsivity, which can impair their creativity self‐efficacy. Social support is a critical protective factor that mitigates stress and enhances resilience, yet its role in fostering creativity self‐efficacy among adolescents with ADHD remains underexplored. Aim To examine the levels of stress, perceived social support and creativity self‐efficacy among adolescents with ADHD and to explore the mediating role of social support in the relationship between stress and creativity self‐efficacy. Methods A cross‐sectional study was conducted with 305 adolescents diagnosed with ADHD from six preparatory schools. Validated tools, including the Adolescence Stress Scale, Creative Self‐Efficacy Scale and Multidimensional Scale of Perceived Social Support, were used to measure key variables. Data were analysed using Pearson correlation and mediation analysis. Results Stress was negatively correlated with CSE ( r = −0.791, p &lt; 0.001), while perceived social support positively correlated with creativity self‐efficacy ( r = 0.548, p &lt; 0.001). Social support significantly mediated the relationship between stress and creativity self‐efficacy, buffering the negative impact of stress on creativity ( B = −0.149, t = 7.987, p &lt; 0.001). Discussion The findings underscore the vital role of social support in alleviating stress and bolstering creativity self‐efficacy among adolescents with ADHD. Supportive relationships from family, peers, and mentors enhance confidence in creative abilities, creating a nurturing framework for resilience and innovation. Conclusion Perceived social support effectively mitigates the adverse effects of stress on creativity self‐efficacy, highlighting its importance in promoting adaptive outcomes for adolescents with ADHD. Implications for Practice Nursing interventions should prioritise strengthening social support systems for adolescents with ADHD. Educating families, schools and communities about the impact of social support can foster resilience, reduce stress and enhance creativity.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Mohamed Hussein Ramadan",
      "family": "Atta",
      "orcid": "https://orcid.org/0000-0002-5518-0892",
      "sequence": 1
    },
    {
      "given": "Shaimaa Mohamed",
      "family": "Amin",
      "sequence": 2
    },
    {
      "given": "Nagwa Ibrahim Mohamed",
      "family": "Hamad",
      "sequence": 3
    },
    {
      "given": "Ahmed Abdellah",
      "family": "Othman",
      "orcid": "https://orcid.org/0009-0009-6755-0625",
      "sequence": 4
    },
    {
      "given": "Yahia Mohamed",
      "family": "Sayed",
      "sequence": 5
    },
    {
      "given": "Hanan Salem",
      "family": "Sanad",
      "sequence": 6
    },
    {
      "given": "Ahmed Abdelwahab Ibrahim",
      "family": "El‐Sayed",
      "orcid": "https://orcid.org/0000-0001-9124-0808",
      "sequence": 7
    }
  ],
  "access": {
    "status": "closed"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1111-jpm.13171",
  "publication": {
    "year": 2025
  },
  "journal": {
    "name": "Journal of Psychiatric and Mental Health Nursing",
    "issn": "1351-0126"
  },
  "identifiers": {
    "doi": "10.1111/jpm.13171"
  },
  "language": "English"
}
