{
  "doi": "10.1080/21622965.2023.2208698",
  "slug": "10.1080-21622965.2023.2208698",
  "title": "Psychometric analysis of Childhood Executive Functioning Inventory (CHEXI) in Saudi Arabian ADHD children: Calibration with Rasch model",
  "abstract": "<div>The aim of the present study was to examine the psychometric analysis of the Childhood Executive Functioning Inventory (CHEXI) in Saudi Arabian ADHD children using the Rasch model. The study included 210 children from both sexes(males and females). All participants were from Saudi Arabia. Confirmatory factor analysis was performed to determine the dimensional structure of the scale. The Rasch Rating Scale Model (RSM) was used and implemented in the WINSTEPS v. 3.73 program. The results showed that the data, taken together, met the requirements of the RSM fit statistics. A good overall fit of persons and items to the model was found. Persons high rates of endorsement of definitely true on the CHEXI, as well as the most difficult items, are at the top of the map. No differences were found between the number of males and females in each of the three areas. The unidimensionality and local independence requirements were met. The levels of difficulty of the response categories are calibrated in ascending order as expected and in agreement with Andreich's scale model, and that all response categories are statistically appropriate according to the two scales of relevance, Infit and Outfit, where the statistics of the mean squares (Mnsq) for the fit of the categories did not exceed the limits of suitability. The thresholds for CHEXI are graded in difficulty and are almost equal in discrimination, and thus the assumption of the rating scale model is fulfilled.</div>",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD children",
    "calibration",
    "Childhood executive functioning inventory (CHEXI)",
    "Rasch model"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2023-05-04T00:00:00+03:00",
    "year": 2024
  },
  "journal": {
    "name": "Applied Neuropsychology: Child",
    "abbreviation": "Applied Neuropsychology: Child",
    "issn": "2162-2965, 2162-2973",
    "volume": "13",
    "issue": "4",
    "pages": {
      "start": "394",
      "end": "401"
    }
  },
  "authors": [
    {
      "given": "Ibrahim",
      "family": "Qassem Alyami",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 1
    }
  ],
  "access": {
    "status": "closed",
    "sourceUrl": "https://doi.org/10.1080/21622965.2023.2208698",
    "researchGateUrl": "https://www.researchgate.net/publication/370526031_Psychometric_analysis_of_Childhood_Executive_Functioning_Inventory_CHEXI_in_Saudi_Arabian_ADHD_children_Calibration_with_Rasch_model"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.1080-21622965.2023.2208698"
}
