{
  "doi": "10.26803/ijlter.19.12.16",
  "slug": "10.26803-ijlter.19.12.16",
  "title": "Efficacy of Teachers’ In‐Service Training for Increasing Their Knowledge of Attention Deficit Hyperactivity Disorder in Eastern Region, Saudi Arabia",
  "abstract": "The study aimed to assess the effectiveness of a training programme in increasing teachers’ knowledge of Attention Deficit Hyperactivity Disorder (ADHD) in the Eastern Region of Saudi Arabia. The sample comprised 124 teachers from schools in the said region, and these teachers were divided into two groups: (1) experimental group with 62 teachers and (2) control group with 62 teachers. The quasi-experimental approach was employed for collecting data; the Cognitive Awareness Scale of ADHD (Melhem, 2020) was also employed. It consists of 37 items distributed into three domains, namely, general knowledge, characteristics and diagnosis and treatment. Results revealed that the effectiveness of the training programme in increasing teachers’ ADHD knowledge was in favour of the experimental group. Moreover, no statistically significant differences were observed in the increase of the levels of ADHD knowledge amongst the teachers in the experimental group due to the variable of teaching experience. That is, the levels of ADHD knowledge of teachers from the experimental group are the same according to their teaching experience. In sum, the training programme significantly increased the levels of ADHD knowledge of teachers from the experimental group. Moreover, educational institutions in Saudi Arabia should include ADHD training programmes in teacher-training curricula in Saudi Arabia.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "ADHD",
    "in-service training",
    "teachers",
    "awareness"
  ],
  "publication": {
    "year": 2020
  },
  "journal": {
    "name": "International Journal of Learning, Teaching and Educational Research",
    "abbreviation": "IJLTER",
    "volume": "19",
    "issue": "12"
  },
  "authors": [
    {
      "given": "Tariq",
      "family": "Melhem",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "researchGateUrl": "https://www.researchgate.net/publication/349360165_Efficacy_of_Teachers%27_In-Service_Training_for_Increasing_Their_Knowledge_of_Attention_Deficit_Hyperactivity_Disorder_in_Eastern_Region_Saudi_Arabia"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.26803-ijlter.19.12.16"
}
