{
  "doi": "10.2478/sjcapp-2024-0008",
  "slug": "10.2478-sjcapp-2024-0008",
  "title": "Psychometric Properties of the Arabic Vanderbilt Children's ADHD Diagnostic Rating Scale (VADRS-A) in a Saudi Population Sample",
  "abstract": "Objective This study aimed to utilise Principal Component Analysis (PCA) and Confirmatory Factor Analysis (CFA) to investigate the constructive validity of the Arabic translation of the Vanderbilt Attention Deficit/Hyperactive Disorder (ADHD) Diagnostic Scale (VADRS-A) using its two versions, the Arabic Vanderbilt ADHD Diagnostic Parent Rating Scale (VADPRS-A) and the Arabic Vanderbilt ADHD Diagnostic Teacher Rating Scale (VADTRS-A). Method A descriptive research design was employed. Children were assessed by their parents and teachers, and a cluster sample of 1812 participants was chosen from many schools in Saudi Arabia, divided into two groups: parents (504) and teachers (1308) of children whose ages ranged between 5 to 12 years old. The VADPRS-A and VADTRS-A were administered to parents and teachers under the supervision of the Saudi ADHD Society. Results The results of the PCA of VADPRS-A found that the six factors saturate one general factor that explained (59%) of the total variance of the factor matrix with eigenvalues (3.540). Similarly, the PCA of VADTRS-A demonstrated that the five factors were saturated on a general factor that explained (69.20%) of the total variance of the factor matrix with eigenvalues (3.460). Also, the results indicate the high internal consistency of VADPRS-A and VADTRS-A, all factors correlated together and the total scores positively and significantly statistically (p>.001) correlation coefficients ranged between (0.296 to 0.843) for VADPRS-A, and ranges between (0.432 to 0.939) for VADTRS-A. Also, the Cronbach's α coefficient values for the six factors and total score of VADPRS-A were (.906, .925, .900, .896, .853, .872, .959) respectively, and these values are close to the values of the McDonald's ω for the factors and the total score were (.908, .923, .901, .871, .850, .877, .925) respectively. In the same way, Cronbach's α coefficients were (.967, .921, .914, .858, .948, .971) for all factors and the total score of VADTRS-A respectively, and these values are close to the values of the McDonald's ω (.968, .921, .919, .856, .943, .965) for all factors and the total score of VADTRS-A. In addition CFA for VADPRS-A and VADTRS-A models showed acceptable factor loading and good values of goodness-of-fit indices; CFI, TLI, RMSEA, IFI, and GFI (0.956, 0.942, 0.049, 0.956, 0.952) respectively for VADPRS-A model, and were (0.958, 0.932, 0.051, 0.963, 0.964) for VADTRS-A model, all of these were at an acceptable range. These results suggest a fit with the previous theoretical literature about VADPRS and VADTRS and DSM-5 and ICD-11 criteria of ADHD. Conclusion These findings highlighted the good psychometric properties of VADRS-A in both its versions VADPRS-A and VADTRS-A in the Saudi environment. Due to these findings, we suggest utilising VADPRS-A and VADTRS-A during ADHD diagnosis in children 5-12 years old in Saudi Arabia, to facilitate early diagnosis and intervention, and to help mitigate the risks of ADHD during subsequent developmental phases in children's lives.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "Children",
    "VADPRS",
    "VADTRS",
    "Parent",
    "Teacher",
    "Saudi Arabia",
    "Diagnosis"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2024-01-01",
    "year": 2024
  },
  "journal": {
    "name": "Scandinavian Journal of Child and Adolescent Psychiatry and Psychology",
    "issn": "2245-8875",
    "volume": "12",
    "issue": "1",
    "pages": {
      "start": "72",
      "end": "83"
    }
  },
  "authors": [
    {
      "given": "Mohammed M. J.",
      "family": "Alqahtani",
      "sequence": 1,
      "authorship": "Primary Author"
    },
    {
      "given": "Nouf Mohammed",
      "family": "Al Saud",
      "sequence": 2
    },
    {
      "given": "Nawal Mohammed",
      "family": "Alsharef",
      "sequence": 3
    },
    {
      "given": "Saleh Mohammed",
      "family": "Alsalhi",
      "sequence": 4
    },
    {
      "given": "Elham H.",
      "family": "Al-Hifthy",
      "sequence": 5
    },
    {
      "given": "Ahmad N.",
      "family": "AlHadi",
      "sequence": 6
    },
    {
      "given": "Yasser",
      "family": "Ad-Dab'bagh",
      "sequence": 7
    },
    {
      "given": "Fawwaz Abdulrazaq",
      "family": "Alenazi",
      "sequence": 8
    },
    {
      "given": "Barakat M.",
      "family": "Alotaibi",
      "sequence": 9
    },
    {
      "given": "Sultan Mahmoud",
      "family": "Alsaeed",
      "sequence": 10
    },
    {
      "given": "Boshra A.",
      "family": "Arnout",
      "sequence": 11
    },
    {
      "given": "Latifah",
      "family": "ALQasem",
      "sequence": 12
    },
    {
      "given": "Abdulkarim",
      "family": "Alhossein",
      "sequence": 13
    },
    {
      "given": "Yasser Jubran",
      "family": "Alqahtani",
      "sequence": 14
    },
    {
      "given": "Samirah A.",
      "family": "AlGhamdi",
      "sequence": 15
    },
    {
      "given": "Nader",
      "family": "Alrahili",
      "sequence": 16
    },
    {
      "given": "Jeremy",
      "family": "Varnham",
      "sequence": 17
    },
    {
      "given": "Saeed Abdulwahab",
      "family": "Asiri",
      "sequence": 18
    }
  ],
  "identifiers": {
    "doi": "10.2478/sjcapp-2024-0008",
    "url": "https://doi.org/10.2478/sjcapp-2024-0008"
  },
  "access": {
    "status": "open",
    "license": "CC BY-NC-ND 4.0",
    "licenseUrl": "http://creativecommons.org/licenses/by-nc-nd/4.0",
    "sourceUrl": "https://doi.org/10.2478/sjcapp-2024-0008",
    "localPdfUrl": "library/doi__10.2478__sjcapp-2024-0008.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.2478-sjcapp-2024-0008",
  "language": "English"
}
