{
  "doi": "10.21474/ijar01/3317",
  "slug": "10.21474-ijar01-3317",
  "title": "Awareness of Saudi Population in Madina Region About Attention Deficit Hyperactive Disorder (ADHD) in Children",
  "abstract": "Introduction: Attention Deficit Hyper-Active Disorder (ADHD) is one of the most common neurobehavioral developmental disorders among children. The prevalence of ADHD in all Arabic countries in general was ranging from 1.3% to 16% compared to 4-8% in US. While in Korea it was between 7.6% to 9.5%. However, the prevalence was reached 20 % in India. Methodology: A cross sectional study has been set in Saudi Arabia, Madina Region. The study population included both genders from 15 years and above, people living outside Madina and those whom are in the medical field have been excluded. Data were analyzed by the SPSS version 20. Results: 25.1 % knew the disease through their experience with an ADHD patient known to them. 14.7% read about ADHD through medical websites, 7,3% and 7.6% knew about it from newspapers and social media, respectively. 71.3%, believed that ADHD is a real disease, 22 % believe that it is a behavioral disorder, 16 % consider it as a neurological disease while 18 % considered it as a psychiatric disorder. On the other hand, 31 .8 % believe that ADHD is a mixed disorder and only 11 % did not know anything about the nature of the disease. , 32.2 % believe that it is a genetic disease, 23.1% blame nutritional habits, 19.3% believe that preservatives and dye contents of certain types of the food are the main cause, 4.9 % considered insecticides the main cause ,1.1% connected it to smoking and the rest believe that it is multi-cause disease.5.6% of respondents believe that medical management is the main modality of treatment, 27.1% think that behavioral therapy is main treatment option and 59.8% suggested both modalities and the rest considered it as not a treatable disease. Conclusion and Recommendations: Madina society is in a tremendous need to increase their awareness about ADHD in a simple layman language.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "Medina",
    "featured",
    "awareness"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "International Journal of Advanced Research",
    "abbreviation": "IJAR",
    "volume": "5",
    "issue": "2",
    "pages": {
      "start": "1571",
      "end": "1575"
    }
  },
  "authors": [
    {
      "given": "Tafani",
      "family": "Thani",
      "sequence": 1
    },
    {
      "given": "Abdul-Qader",
      "family": "Susi",
      "sequence": 2
    },
    {
      "given": "Abrar",
      "family": "Alharbi",
      "sequence": 3
    },
    {
      "given": "Khaled",
      "family": "Alghamdi",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 4
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.21474__ijar01__3317.pdf",
    "sourceUrl": "http://www.journalijar.com/uploads/225_IJAR-15604.pdf",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.21474-ijar01-3317",
  "language": "English"
}
