{
  "doi": "10.24911/ijmdc.51-1543855405",
  "slug": "10.24911-ijmdc.51-1543855405",
  "title": "Prevalence of adult attention deficit hyperactivity disorder among medical students in Riyadh City",
  "abstract": "<strong>Background:</strong> Attention deficit/hyperactivity disorder (ADHD) is a neurobehavioral disorder characterized by the inability to sustain attention, hyperactivity, and impulsivity. Recent studies showed that it can persist in adulthood. The modification of the &rsquo;Diagnostic and Statistical Manual of Mental Disorders in its fifth edition has a significant impact on detecting adult ADHD. To the best of our knowledge, there are no studies done on adult ADHD among medical students in the Gulf region. <strong>Methodology:</strong> A cross-sectional study was conducted on 487 medical students from all academic year from February 1, 2018, until March 31, 2018, in two governmental and one private medical school in Riyadh city. Self-reported English questionnaire paper used for the study was composed of two parts; socio-demographic and adult ADHD screening scale of DSM-5 version. <strong>Results:</strong> Fifty-three students (10.9%) reported symptoms of ADHD. Concerning the prevalence and percentage, there was no noticeable difference in gender (p value = 0.364), academic year (p value = 0.666), nationality (p value = 0.379), colleges (p value=0.836), and age (p value = 0.992). History of early life ADHD was significantly associated with adult ADHD (p value = 0.012), along with students grade point average, mainly from a score of three and above out of five (p value = 0.024). <strong>Conclusion:</strong> Our study found a higher prevalence of ADHD among medical students compared with worldwide prevalence. This difference could be due to social and cultural factors. Those individuals may have difficulty in communication and learning which can disturb academic efficiency, lengthen their study, and even disturb their development.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "ADHD",
    "Students",
    "adults",
    "featured",
    "medical students",
    "research",
    "riyadh",
    "prevalence",
    "study"
  ],
  "publication": {
    "year": 2019
  },
  "journal": {
    "name": "International Journal of Medicine in Developing Countries",
    "abbreviation": "IJMDC",
    "volume": "3",
    "issue": "2"
  },
  "authors": [
    {
      "given": "Nader",
      "family": "Alrahili",
      "sequence": 1
    },
    {
      "given": "Abdulrahman A",
      "family": "Aldakheel",
      "sequence": 2
    },
    {
      "given": "Abdullah",
      "family": "AlUbied",
      "sequence": 3
    },
    {
      "given": "Abdulaziz",
      "family": "Almalki",
      "sequence": 4
    },
    {
      "given": "Abdullah",
      "family": "AlBarrak",
      "sequence": 5
    },
    {
      "given": "Bandar",
      "family": "Al-Dosari",
      "sequence": 6
    },
    {
      "given": "Weam",
      "family": "AlHemaidi",
      "sequence": 7
    },
    {
      "given": "Abdullah S",
      "family": "Alamro",
      "sequence": 8
    },
    {
      "given": "Asem S",
      "family": "Alamro",
      "sequence": 9
    },
    {
      "given": "Asem A",
      "family": "Alageel",
      "sequence": 10
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.24911__ijmdc.51-1543855405.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.24911-ijmdc.51-1543855405"
}
