{
  "doi": "10.21474/ijar01/6394",
  "slug": "10.21474-ijar01-6394",
  "title": "Impact of Attention Deficit Hyperactivity Disorder (ADHD) on School Performance in Mecca, Saudi Arabia",
  "abstract": "Attention Deficit Hyperactivity Disorder (ADHD) is behavioral, developmental neurocognitive disorder presented as hyperactivity, impulsivity, and inattention (9). ADHD is a common mental disorder in children, becomes obvious in preschool and school years (9). 10 % of the US school- age children diagnosed as ADHD (7). It has affected about 5 % to 7 % among school-age children in our Arabian society. The aim of this study was to evaluate the impact of ADHD on school performance among children in Makkah Region. The targeted population consisted of 300, ages 7-18 years .A multistage sampling technique was used to select the sample. Data collected used Translating the International Classification of Functioning, Disability, and Health to Arabic version then re-translated into English and reviewed by a professor of psychiatry to ensure correct meaning of questions. The questionnaire it divided to 3 part according to the questions, and it filed by the student if he/she able to understand the questions or by the collectors data, the family and by the school administration. Written permission for the study it sought from school authorities and the parents of school boys.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "approaches",
    "family members",
    "teachers",
    "community",
    "school performance"
  ],
  "publication": {
    "year": 2018
  },
  "journal": {
    "name": "International Journal of Advanced Research",
    "abbreviation": "Int. J. of Adv. Res.",
    "volume": "6",
    "issue": "1",
    "pages": {
      "start": "1591",
      "end": "1598"
    }
  },
  "authors": [
    {
      "given": "Saeed",
      "family": "Balubaid",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 1
    },
    {
      "given": "Mohammed",
      "family": "Aljuaid",
      "sequence": 2
    },
    {
      "given": "Ahmed",
      "family": "Alghamdi",
      "sequence": 3
    },
    {
      "given": "Majdi",
      "family": "Alzahrani",
      "sequence": 4
    },
    {
      "given": "Asma",
      "family": "Aljuaid",
      "sequence": 5
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.21474__ijar01__6394.pdf",
    "sourceUrl": "https://doi.org/10.21474/ijar01/6394",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.21474-ijar01-6394"
}
