{
  "id": "doi-10.21608-maed.2025.428381",
  "slug": "10.21608-maed.2025.428381",
  "doi": "10.21608/maed.2025.428381",
  "identifiers": {
    "doi": "10.21608/maed.2025.428381"
  },
  "title": "The reality of applying parameters for interactive activities in kindergartens to relieve disorders in children with hyperactivity and attention deficit in early childhood",
  "language": "Arabic",
  "categories": [
    "Education"
  ],
  "access": {
    "status": "open",
    "licenseUrl": null,
    "sourceUrl": "https://doi.org/10.21608/maed.2025.428381",
    "localPdfUrl": "library/doi__10.21608__maed-2025-428381.pdf",
    "researchGateUrl": "https://www.researchgate.net/publication/391859176_waq_ttbyq_almlmat_llanshtt_altfalyt_balrwdat_ltkhfyf_aladtrabat_ldy_alatfal_dhwy_frt_alhrkt_wnqs_alantbah_bmrhlh_altfwlt_almbkrt"
  },
  "visibility": {
    "hidden": false
  },
  "abstract": "This study aimed to identify the degree of teachers' use of interactive activities in kindergartens to alleviate disorders in children with ADHD in early childhood, to reveal the obstacles that limit teachers' use of interactive activities in kindergartens to alleviate disorders in children with ADHD in early childhood, and to find the necessary ways to activate teachers' use of interactive activities in kindergartens to alleviate disorders in children with ADHD in early childhood. To achieve this, the study relied on the descriptive analytical approach, and used the questionnaire tool. The study community consisted of early childhood teachers in Riyadh, while the study sample was a simple random sample numbering (120). The results showed that early childhood teachers use interactive activities to a large extent in kindergartens to alleviate disorders in children with ADHD in early childhood. The results revealed that the study sample members agreed to a moderate degree on the obstacles that limit teachers' use of interactive activities in kindergartens to alleviate disorders in children with ADHD in early childhood. The most prominent paragraphs that came to a large degree were (the absence of a guide to help teachers employ interactive activities to alleviate disorders in children with ADHD in early childhood, the increased burdens placed on teachers limit their application of the necessary interactive activities to alleviate disorders in children with ADHD in early childhood). The results also showed that early childhood teachers largely agreed on the necessary ways to activate teachers' use of interactive activities in kindergartens to alleviate disorders in children with ADHD in early childhood. The most prominent of these ways were (activating cooperation and exchanging experiences between teachers, with regard to implementing the necessary interactive activities to alleviate disorders in children with ADHD in early childhood, reducing the number of children in classrooms to enable teachers to implement the necessary interactive activities to alleviate disorders in children with ADHD in early childhood).\n\nواقع تطبيق المعلمات للأنشطة التفاعلية بالروضات لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة\n\nهدفت هذه الدراسة إلى التعرف على درجة استخدام المعلمات للأنشطة التفاعلية بالروضات لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة، والكشف عن المعوقات التي تحد من استخدام المعلمات للأنشطة التفاعلية بالروضات لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة، والتوصل للسبل اللازمة لتفعيل استخدام المعلمات للأنشطة التفاعلية بالروضات لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة، ولتحقيق ذلك اعتمدت الدراسة على المنهج الوصفي التحليلي، كما استخدمت أداة الاستبانة، تكون مجتمع الدراسة من معلمات مرحلة الطفولة المبكرة بمدينة الرياض، أما عينة الدراسة فقد تمثلت في عينة عشوائية بسيطة بلغ عددها (120)، أظهرت النتائج أن معلمات الطفولة المبكرة يستخدمن الأنشطة التفاعلية بدرجة كبيرة في الروضات لتخفيف الاضطرابات لدى الأطفال ذوي فرط الحركة ونقص الانتباه بمرحلة الطفولة المبكرة، وكشفت النتائج أن أفراد عينة الدراسة موافقات بدرجة متوسطة على المعوقات التي تحد من استخدام المعلمات للأنشطة التفاعلية بالروضات لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة، وتمثلت ابرز الفقرات التي جاءت بدرجة كبيرة في (عدم وجود دليل إرشادي يُساعد المعلمات على توظيف الأنشطة التفاعلية لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة، زيادة الأعباء الملقاة على عاتق المعلمات يحد من تطبيقهن للأنشطة التفاعلية اللازمة لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة). كما أوضحت النتائج  أن معلمات الطفولة المبكرة موافقات بدرجة كبيرة على بالسبل اللازمة لتفعيل استخدام المعلمات للأنشطة التفاعلية بالروضات لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة، وتمثلت أبرز هذه السبل في (تفعيل التعاون وتبادل الخبرات بين المعلمات، فيما يتعلق بتطبيق الأنشطة التفاعلية اللازمة لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة، تخفيض اعداد الأطفال داخل الفصول الدراسية لتمكين المعلمات من تطبيق  الأنشطة التفاعلية اللازمة لتخفيف الاضطرابات لدى الاطفال ذوى فرط الحركة ونقص الانتباه بمرحله الطفولة المبكرة).",
  "authors": [
    {
      "given": "Rana Mohammed",
      "family": "Al-Faridi",
      "sequence": 1
    },
    {
      "given": "Sherif Ibrahim",
      "family": "Khamis",
      "sequence": 2
    }
  ],
  "publication": {
    "year": 2025
  },
  "journal": {
    "name": "Journal of the Faculty of Education in Mansoura",
    "issn": "2735-4466",
    "volume": "129",
    "issue": "1",
    "pages": {
      "start": "223",
      "end": "264"
    }
  }
}
