{
  "doi": "10.2190/pm.46.3.a",
  "slug": "10.2190-pm.46.3.a",
  "title": "Current State of Psychiatry in Saudi Arabia",
  "abstract": "<strong>Background</strong>: In 1983, an article and accompanying editorial was published on the state of psychiatry in the Kingdom of Saudi Arabia (KSA), which was described as &rsquo;a mental health system in statu nascendi.&#34; Methods: We provide a 30-year update on advances in mental health care in KSA. Data are reported from a wide range of sources, including the 2007 Saudi Arabian Mental and Social Health Atlas, which compares services in KSA with the rest of the world. <strong>Results</strong>: We examine how the current mental health system operates in KSA, including recent changes in mental healthcare policy and development of a national mental healthcare plan. Discussed are current needs based on the prevalence and recognition of mental disorders; availability of services and providers (psychiatrists, psychiatric nurses, psychologists, and social workers); education and training in psychiatry; developments in consultation-liaison, addictions, child-adolescent, and geriatric psychiatry; and progress in mental health research. <strong>Conclusions</strong>: Mental healthcare in Saudi Arabia has come a long way in a very short time, despite cultural, religious, social, and political challenges, although there still remain areas where improvement is needed. The development of psychiatry in KSA serves as a model for countries in the Middle East and around the world.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "featured",
    "jeddah",
    "psychiatry",
    "review",
    "saudi arabia",
    "study"
  ],
  "publication": {
    "year": 2013
  },
  "journal": {
    "name": "International Journal of Psychiatry in Medicine",
    "abbreviation": "Int&rsquo;l J. Psychiatry in Medicine",
    "volume": "46",
    "issue": "3",
    "pages": {
      "start": "223",
      "end": "242"
    }
  },
  "authors": [
    {
      "given": "Harold G",
      "family": "Koenig",
      "sequence": 1
    },
    {
      "given": "Faten",
      "family": "Al-Zaben",
      "sequence": 2
    },
    {
      "given": "Mohammad Gamal",
      "family": "Sehlo",
      "sequence": 3
    },
    {
      "given": "Doaa Ahmed",
      "family": "Khalifa",
      "sequence": 4
    },
    {
      "given": "Mahmoud Shaheen",
      "family": "Al-Ahwal",
      "sequence": 5
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.2190__pm.46.3.a.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.2190-pm.46.3.a",
  "language": "English"
}
