{
  "doi": "10.21608/sero.2017.91733",
  "slug": "10.21608-sero.2017.91733",
  "title": "Teaching Children with ADHD/ADD in Regular School: An Examination of Teachers' Professional Development Needs in Saudi Arabia",
  "abstract": "The purpose of the current study was to determine the level of training preparedness that teachers in KSA have in handling students with ADHD/ADD and explore the experiences of the teachers in regular schools as related to dealing with students that have the ADHD condition. Moreover, it determines the future proposals that would be useful in increasing the value of the education system in the KSA as far as the ADHD students are concerned. A sample of five female participants through an interview process, it was noted that the interviewees agreed with the findings of the literature review. There is much that needs to be done because there is very little help that is coming out to the students based on the level of the system lacking in the required level of threshold to proving the required pedagogical requirements. A collection of findings are figured out in this analysis of the results obtained from the data as related to the literature. Most of the teachers (80%) were discontented with the training system as related to dealing with students that have special conditions. The Saudi system will therefore need to focus on improving its training pedagogy that would take to account the idea of dealing with such conditions.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Nawdha",
      "family": "Alkahtani",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.21608__sero.2017.91733.pdf",
    "sourceUrl": "http://sero.journals.ekb.eg/article_91733_ed2ea0ef7e01f18c7a7873fc097b2227.pdf",
    "license": "cc-by-nc"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.21608-sero.2017.91733",
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "مجلة التربیة الخاصة والتأهیل",
    "issn": "2735-3141",
    "volume": "6",
    "issue": "4",
    "pages": {
      "start": "1",
      "end": "30"
    }
  },
  "identifiers": {
    "doi": "10.21608/sero.2017.91733"
  }
}
