{
  "doi": "10.21474/ijar01/11533",
  "slug": "10.21474-ijar01-11533",
  "title": "Elementary School Counselors' Level of Knowledge of Attention Deficit Hyperactivity Disorder: The Case of the North Border Region of Saudi Arabia",
  "abstract": "School counselors play a critical role in the identification and management of students with attention deficit hyperactivity disorder (ADHD). In order for the counselors to effectively help students with this condition, it is important that they have knowledge about this disorder. Therefore, the aim of this study was to assess the level of knowledge that elementary school counselors in the Northern Border of Saudi Arabia have with (ADHD). The Knowledge of Attention Deficit Disorder Scale (KADDS) was used to evaluate the counselors. The KADDS scale has three sub-scales that test general knowledge, diagnosis and symptoms, and treatment of ADHD. The study sampled 89 of approximate 200 school counselors working at elementary schools across the Region. The study data was analyzed using Statistical Packages for Social Sciences. The counselors got 31% of the questions in the general knowledge sub-scale correct while 43% were answered incorrectly, and 26% answered, “don’t know.” In the diagnosis/symptoms sub-scale 63% of the questions were answered correctly, 21% were answered incorrectly, while 16% answered “don’t know.” In the treatment sub-scale 38% of questions were answered correctly, 26% were answered incorrectly while 36% answered “don’t know.” Overall, 41% of the questions were answered correctly, 32% were answered incorrectly, while 27% answered “don’t know.” Based on these findings, the researcher concluded that the school counselors in the Northern Border Region of Saudi Arabia do not have sufficient knowledge of ADHD. This lack of knowledge invariably inhibits their ability to help children with ADHD.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "Attention Deficit Hyperactivity Disorder",
    "Counselors",
    "Awareness",
    "Knowledge"
  ],
  "publication": {
    "year": 2020
  },
  "journal": {
    "name": "International Journal of Advanced Research (IJAR)",
    "abbreviation": "Int J Adv Res",
    "volume": "8",
    "issue": "08",
    "pages": {
      "start": "618",
      "end": "624"
    },
    "issn": "2320-5407"
  },
  "authors": [
    {
      "given": "Nawaf Abbas",
      "family": "Alshammari",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "researchGateUrl": "https://www.researchgate.net/publication/344187612_ELEMENTARY_SCHOOL_COUNSELORS'_LEVEL_OF_KNOWLEDGE_OF_ATTENTION_DEFICIT_HYPERACTIVITY_DISORDER_THE_CASE_OF_THE_NORTH_BORDER_REGION_OF_SAUDI_ARABIA"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.21474-ijar01-11533",
  "identifiers": {
    "doi": "10.21474/ijar01/11533"
  }
}
