{
  "doi": "10.2147/ndt.s100405",
  "slug": "10.2147-ndt.s100405",
  "title": "Patterns of psychotropic medication use in inpatient and outpatient psychiatric settings in Saudi Arabia",
  "abstract": "<strong>Objective</strong>: To study the pattern of psychotropic medication use and compare this pattern between inpatient and outpatient psychiatric settings in Saudi Arabia. Method: This cross-sectional observational study was conducted between July 2012 and June 2014 on patients seeking psychiatric advice at major hospitals in five main regions of Saudi Arabia. Male (n=651) and female (n=594) patients who signed the informed consent form and were currently or had been previously using psychotropic medications, irrespective of the patients type of psychiatric diagnosis and duration of the disease, were included. A total of 1,246 patients were found to be suitable in the inclusion criteria of whom 464 were inpatients while 782 were outpatients. <strong>Results</strong>: Several studied demographic factors have shown that compared with outpatients, inpatients were more likely to be male (P=0.004), unmarried (P,0.001), have less number of children (1-3; P=0.002), unemployed (P=0.001), have a lower family income (,3,000 SR; P,0.001), live in rural communities (P,0.001), have a lower body mass index (P=0.001), and are smokers (P,0.001); however, there were no differences with regard to age or educational levels. The current frequency of use of psychotropic medications in overall patients was antipsychotics (76.6%), antidepressants (41.4%), mood stabilizers (27.9%), and anti-anxiety (6.2%). However, compared to outpatients, the current use of medications for inpatients was more frequent (93.8% vs 89.9%, P=0.019) with inpatients more likely to be treated with multiple medications (2.1 vs 1.8 medications). A similar trend was observed in the case of antipsychotics, high potency 1st-generation antipsychotics, second-generation antipsychotics, mood stabilizers, and anti-anxiety medicines where inpatients were more frequently treated with these medications for all psychiatric diagnoses when compared with outpatients. On the contrary, in the case of antidepressant treatment, an opposite trend was observed with more number of treated outpatients in comparison to inpatients. Among elderly patients, 75.9% received antipsychotics, mainly second-generation formulations (67.2%), whereas only 41% received antidepressants and 13.8% received mood stabilizers. <strong>Conclusion</strong>: Based upon the present study data, it is concluded that among all the psychotropic medications, antipsychotics were heavily used and the frequency was found to be significantly high in the case of inpatients compared with outpatients. Such a practice may lead to multiple negative consequences among the Saudi psychiatric patient population. Further, extensive use of sodium valproate in the case of bipolar disorder, and also among females either in childbearing age or during pregnancy is also the cause of concern and warrants logical use. Overall, this study may help in assessing the burden of psychiatric illness within specific patient demographics and might be effectively used to strategically plan health resources allocation, generate new treatment hypothesis, or be used as a source of evidence that could further integrate other observational studies.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "antidepressants",
    "antipsychotics",
    "anxiety",
    "depression",
    "inpatient",
    "mood stabilizers",
    "outpatient",
    "psychotropic"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "Neuropsychiatric Disease and Treatment",
    "abbreviation": "NDT",
    "volume": "12",
    "issue": "1",
    "pages": {
      "start": "897",
      "end": "907"
    }
  },
  "authors": [
    {
      "given": "Mohammed F",
      "family": "Abalhassan",
      "sequence": 1
    },
    {
      "given": "Bander Abdullah",
      "family": "Haddad",
      "sequence": 2
    },
    {
      "given": "Nasser M",
      "family": "Alzain",
      "sequence": 3
    },
    {
      "given": "Ebtihaj O",
      "family": "Fallata",
      "sequence": 4
    },
    {
      "given": "Abdulhadi",
      "family": "Alhabbad",
      "sequence": 5
    },
    {
      "given": "Fahad D",
      "family": "Alosaimi",
      "sequence": 6
    },
    {
      "given": "Mohammad Zayed",
      "family": "Alassiry",
      "sequence": 7
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.2147__ndt.s100405.pdf",
    "sourceUrl": "https://www.dovepress.com/getfile.php?fileID=29950",
    "license": "cc-by-nc"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.2147-ndt.s100405",
  "language": "English"
}
