{
  "doi": "10.32604/ijmhp.2022.021286",
  "slug": "10.32604-ijmhp.2022.021286",
  "title": "An Exploratory Investigation of Difficulties in Applying Functional Behavior Assessment and Implementing Behavioral Intervention Plans in ADHD Programs in Saudi Arabia",
  "abstract": "Functional behavior assessment (FBA) and behavioral intervention plans (BIPs) can be effective for students with attention deficit hyperactivity disorder (ADHD); however, teachers may face difficulties when implementing FBA procedures and, in turn, BIPs because of lack of time, insufficient training, and multiplicity of beliefs. Thus, it is important to identify the difficulties teachers may face and the obstacles that can deter them from implementing intervention plans. This is a worthwhile endeavor because nearly all classrooms will have students with behavioral problems who will benefit from specifically designed educational interventions. This study aimed to identify the difficulties in applying FBA and the barriers in implementing BIPs among Saudi teachers in specialized ADHD programs. Using the descriptive-analytical approach, a questionnaire targeting difficulties and barriers was admi- nistered to 209 public school teachers from specialized ADHD programs in Saudi Arabia. The results revealed that the difficulty level of applying FBA in ADHD programs was high. The level of barriers in implementing BIPs was moderate. Finally, the study indicated that barriers in implementing BIPs could be predicted by the difficulties of applying FBA. The results suggest the importance of finding better practices, restructuring the provision of ADHD programs, training teachers, improving assessment tool availability, and ensuring cooperation between school administrators and teachers.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "Functional behavior assessment (FBA)",
    "behavioral intervention plans (BIPs)",
    "attention deficit hyperactivity disorder (ADHD)",
    "Saudi Arabia"
  ],
  "publication": {
    "year": 2022
  },
  "journal": {
    "name": "International Journal of Mental Health Promotion",
    "abbreviation": "IJMHP",
    "volume": "24",
    "issue": "4",
    "pages": {
      "start": "595",
      "end": "601"
    },
    "issn": "1462-3730"
  },
  "authors": [
    {
      "given": "Abdulrahman Abdullah",
      "family": "Abaoud",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 1
    }
  ],
  "access": {
    "status": "open",
    "sourceUrl": "https://doi.org/10.32604/ijmhp.2022.021286",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.32604-ijmhp.2022.021286",
  "identifiers": {
    "doi": "10.32604/ijmhp.2022.021286"
  }
}
