{
  "doi": "10.3390/jcm14092874",
  "slug": "10.3390-jcm14092874",
  "title": "Diagnosis and Management of Attention-Deficit/Hyperactivity Disorder: A Practitioner’s Perspective",
  "abstract": "<p>Background/Objective: Attention-deficit/hyperactivity disorder (ADHD) is a common neurodevelopmental disorder in Saudi Arabia, yet challenges remain in diagnosis and treatment accessibility. This study examined healthcare practitioners’ clinical approaches to ADHD diagnosis and management in Saudi Arabia and identified gaps in practice. Methods: This cross-sectional study included healthcare practitioners working in various healthcare settings across Saudi Arabia. The sample included psychiatrists, pediatricians, psychologists, and other relevant specialists. Clinical practices regarding ADHD diagnosis, the use of ADHD screening tools, adherence to the Diagnostic and Statistical Manual of Mental Disorders (DSM-5) criteria, treatment strategies, medication prescription protocols, and reported challenges were investigated. Results: A total of 43 licensed healthcare practitioners with a minimum of 2 years of clinical experience managing ADHD participated. Among participants, 81.4% were psychiatrists, and 53.5% managed ADHD cases in children/adolescents exclusively. Approximately 86.0% of the sample used screening tools, with the Vanderbilt Assessment Scale being the most used (67.6%). However, only 55.8% addressed all 18 DSM-5 ADHD symptoms during the evaluation. Combined pharmacological and non-pharmacological treatment approaches (74.4%) were preferred. Interestingly, only 7.0% prescribed amphetamine-based stimulants due to the lack of clear guidelines. Key barriers included a lack of early screening programs (65.1%), limited ADHD medication option availability (51.2%), and extended referral waiting lists (44.2%). Conclusions: Significant variability in ADHD diagnosis and treatment practices was evident among healthcare providers in Saudi Arabia. Specifically, a large proportion of healthcare providers do not fully comply with the standard DSM-5 diagnosis criteria. Major barriers to ADHD diagnosis and treatment in Saudi Arabia include extended referral waiting lists, limited availability of psychostimulant medications, and standardized clinical guidelines. A national ADHD protocol must be advocated, and access to diverse treatment options should be improved.</p>",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "barriers",
    "assessment",
    "stimulants"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2025-04-22T00:00:00+03:00",
    "year": 2025
  },
  "journal": {
    "name": "Journal of Clinical Medicine",
    "abbreviation": "JCM",
    "issn": "2077-0383",
    "volume": "14",
    "issue": "9",
    "pages": {
      "start": "2874"
    }
  },
  "authors": [
    {
      "given": "Mansour M.",
      "family": "Alotaibi",
      "authorship": "Primary Author, Corresponding Author",
      "orcid": "https://orcid.org/0000-0003-2378-3186",
      "sequence": 1
    },
    {
      "given": "Naif Z.",
      "family": "Alrashdi",
      "orcid": "https://orcid.org/0000-0002-2263-1968",
      "sequence": 2
    },
    {
      "given": "Sultan A.",
      "family": "Alanazi",
      "orcid": "https://orcid.org/0000-0002-9442-5960",
      "sequence": 3
    },
    {
      "given": "Marzouq K.",
      "family": "Almutairi",
      "orcid": "https://orcid.org/0000-0003-3659-9548",
      "sequence": 4
    },
    {
      "given": "Bakriah Y.",
      "family": "Alzubaidi",
      "sequence": 5
    },
    {
      "given": "Maraheb M.",
      "family": "Alkhalidi",
      "orcid": "https://orcid.org/0000-0002-0881-2324",
      "sequence": 6
    },
    {
      "given": "Deemah",
      "family": "Alateeq",
      "orcid": "https://orcid.org/0000-0003-2852-5370",
      "sequence": 7
    },
    {
      "given": "Mohammed M.",
      "family": "Alqahtani",
      "sequence": 8
    }
  ],
  "access": {
    "status": "open",
    "licenseUrl": "https://creativecommons.org/licenses/by/4.0/",
    "sourceUrl": "https://doi.org/10.3390/jcm14092874",
    "localPdfUrl": "library/doi__10.3390__jcm14092874.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.3390-jcm14092874"
}
