{
  "doi": "10.36941/jesr-2021-0043",
  "slug": "10.36941-jesr-2021-0043",
  "title": "The Relationship between Sluggish Cognitive Tempo, Self-esteem, and Attention-deficit Hyperactivity Disorder among University Students",
  "abstract": "The present paper aims at determining the contribution of the Sluggish Cognitive Tempo (SCT) and self-esteem to predicting Attention-Deficit Hyperactivity Disorder (ADHD) among female university students in Saudi Arabia. It examines the differences in the research variables according to academic achievement. It also identifies the correlations of these variables. The authors applied the research instruments, i.e., the Adult ADHD Self-Report Scale (ASRS-v1.1), Adult Concentration Inventory (ACI), and Rosenberg’s Self-Esteem Scale (RSES) to a sample of 203 female university students aged 19-31 years (M = 23.29 years; SD= 3.74 years). The results showed no differences in the mean scores of ASRS, ACI, and negative self-esteem in the achievement levels among university students. In contrast, there was a positive direct relationship between ADHD, SCT, and negative self-esteem. SCT contributed significantly (by 40%), whereas self-esteem contributed by 6% in predicting ADHD among university students. The study highlighted the contribution of both negative self-esteem and SCT to predicting ADHD among Saudi university students to understand the nature of the disorder and its predictors. The findings of this study can be utilized to develop preventive programs for enhancing self-esteem and increasing attention among university students.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "Attention Deficit Hyperactivity Disorder (ADHD)",
    "Sluggish Cognitive Tempo (STC)",
    "Self-esteem",
    "Academic achievement"
  ],
  "publication": {
    "year": 2021
  },
  "journal": {
    "name": "Journal of Educational and Social Research",
    "abbreviation": "Journal of Educational and Social Research",
    "volume": "11",
    "issue": "2",
    "pages": {
      "start": "238"
    },
    "issn": "2240-0524"
  },
  "authors": [
    {
      "given": "Shaimaa Ezzat",
      "family": "Basha",
      "authorship": "Primary Author",
      "sequence": 1
    },
    {
      "given": "Futiem Nasha",
      "family": "Alsubie",
      "sequence": 2
    }
  ],
  "access": {
    "status": "open"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.36941-jesr-2021-0043",
  "identifiers": {
    "doi": "10.36941/jesr-2021-0043"
  }
}
