{
  "doi": "10.47104/ebnrojs3.v7i4.406",
  "slug": "10.47104-ebnrojs3.v7i4.406",
  "title": "Exploring Sleep Patterns of Children with ADHD: Mothers’ Perspectives in Saudi Arabia",
  "abstract": "<p>Context: ADHD, a neuro-developmental disorder, is characterized by core psychopathological features including inattention, hyperactivity, and impulsivity. Sleep disturbances are commonly observed among children with ADHD, resulting in heightened consequences such as compromised impulse control, difficulties in sustaining attention, and long-term impacts on academic performance, social interactions, and overall well-being. Aim: Explore the sleep patterns of children with ADHD from their mothers’ perspectives in Saudi Arabia. Methods: A quantitative, cross-sectional research methodology was employed in this study, with a sample comprising 103 mothers whose children have been affected by ADHD. Data for the study was obtained through the utilization of online structured questionnaires as the primary data collection tool. Results: The study reveals that more than half of the children, specifically 58%, fell within the 6-12-year-old age range, boys constituted the predominant group, accounting for 74% of the children. 18% of mothers reported their children usually had sleeping problems, 49% reported their children had sleeping problems. 87% of mothers do not know about ADHD disorder, also 44% of them do not know about sleep problems. In terms of maternal interventions, a significant proportion of participants, namely 89%, took proactive measures, such as reading stories (89%), maintaining consistent sleep schedules, and creating a serene environment, as reported by 74% of the participants. The study identified several challenges associated with sleep, with bedtime resistance being the most reported issue at 74%. Conclusion: A significant number of mothers reported that their children with ADHD often experience significant sleep disturbances. This finding is particularly evident in boys aged 6 to 12, who are more susceptible to both ADHD symptoms and related sleep issues. Addressing these sleep challenges is crucial for improving their overall well-being. Parents need to understand the relationship between sleep disturbances and ADHD to implement healthy sleep habits. Interventions such as reading bedtime stories, co-sleeping, and adjusting head positions can be beneficial.</p>",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "children",
    "mothers",
    "Saudi Arabia",
    "sleep pattern"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2025-10-01T00:00:00+03:00",
    "year": 2025
  },
  "journal": {
    "name": "Evidence-Based Nursing Research",
    "abbreviation": "EBNR",
    "issn": "2636-400X, 2636-3992",
    "volume": "7",
    "issue": "4",
    "pages": {
      "start": "12",
      "end": "19"
    }
  },
  "authors": [
    {
      "given": "Shahad",
      "family": "Albuqami",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 1
    },
    {
      "given": "Shahad",
      "family": "Asiri",
      "sequence": 2
    },
    {
      "given": "Lamia",
      "family": "Alsulami",
      "sequence": 3
    },
    {
      "given": "Amal",
      "family": "Sijeeni",
      "sequence": 4
    }
  ],
  "access": {
    "status": "open",
    "licenseUrl": "https://creativecommons.org/licenses/by-sa/4.0",
    "sourceUrl": "https://doi.org/10.47104/ebnrojs3.v7i4.406",
    "localPdfUrl": "library/doi__10.47104__ebnrojs3.v7i4.406.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.47104-ebnrojs3.v7i4.406"
}
