{
  "doi": "10.4103/jfmpc.jfmpc_354_24",
  "slug": "10.4103-jfmpc.jfmpc35424",
  "title": "Evaluation of ADHD knowledge and awareness among healthcare college interns in Riyadh, Saudi Arabia",
  "abstract": "<p>ABSTRACT Background: Attention deficit hyperactivity disorder (ADHD), a neuropsychiatric disorder, is common in children and can persist into adulthood. With or without hyperactivity, it involves chronic impulsivity and inattention. Despite being a widespread illness, there is little research on ADHD knowledge and awareness among health college interns in Riyadh, KSA. Therefore, this study examined health college interns’ knowledge and awareness in Riyadh, Saudi Arabia’s capital. Methods: A cross-sectional study using a self-administered validated survey was used to gather demographics as well as knowledge and awareness scores in King Saud University, King Saud Bin Abdulaziz University for Health Sciences (KSAU-HS), Imam Mohammed ibn Saud, and Princess Nourah Bint Abdulrahman, and one private Almaarefa University. Results: This study included 322 health college interns aged 18–24; 55% were males. The Saudi Professional Practice Licensure Exams (SPPLE) were passed by 65.5% of participants from King Saud University and KSAU-HS, Riyadh’s leading medical and pharmaceutical universities. They are evenly split throughout the four GPA categories. The interns knowledgeable and aware of ADHD (scored ≥ 13 on a 20-scale score) constituted 68% of the interns. Interns who passed Saudi Professional Practice Licensure Exams graduated from pharmacy and medicine schools, and had ≥4.5 or more GPAs were more knowledgeable than other interns. Conclusion: As per our research, most health college interns in Riyadh were aware of ADHD; however, medical and pharmacy interns were more knowledgeable than others. This suggests that other health colleges should revamp their ADHD and neurological illness topics curricula.</p>",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "ADHD",
    "health Colleges",
    "interns",
    "knowledge",
    "Saudi Arabia"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2024-11-18T00:00:00+03:00",
    "year": 2024
  },
  "journal": {
    "name": "Journal of Family Medicine and Primary Care",
    "abbreviation": "Journal of Family Medicine and Primary Care",
    "issn": "2249-4863, 2278-7135",
    "volume": "13",
    "issue": "11",
    "pages": {
      "start": "5121",
      "end": "5126"
    }
  },
  "authors": [
    {
      "given": "Nmshan",
      "family": "Alnmshan",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 1
    },
    {
      "given": "Osama",
      "family": "Jameel",
      "sequence": 2
    },
    {
      "given": "Abdullah",
      "family": "Alsahli",
      "sequence": 3
    },
    {
      "given": "Ibrahim",
      "family": "Alokail",
      "sequence": 4
    },
    {
      "given": "Mamdouh",
      "family": "Alotaibi",
      "sequence": 5
    },
    {
      "given": "Wael",
      "family": "Mansy",
      "sequence": 6
    }
  ],
  "access": {
    "status": "open",
    "licenseUrl": "https://creativecommons.org/licenses/by-nc-sa/4.0/deed.en",
    "sourceUrl": "http://dx.doi.org/10.4103/jfmpc.jfmpc_354_24"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4103-jfmpc.jfmpc_354_24",
  "identifiers": {
    "doi": "10.4103/jfmpc.jfmpc_354_24"
  }
}
