{
  "doi": "10.4103/jin.jin_90_24",
  "slug": "10.4103-jin.jin9024",
  "title": "Impact of educational interventions on mothers’ awareness and communication with their attention–deficit hyperactivity disorder children",
  "abstract": "<p>ABSTRACT Objective: The objectives of this study are to evaluate the effects of the educational intervention on mothers’ knowledge, awareness, and communication difficulties experienced with their children and mothers’ capacity to successfully interact with their affected child before and after the intervention. Materials and Methods: A quasi-experimental research design was used. A total of 30 mothers and their children complaining of attention-deficit hyperactivity disorder from four Dawadmi primary schools were included. Data were collected through a self-developed questionnaire from September 2023 to January 2024 after study acceptance by Shaqra University’s scientific deanship. Intervention prepared according to subjects’ needs and current scientific base and demonstrated in 10 sessions in schools. Results: Regarding mothers’ age, more than one-fourth of them (26.7%) ranged from 31 to 35 year old, and about a third (36.7%) had secondary education. Regarding mother’s job, about 76.7% do not work, and the majority of affected children (66.6%) were male, there were significant improvements in mothers’ knowledge pre- and postintervention also a significant improvement in mothers’ awareness about symptoms of poor attention, hyperactivity, and impulsivity pre- and postintervention was found. Significant differences were found before and after the intervention regarding the impact of the intervention in decreasing mothers’ challenges. Conclusion: The study hypothesis was accepted, and the intervention improved mothers; knowledge, awareness, and communication challenges. The intervention should be conducted and followed up for a long period of time to manage all mother’s and children’s daily challenges, improve children’s daily activities, and stabilize effective communication patterns between children and their family members.</p>",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "Attention-deficit hyperactivity disorder",
    "awareness",
    "communication",
    "educational interventions"
  ],
  "publication": {
    "type": "Journal Article",
    "publishedDate": "2024-12-04T00:00:00+03:00",
    "year": 2024
  },
  "journal": {
    "name": "Journal of Integrative Nursing",
    "abbreviation": "Journal of Integrative Nursing",
    "issn": "2666-9854, 2663-4481",
    "volume": "6",
    "issue": "4",
    "pages": {
      "start": "187",
      "end": "195"
    }
  },
  "authors": [
    {
      "given": "Wafaa Hassan Hassnan",
      "family": "Alseraty",
      "authorship": "Primary Author, Corresponding Author",
      "sequence": 1
    },
    {
      "given": "Sahar Mohamed",
      "family": "Abdullhameed",
      "sequence": 2
    },
    {
      "given": "Atallah",
      "family": "Alenezi",
      "sequence": 3
    }
  ],
  "access": {
    "status": "open",
    "licenseUrl": "http://creativecommons.org/licenses/by-nc-sa/4.0",
    "sourceUrl": "https://doi.org/10.4103/jin.jin_90_24",
    "localPdfUrl": "library/doi__10.4103__jin.jin_90_24.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4103-jin.jin_90_24"
}
