{
  "doi": "10.4103/jfcm.jfcm_19_18",
  "slug": "10.4103-jfcm.jfcm1918",
  "title": "Consistency of child self-reports with parent proxy reports on the quality of life of children with attention_deficit/ hyperactivity disorder in Riyadh, 2016",
  "abstract": "<strong>Background:</strong> The quality of life (QoL) of children with attention_deficit/hyperactivity disorder (ADHD) has not been addressed in Saudi Arabia despite the considerable attention it has on account of its prevalence, duration of illness, and sociopsychological effects. The aim of this study was to report on the QoL of children with ADHD and test the concord between children&quot;s and parents&quot; reports. <strong>Materials and Methods:</strong> Using the generic PedsQLTM (version 4.0) from both children&quot;s and parents&quot; perspectives, a cross_sectional study of 112 children was conducted on children aged 5-18 years with an established diagnosis of ADHD attending child psychiatry clinics of three referral hospitals in Riyadh between December 2015 and May 2016. <strong>Results:</strong> A total of 112 children with an established diagnosis of ADHD were recruited from the Child Psychiatry Clinic of Al Amal Mental Health Complex (41.1%), Prince Sultan Military Medical City (PSMMC), (33%), and King Khalid University Hospital (KKUH), (25.9%). The majority were boys (74.1%) and Saudi nationals (93.8%). The mean age of children with ADHD was 10.45 &plusmn; 3.06 years (Range 5 _ 18 years). One_fourth of the mothers of children with ADHD had completed high school and 41.1% had a diploma, university, or postgraduate degree. One_third of the fathers of these children had completed high school (34%) and 38.4% had a diploma, university, or postgraduate degree. The intra_class correlation coefficients between the scores of children and parents were good for physical functioning, fair for social functioning, but moderate for school, emotional, and psychosocial functioning. Children rated themselves significantly better than their parents for emotional, social, school, and psychosocial functioning. The standardized response means indicated a small difference for social functioning and medium differences for the other three domains. The only significant discrepancy was observed in social functioning in relation to the child&quot;s age. <strong>Conclusion:</strong> Parents mirrored adequately the observable physical component of the QoL of their children. The QoL report of children with ADHD with respect to communications and intellectual abilities should be taken into account whenever possible and their parents&quot; report also should be sought to provide a more comprehensive view of the child&quot;s status.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "QoL",
    "children",
    "parents",
    "research",
    "study"
  ],
  "publication": {
    "year": 2019
  },
  "journal": {
    "name": "Journal of Family and Community Medicine",
    "abbreviation": "J Fam Community Med",
    "volume": "26",
    "issue": "1",
    "pages": {
      "start": "9",
      "end": "16"
    },
    "issn": "2230-8229"
  },
  "authors": [
    {
      "given": "Dina M",
      "family": "Al-Habib",
      "sequence": 1
    },
    {
      "given": "Fatima A",
      "family": "Alhaidar",
      "sequence": 2
    },
    {
      "given": "Ibrahim M",
      "family": "Alzayed",
      "sequence": 3
    },
    {
      "given": "Randa M",
      "family": "Youssef",
      "sequence": 4
    }
  ],
  "access": {
    "status": "open",
    "sourceUrl": "https://doi.org/10.4103/jfcm.jfcm_19_18",
    "license": "cc-by-nc-sa"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4103-jfcm.jfcm_19_18",
  "identifiers": {
    "doi": "10.4103/jfcm.jfcm_19_18"
  }
}
