{
  "doi": "10.4103/jnsbm.jnsbm_232_17",
  "slug": "10.4103-jnsbm.jnsbm23217",
  "title": "Knowledge and Attitude of Male Primary School Teachers about Attention Deficit and Hyperactivity Disorder in Riyadh, Saudi Arabia",
  "abstract": "<strong>Objective:</strong> We assessed the level and source of knowledge and attitude of male primary school teachers about attention_deficit and hyperactivity disorder (ADHD). <strong>Methods:</strong> A cross_sectional study was conducted from January to November 2016 involving Saudi male teachers currently working at 17 primary schools in Khashm_Alaan district, Saudi Arabia. A prevalidated, self_administered, structured questionnaire was used for data collection. Teachers mean knowledge score was measured in the following three categories: insufficient, good, and very good. <strong>Results:</strong> Only 141 out of 182 teachers completed the questionnaire. Mean age of participants was 36.16 ± 6.6 years with teaching experience of 12 ± 6.2 years. Bachelors degree was the highest qualification reported by 86% of participants. Seventy_two percent of the teachers had either very good (13%) or good (59%) knowledge about ADHD. Almost half of them reported multiple sources such as internet, social media, and television for obtaining information about ADHD. However, internet and social media alone were reported as a source of information by 13% and 11.4%, respectively. Those who attended any course on ADHD had significantly (P = 0.006) more knowledge about the disorder. Furthermore, those teachers having taught a child with ADHD had more knowledge about the disorder. A significant correlation between mean knowledge and attitude scores was observed. <strong>Conclusion:</strong> Two_third of the teachers had knowledge about ADHD. Those who had either attended a course or taught a child with the ADHD had significantly more knowledge about the disorder. Most of the teachers learned about the disorder from multiple sources.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "awareness",
    "boys school",
    "featured",
    "knowledge",
    "primary school",
    "teachers",
    "awareness"
  ],
  "publication": {
    "year": 2018
  },
  "journal": {
    "name": "Journal of Natural Science, Biology and Medicine",
    "abbreviation": "J Nat Sc Biol Med",
    "issue": "9",
    "pages": {
      "start": "257",
      "end": "262"
    }
  },
  "authors": [
    {
      "given": "Hamzah Hassan",
      "family": "Alfageer",
      "sequence": 1
    },
    {
      "given": "Mohamed Dhafer",
      "family": "Aldawodi",
      "sequence": 2
    },
    {
      "given": "Sulaiman A",
      "family": "Al Queflie",
      "sequence": 3
    },
    {
      "given": "Nazish",
      "family": "Masud",
      "sequence": 4
    },
    {
      "given": "Nesrin A",
      "family": "Al Harthy",
      "sequence": 5
    },
    {
      "given": "Nawaf",
      "family": "Alogayyel",
      "sequence": 6
    },
    {
      "given": "Mohammed",
      "family": "Alrabah",
      "sequence": 7
    },
    {
      "given": "Shoeb",
      "family": "Qureshi",
      "sequence": 8
    },
    {
      "given": "",
      "family": "Qureshi",
      "sequence": 9
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.4103__jnsbm.jnsbm_232_17.pdf",
    "sourceUrl": "https://doi.org/10.4103/jnsbm.jnsbm_232_17"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4103-jnsbm.jnsbm_232_17",
  "language": "English"
}
