{
  "doi": "10.4103/jmsr.jmsr_39_18",
  "slug": "10.4103-jmsr.jmsr3918",
  "title": "The Association between Attention Deficit Hyperactivity Disorder and Legg-Calvé-Perthes Disease in Tertiary Hospital‐Riyadh City, Saudi Arabia",
  "abstract": "<strong>Objectives:</strong> Legg-Calvé-Perthes Disease (LCPD) is a juvenile hip disorder in which interruption to the blood supply of the femoral head causes osteonecrosis. Previous studies reported an association between attention deficit hyperactivity disorder (ADHD) and LCPD. This study aimed to assess the relationship between ADHD and LCPD disease in a tertiary hospital in Riyadh city, Saudi Arabia. <strong>Methods:</strong> This is a case-control study that included 50 case subjects (LCPD group) and 100 controls. Both groups underwent clinical assessment by the 5th edition of the Diagnostic and Statistical Manual of Mental Disorders criteria to diagnose ADHD and to compare the proportions in both groups. <strong>Results:</strong> The age range of the study population was 4-19 years. In the case group, we collected the data from 11 females and 39 males. The age ranged from 4 to 19 years (mean 9 years). While in the control group, we collected the data from 47 females and 53 males. The age range was 4-15 years (mean 8 years). In both groups, 34 children (22.7%) were diagnosed with ADHD, 15 (30%) in the case group and 19 (19%) in the control group. There was no significant difference in ADHD incidence between the case group and the control group (P = 0.1293, odds ratio = 1.827). LCPD has a significant male predominance (78%). <strong>Conclusions:</strong> We found that the prevalence of ADHD in LCPD is high (30%), which is comparable to the reported literature but as ADHD was higher than the reported literature in the control group (19%) the difference was statistically insignificant.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "femoral head",
    "osteonecrosis"
  ],
  "publication": {
    "year": 2018
  },
  "journal": {
    "name": "Journal of Musculoskeletal Surgery and Research",
    "abbreviation": "J Musculoskelet Surg Res",
    "issue": "2",
    "pages": {
      "start": "156",
      "end": "160"
    },
    "issn": "2589-1219",
    "volume": "2"
  },
  "authors": [
    {
      "given": "Mazen A",
      "family": "Al_Hunaishel",
      "sequence": 1
    },
    {
      "given": "Mohammad A",
      "family": "Almalki",
      "sequence": 2
    },
    {
      "given": "Sultan S",
      "family": "Almaiman",
      "sequence": 3
    },
    {
      "given": "Turki A",
      "family": "Alqahtani",
      "sequence": 4
    },
    {
      "given": "Ziad S",
      "family": "Alsaadi",
      "sequence": 5
    },
    {
      "given": "Batal S",
      "family": "Aldosari",
      "sequence": 6
    },
    {
      "given": "Shaker H",
      "family": "Al-Shehri",
      "sequence": 7
    }
  ],
  "access": {
    "status": "closed"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4103-jmsr.jmsr_39_18",
  "identifiers": {
    "doi": "10.4103/jmsr.jmsr_39_18"
  },
  "language": "English"
}
