{
  "doi": "10.4103/sjmms.sjmms_528_22",
  "slug": "10.4103-sjmms.sjmms52822",
  "title": "Prevalence and Risk Factors of Attention Deficit-Hyperactivity Disorder in the Saudi Population: A Systematic Review and Meta-analysis",
  "abstract": "<strong>Objectives:</strong> To determine the prevalence and risk factors of attention deficit hyperactivity disorder (ADHD) in Saudi Arabia. <strong>Methods: </strong>Observational studies (case–control, cohort, and cross-sectional) that reported the prevalence and risk factors of ADHD among Saudis and were published in English were included. In March 2022, a computerized search was conducted on Medline (via PubMed), Web of Science, and Scopus using keywords associated with ADHD and Saudi Arabia. Two-stage screening and data extraction were performed. The National Institutes of Health Quality Assessment Tool for Observational Cohort and Cross-sectional studies was used for the quality assessment. A random-effects model was used to estimate the prevalence. The Comprehensive Meta-analysis program was used for the analysis. <strong>Results: </strong>Fourteen studies (N = 455,334 patients) were included. The pooled prevalence of ADHD in the Saudi population was 12.4% (95% CI: 5.4%–26%). For ADHD-Inattentive and ADHD-Hyperactive presentations, the prevalence was 2.9% (95% CI: 0.3%–23.3%) and 2.5% (95% CI: 0.2%–20.5%), respectively. Regarding the combined AD and HD, the prevalence was 2.5% (95% CI: 0.2%–20.5%). Children of women with psychological disorders during pregnancy (P = 0.043), insufficient vitamin B during pregnancy (P = 0.006), allergic reactions (P = 0.032), and disabling symptoms of muscle pain during pregnancy (P = 0.045) were associated with an increased risk of ADHD. <strong>Conclusions: </strong>The prevalence of ADHD in the Saudi population is comparable with that in other countries from the Middle East and North Africa region. Careful monitoring of pregnant women, attention to nutritional sufficiency, psychological and emotional support, and avoidance of stressful events may lead to reducing the incidence of ADHD in the offspring.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [],
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/doi__10.4103__sjmms.sjmms_528_22.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4103-sjmms.sjmms_528_22"
}
