{
  "doi": "10.4103/jfmpc.jfmpc_183_18",
  "slug": "10.4103-jfmpc.jfmpc18318",
  "title": "Elementary school teachers’ knowledge of attention deficit/hyperactivity disorder",
  "abstract": "<strong>Background:</strong> Teachers are often the first ones to suspect attention deficit/hyperactivity disorder (ADHD) in their students, because they are with them for most of the day and they know how normal students typically behave in classroom situations. The aim of this study is to assess the teachers level of knowledge of ADHD and identify some factors affecting that knowledge. <strong>Methods:</strong> It is a cross-sectional study conducted among male and female elementary governmental schools in Madina city during the year 2017/1438. A pre-validated and translated self-administered questionnaire is used in data collection. It includes demographical questionnaire and the Knowledge of Attention Deficit Disorder Scale. <strong>Results:</strong> The study included 416 teachers. Their age ranged between 22 and 66 years. The average percentage of knowledge regarding ADHD general information, symptoms/diagnosis, and treatment were 41.6 &plusmn; 15.1, 41.7 &plusmn; 15, and 30.7 &plusmn; 16.6, respectively. The average percentage of overall knowledge score regarding ADHD was 38 &plusmn; 11.3. Only experience in teaching (P = 0.042) and previous experience with a child with ADHD (P < 0.001) were significantly associated with teachers knowledge regarding ADHD general information. Special need teachers had the highest score of knowledge regarding ADHD symptoms (mean rank was 283.7), P = 0.013, and they had the highest score of knowledge regarding ADHD treatment (mean rank was 261.9), P = 0.032. Teachers who reported previous experience with a child with ADHD expressed higher level of overall knowledge regarding ADHD, P < 0.001. <strong>Conclusions:</strong> The knowledge regarding ADHD among elementary school teachers in Madina is suboptimal, particularly regarding treatment.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "elementary school",
    "featured",
    "knowledge",
    "teachers",
    "awareness"
  ],
  "publication": {
    "year": 2018
  },
  "journal": {
    "name": "Journal of Family Medicine and Primary Care",
    "abbreviation": "J Family Med Prim Care",
    "issue": "7",
    "pages": {
      "start": "907",
      "end": "915"
    }
  },
  "authors": [
    {
      "given": "Esra'a Yahya",
      "family": "Al-Moghamsi",
      "authorship": "Primary Author",
      "sequence": 1
    },
    {
      "given": "Abdulaziz",
      "family": "Aljohani",
      "sequence": 2
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.4103__jfmpc.jfmpc_183_18.pdf",
    "sourceUrl": "https://doi.org/10.4103/jfmpc.jfmpc_183_18",
    "license": "cc-by-nc-sa"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4103-jfmpc.jfmpc_183_18"
}
