{
  "doi": "10.4172/2375-4427.1000168",
  "slug": "10.4172-2375-4427.1000168",
  "title": "Verbal Output Profile in Children with Attention Deficit Hyperactivity Disorder",
  "abstract": "Communicative differences are a feature of ADHD and measuring differences in verbal behavior can elucidate critical features of the disorder. This study focuses on quantity of verbal output through investigating the verbal productivity and length of turns in children with ADHD compared to age-matched typically developing (TD) children. The participants were twenty Saudi 4-5 year old boys. Ten were typically developing and ten had a diagnosis of ADHD. A 30 minute sample of speech during free play was collected from each child in conversation with an unfamiliar adult interlocutor (UI). All sessions were filmed and audio-recorded, the interactions transcribed then number of turns and whole words per turn counted. The results were statistically analyzed and showed that children with ADHD had a reduced verbal output with respect to total number of words, total number of verbal turns and average number of words per turn compared to typically developing children of similar age. It is argued that the differences are evidence of the negative effect of the core behavioral characteristics of ADHD on verbal pragmatic skills.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "Arabic verbal output",
    "Language",
    "Language Disorders",
    "Verbal Output",
    "Verbal Pragmatic",
    "arabic",
    "children",
    "featured",
    "research",
    "riyadh",
    "saudi"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "Communication Disorders, Deaf Studies & Hearing Aids",
    "abbreviation": "Commun Disord Deaf Stud Hearing Aids",
    "volume": "5",
    "issue": "1"
  },
  "authors": [
    {
      "given": "Hilary",
      "family": "Gardner",
      "sequence": 1
    },
    {
      "given": "Wael",
      "family": "Al-Dakroury",
      "sequence": 2
    }
  ],
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/doi__10.4172__2375-4427.1000168.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.4172-2375-4427.1000168"
}
