{
  "doi": "10.57197/jdr-2024-0069",
  "slug": "10.57197-jdr-2024-0069",
  "title": "The Structure of the Relationship Between Attention-deficit/Hyperactivity Disorder (ADHD) and Emotion Dysregulation Among Students in Saudi Arabia",
  "abstract": "Despite previous research indicating a link between attention-deficit/hyperactivity disorder (ADHD) and emotion dysregulation (EDR), the precise nature of this relationship remains incompletely understood. Therefore, the objective of this study is to propose a structural model that elucidates the connection between EDR disorder and the hyperactivity disorder that co-occurs with attention deficit in this population. The study was conducted with a sample of 180 children, assessed by 30 teachers in public schools located in the Eastern Province of Saudi Arabia. To accomplish the study’s aim, the researchers developed a diagnostic scale to identify individuals with the hyperactivity disorder that accompanies attention deficit, as well as a scale to assess EDR disorder. The findings of the study demonstrate a positive association between ADHD and EDR. Despite the limitations inherent in diagnostic research within this domain, the structural model proposed in this study offers a distinctive framework for jointly classifying EDR disorder and ADHD. Future investigations in this often overlooked area may be guided by the divergent predictions offered by each of these models.",
  "categories": [
    "Uncategorized"
  ],
  "publication": {
    "type": "Journal Article",
    "year": 2024
  },
  "journal": {
    "name": "Journal of Disability Research",
    "abbreviation": "Journal of Disability Research",
    "issn": "1658-9912, 1658-9912",
    "volume": "3",
    "issue": "6"
  },
  "authors": [
    {
      "given": "Yusra Zaki",
      "family": "Aboud",
      "authorship": "Primary Author",
      "sequence": 1
    },
    {
      "given": "Rommel",
      "family": "AlAli",
      "sequence": 2
    },
    {
      "given": "Amani",
      "family": "Bukhamseen",
      "sequence": 3
    }
  ],
  "access": {
    "status": "open",
    "licenseUrl": "https://creativecommons.org/licenses/by/4.0/",
    "sourceUrl": "http://dx.doi.org/10.57197/jdr-2024-0069"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.57197-jdr-2024-0069"
}
