{
  "id": "doi-10.55074-hesj.vi50.1611",
  "slug": "10.55074-hesj.vi50.1611",
  "doi": "10.55074/hesj.vi50.1611",
  "identifiers": {
    "doi": "10.55074/hesj.vi50.1611"
  },
  "title": "Perceptions of teachers of students with ADHD about the implementation of Co-Teaching: A qualitative study",
  "language": "Arabic",
  "categories": [
    "Awareness"
  ],
  "access": {
    "status": "open",
    "licenseUrl": "https://creativecommons.org/licenses/by/4.0/",
    "sourceUrl": "https://hesj.org/ojs/index.php/hesj/article/download/1611/1308",
    "localPdfUrl": "library/doi__10.55074__hesj-vi50-1611.pdf",
    "researchGateUrl": "https://www.researchgate.net/publication/398112078_tswurat_mlmat_altlmydhat_dhwat_adtrab_frt_alhrkt_wtshtt_alantbah_hwl_ttbyq_altdrys_altsharky_drast_nwyt",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "abstract": "The current study aimed to explore the perceptions of female teachers of students with Attention Deficit Hyperactivity Disorder (ADHD) regarding the implementation of co-teaching, in addition to identifying the obstacles that hinder its application and examining how to support teachers to enable them to implement co-teaching effectively. To achieve this, the researcher employed a qualitative approach by conducting semi-structured individual interviews with eight teachers, including general education and special education teachers, working in public elementary schools in Riyadh. According to the qualitative data analysis, the study’s findings revealed several themes regarding teachers’ perceptions of co-teaching implementation. These included limited awareness of the different co-teaching models and the benefits of applying co-teaching for both students and teachers. Additionally, the results identified a set of obstacles that may impede co-teaching, including those related to the educational environment, the teaching team, and the scarcity of training programs. The study also highlighted a number of factors that may facilitate the implementation of co-teaching, namely personal factors of the teaching team, training-related factors, and administrative factors.\n\nتصوُّرات معلمات التلميذات ذوات اضطراب فرط الحركة وتشتت الانتباه حول تطبيق التدريس التشاركي: دراسة نوعية\n\nهدفت الدراسة الحالية إلى التعرف على تصوُّرات معلمات التلميذات ذوات اضطراب فرط الحركة وتشتت الانتباه حول تطبيق التدريس التشاركي، والكشف عن المعوقات التي تحُول دون تطبيق التدريس التشاركي، وكيفية دعمهن لتمكينهن من تطبيق التدريس التشاركي، ولتحقيق ذلك استخدمت الباحثة المنهج النوعي؛ من خلال إجراء مقابلات فردية شبه منظَّمة مع (8) معلمات تعليم عام، ومعلمات تربية خاصة يعملن في المدارس الحكومية الابتدائية بمدينة الرياض، ووفقًا لتحليل البيانات النوعية؛ أظهرت نتائج الدراسة عددًا من الموضوعات التي تتحدث فيها المعلمات عن تصوُّراتهن حول تطبيق التدريس التشاركي، وهي: قلة الوعي بالنماذج المختلِفة للتدريس التشاركي، وفوائد تطبيق التدريس التشاركي على مستوى التلميذات والمعلمات، وكشفت النتائج عن مجموعة من المعوقات التي قد تحُول دون تطبيق التدريس التشاركي، وتمثلت في المعوقات المتعلقة بالبيئة التعليمية، وفريق العمل، وقلة البرامج التدريبية، كما أظهرت الدراسة عددًا من العوامل التي قد تساعد على تطبيق التدريس التشاركي، وهي العوامل الشخصية لفريق العمل، والعوامل التدريبية، والعوامل الإدارية.",
  "authors": [
    {
      "given": "Imtinan Ahmed",
      "family": "Almohsen",
      "sequence": 1
    }
  ],
  "publication": {
    "year": 2025
  },
  "journal": {
    "name": "Humanities and Educational Sciences Journal",
    "issn": "2709-0302",
    "issue": "50",
    "pages": {
      "start": "519",
      "end": "542"
    }
  }
}
