{
  "doi": "10.5339/nmejre.2013.5",
  "slug": "10.5339-nmejre.2013.5",
  "title": "Teacher Knowledge Training and Acceptance of Students with ADHD in their Classrooms Qatar Case Study",
  "abstract": "The presence of Attention Deficit Hyperactivity Disorder (ADHD) is similar to other neurological disorders of the brain in that it lacks a simple specific blood or other straightforward test to confirm the disorder. Parent and teacher rating scales are the standard measure of the presence of ADHD. Most referrals to medical professionals for an ADHD assessment are made by the student&quot;s teacher. Qatar schools are staffed differently than other countries in the region, with less than 25% of teachers being local Qataris. Given the appointment of teachers from surrounding nations, there is a lack of quality control for teacher preparation with each nation setting their own standards for teacher education and professional development. Without adequate knowledge of ADHD, teachers may not be able to accurately complete the teacher rating scales needed by medical professionals to assist in confirming a diagnosis of ADHD. Therefore, it is important that teachers understand the characteristics of ADHD, and that ADHD is a neurobiological disorder. This descriptive study explores teacher knowledge and perceptions of ADHD. The instrument for this study was derived from the Knowledge of Attention Deficit Disorders Scale (KADDS) adapted to fit the local Qatari context and study objectives. Participants were recruited from a random sample of Qatar Independent Schools. Frequency distributions and t-tests were conducted to determine ranges of responses, and relationships between responses and four demographic variables. Results are reported for demographics, teacher knowledge and teacher perceptions and beliefs. The results suggest that current clinical and scientific knowledge of the symptoms, causes and treatment of ADHD is not included in teacher preparation or professional development programs. Thus the ability of teachers to assess eligible students and to monitor medications for students with ADHD comes under question. Promising results include the fact that many teachers reported that they did not know the answers to more than 35% of the survey questions and therefore their knowledge and attitudes may be more readily influenced through workshops and in service programs.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "ADHD",
    "arab world",
    "attitudes",
    "inclusion",
    "qatar",
    "teachers education"
  ],
  "publication": {
    "year": 2013
  },
  "journal": {
    "name": "Near and Middle Eastern Journal of Research in Education",
    "abbreviation": "Near and Middle Eastern Journal of Research in Education",
    "volume": "5",
    "issue": "1"
  },
  "authors": [
    {
      "given": "Madeeha",
      "family": "Kamal",
      "sequence": 1
    },
    {
      "given": "Lori",
      "family": "Bradshaw",
      "sequence": 2
    }
  ],
  "access": {
    "status": "closed",
    "localPdfUrl": "library/doi__10.5339__nmejre.2013.5.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.5339-nmejre.2013.5",
  "language": "English"
}
