{
  "doi": "10.5539/ijps.v8n2p111",
  "slug": "10.5539-ijps.v8n2p111",
  "title": "Social Information Processing and Reactive and Proactive Aggression among Children with ADHD",
  "abstract": "This study examined the social information processing qualities among children with reactive and proactive aggression among children with Attention Deficit Hyperactive Disorder (ADHD). It enrolled a total of 112 Saudi school children (62 boys, 50 girls; mean age = 9.26 years, SD = 1.98) of which 51 were diagnosed with ADHD and 61 typically developing peers. Data on children&quot;s social informational processing and type of aggression displayed were gathered and analyzed for group differences by diagnosis and gender within diagnosis. Findings suggest gaps in social information processing and elevated aggression levels among children with ADHD compared to typical others. Male children with ADHD to present mostly with proactive aggression and self-serving information processing. Female ADHD were characterized by reactive aggression and selective information processing. Implicit socialization processes might explain the differences in social information processing and type of aggression among male and female students with Arabic culture background.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "aggression",
    "behavior",
    "boys",
    "girls",
    "primary school",
    "study"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "International Journal of Psychological Studies",
    "abbreviation": "IJPS",
    "volume": "8",
    "issue": "2",
    "pages": {
      "start": "111",
      "end": "119"
    },
    "issn": "1918-722X"
  },
  "authors": [
    {
      "given": "Huda Shaaban",
      "family": "Awed",
      "sequence": 1
    },
    {
      "given": "Muhammad Ahmed",
      "family": "Hammad",
      "sequence": 2
    }
  ],
  "access": {
    "status": "open",
    "sourceUrl": "https://doi.org/10.5539/ijps.v8n2p111",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.5539-ijps.v8n2p111",
  "identifiers": {
    "doi": "10.5539/ijps.v8n2p111"
  }
}
