{
  "doi": "10.52634/mier/2020/v10/i1/1355",
  "slug": "10.52634-mier-2020-v10-i1-1355",
  "title": "The Prevalence of Attention Deficit Hyperactivity Disorder (ADHD) Among Elementary School Children: The Effect of Certain Demographic Variables",
  "abstract": "The study aimed to determine the prevalence of ADHD symptoms in Saudi children aged 6 to 13 years in Jeddah city. The study also explored the effect of variables namely teacher's knowledge, years of experience and teachers' gender on reported ADHD symptoms among primary grade students. A questionnaire survey methodology was adopted for the study. 550 children were included in the teachers' survey. Teachers assessed the ADHD symptoms in children using an 18-item scale based on DSM-V. The results indicated that the prevalence rates of ADHD among school-age differed according to ADHD subtypes. The Inattention type was rated by 35.34%, Hyperactivity/Impulsivity type was rated by 28.60%, and ADHD-C type was rated by 21.3% of the respondents. According to gender, for the Inattention subtype, the ratio between boys and girls was 1.7:1, for the Hyperactivity/Impulsivity subtype, the ratio between boys and girls was 2.03:1, and for combined subtype, the ratio between boys and girls was 2.2:1. According to the grade level, the highest prevalence of ADHD overall was found in grade three and the lowest prevalence was in grade six in all ADHD types. The present findings indicated that teachers' knowledge and gender (female) successfully predicted teacher-rated ADHD status.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "Attention Deficit",
    "Hyperactivity/Impulsivity Deficit",
    "Prevalence Rates",
    "DSM-V",
    "prevalence"
  ],
  "publication": {
    "year": 2020
  },
  "journal": {
    "name": "MIER Journal of Educational Studies Trends and Practices",
    "abbreviation": "MIER Journal of Educational Studies Trends and Practices",
    "volume": "10",
    "issue": "1",
    "pages": {
      "start": "75",
      "end": "90"
    }
  },
  "authors": [
    {
      "given": "Tagreed Ameen",
      "family": "Zagzoog",
      "authorship": "Primary Author",
      "sequence": 1
    },
    {
      "given": "Rehab Mohammed Samy",
      "family": "Elshazly",
      "sequence": 2
    },
    {
      "given": "Mohammad Sayed Said",
      "family": "Soliman",
      "sequence": 3
    }
  ],
  "access": {
    "status": "open"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.52634-mier-2020-v10-i1-1355"
}
