{
  "doi": "10.5430/jnep.v7n5p104",
  "slug": "10.5430-jnep.v7n5p104",
  "title": "Effect of applying play therapy on children with attention deficit hyperactivity disorder",
  "abstract": "Background: Attention Deficit Hyperactivity Disorder (ADHD) is a serious public health problem affecting a large number of children that often lasts into adulthood, and it is characterized by persistence of inattention, hyperactivity and impulsivity that interferes with functioning or development. Children with ADHD are managed with appropriate pharmacological and non-pharmacological intervention such as educational, psychological, behavioral support and play therapy. Whereas, play therapy is a technique during which the child would be given an opportunity to experience development under the most ideal circumstances. Aim: Evaluate the effect of applying play therapy on children with ADHD. Methods: Study Design: A quasi experimental. Setting: The study was conducted in Badghish care &amp; Rehabilitation center at Jeddah in Kingdom of Saudi Arabia. Subjects: Purposive sample composed of 40 preschool &amp; school age children with ADHD with their parents and teachers. Study Tools: Data were collected through using a self-administered questionnaire for the parents to assess the socio-demographic characteristics of the studied children and their families, Conner&quot;s Abbreviated Parents and Teachers Rating scale, it was used to assess and evaluate the problematic behaviors of children with ADHD for their responses and progress monitoring through play therapy, Children&rsquo;s Symptom Inventory (CSI-4)-Parents and Teachers Form Scale, it was used to assess the children for ADHD symptoms including; inattention, hyperactivity and impulsivity through their parents and teachers and Vanderbilt ADHD Parent and Teacher Rating Scale, it was used to assess children&rsquo;s anxiety symptoms through their parents and teachers. Results: The mean age of children was 6.282 &plusmn; 1.52 years. Also, 67.5% of children were boys and 32.5% were girls. Meanwhile, there were high statistical significant differences ( p -value at .00) regarding children inattention, hyperactivity and impulsivity as reported by their parents and teachers pre and post applying play therapy. Conclusions: The current study concluded that applying play therapy had a positive effect on paying attention, decreasing hyperactivity and controlling impulsive behavior of children with ADHD. Also, there were statistical significant differences in children&rsquo;s emotional and behavioral disturbances pre and post applying play therapy sessions. Recommendations: Encourage parents to cooperate actively when play therapy sessions are held for persistency of treatment effects and further studies should be carried out on the effectiveness of play therapy and use of other different kinds of therapies for children with ADHD are beneficial.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "jeddah",
    "play",
    "therapy"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "Journal of Nursing Education and Practice",
    "abbreviation": "JNEP",
    "volume": "7",
    "issue": "5",
    "pages": {
      "start": "104",
      "end": "119"
    }
  },
  "authors": [
    {
      "given": "Hanan Ibrahim",
      "family": "Ahmed",
      "sequence": 1
    },
    {
      "given": "Manal Hassan",
      "family": "Abo-Elmagd",
      "sequence": 2
    },
    {
      "given": "Nahed Saied",
      "family": "El-Nagger",
      "sequence": 3
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.5430__jnep.v7n5p104.pdf",
    "sourceUrl": "http://www.sciedupress.com/journal/index.php/jnep/article/download/9108/6627"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.5430-jnep.v7n5p104",
  "language": "English"
}
