{
  "doi": "10.7759/cureus.91607",
  "slug": "10.7759-cureus.91607",
  "title": "Evaluation of General Public Awareness, Knowledge, and Attitude Towards Attention-Deficit/Hyperactivity Disorder in the Riyadh Region of Saudi Arabia",
  "abstract": "Background Attention‑deficit/hyperactivity disorder (ADHD) is a common neurodevelopmental disorder with a global prevalence of around 5% among children and adolescents. Despite increasing diagnoses, public knowledge about ADHD remains limited, contributing to stigma and delayed care. In Saudi Arabia, evidence on community awareness and attitudes is sparse. Objective This study assessed the awareness, knowledge, attitudes, and selected practices related to ADHD among adults in the Riyadh region of Saudi Arabia. Methods A cross‑sectional survey was conducted from July 2024 to January 2025 using a self‑administered online questionnaire distributed via WhatsApp. Adults ≥18 years residing in Riyadh and able to read Arabic or English were invited. The instrument included four demographic questions and 23 items assessing knowledge (multiple choice) and attitudes (Likert scale). Knowledge scores were categorized as poor (<50% of items correct), moderate (50-75%), or good (>75%). Attitude scores were classified as negative (<50%), neutral (50-75%), or positive (>75%). Practice questions on help‑seeking and information sources were analyzed descriptively. Data were analyzed using SPSS, and normality was assessed using the Kolmogorov-Smirnov test. Because knowledge and attitude scores were non‑normally distributed, Mann‑Whitney U and Kruskal-Wallis H tests were used to compare groups, and Spearman’s correlation was used to assess associations. Results A total of 573 adults participated in the survey (response above the calculated sample of 385). Most were aged 18-25 years (60.2%) and were male (63%). Approximately 75% had previously heard of ADHD, but only 23.9% recognized it as a lifelong condition. Although 79.4% and 77.1% correctly identified inattention and hyperactivity as core symptoms, respectively, only 42.4% recognized impulsivity. Genetic factors were acknowledged by 61.1%, and 80.5% endorsed behavioral and pharmacological management. The mean (± SD) knowledge score was 6.48 ± 1.39. Out of the 573 participants, 49.9% showed poor knowledge, 48.9% showed moderate knowledge, and only 1.2% showed good knowledge. The attitude domain mean score was 39.9 ± 4.19 (range 13-55); 36.8% had a positive attitude, 62.8% had a neutral attitude, and 0.3% had a negative attitude. Most respondents believed that treatment and parenting skills improved outcomes, yet many hesitated to support inclusion of ADHD children in mainstream schools. Regarding practice, 55.7% had sought information about ADHD, 33.7% knew where to seek help, and 43.6% had interacted with someone with ADHD. The most common information source was the internet (78.7%), followed by friends/family (35.1%). Knowledge and attitude scores were positively correlated (rs = 0.165, p < 0.001). Higher education, female gender, and previous exposure to ADHD were associated with higher knowledge and more positive attitudes (p < 0.05). Conclusion Despite widespread awareness of ADHD, substantial gaps exist in public understanding of its symptoms, chronicity, and etiology. Attitudes were generally neutral, with reluctance toward full educational inclusion. Targeted educational initiatives and public campaigns are necessary to improve knowledge and foster supportive attitudes toward individuals with ADHD in Saudi Arabia.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Salahuddin",
      "family": "Khan",
      "sequence": 1
    },
    {
      "given": "Ammar Y",
      "family": "Al Qahtani",
      "sequence": 2
    },
    {
      "given": "Abdulrahman K",
      "family": "Aburas",
      "sequence": 3
    },
    {
      "given": "Sultan H",
      "family": "AlKhashan",
      "sequence": 4
    },
    {
      "given": "Fahad A",
      "family": "Giraud",
      "sequence": 5
    },
    {
      "given": "Khaled M",
      "family": "Alolayan",
      "sequence": 6
    },
    {
      "given": "Abdullah A",
      "family": "AL Mohsen",
      "sequence": 7
    },
    {
      "given": "Abdulaziz M",
      "family": "Almegren",
      "sequence": 8
    },
    {
      "given": "Mohammed I",
      "family": "Albalawi",
      "sequence": 9
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.7759__cureus.91607.pdf",
    "sourceUrl": "https://www.cureus.com/articles/363181-evaluation-of-general-public-awareness-knowledge-and-attitude-towards-attention-deficithyperactivity-disorder-in-the-riyadh-region-of-saudi-arabia.pdf",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.7759-cureus.91607",
  "publication": {
    "year": 2025
  },
  "journal": {
    "name": "Cureus",
    "issn": "2168-8184"
  },
  "identifiers": {
    "doi": "10.7759/cureus.91607"
  }
}
