{
  "doi": "10.7363/050211",
  "slug": "10.7363-050211",
  "title": "Neurobehavioral outcomes of school-age children born preterm: a preliminary study in the Arabic community",
  "abstract": "<strong>Introduction</strong>: Preterm survivors from the neonatal intensive care unit (NICU) are considered as high risk group for some neurobehavioral impairments such as cognitive disabilities, developmental delays, social/ emotional limitations, attention-deficit/hyperactivity disorder (ADHD), and academic difficulties. <strong>Objective</strong>: The current study aimed to investigate the neurobehavioral outcome of premature infants in Saudi Arabia at the school age. <strong>Methods</strong>: At the school age, preterm children (range 23-29 weeks or ≤ 1.52 kg) born from April, 2006 through September, 2008, and who were admitted following birth to a NICU, were evaluated with several neurobehavioral tools. <strong>Results</strong>: This study includes 53 preterm children, who were followed up at the chronological age that ranged from 6.4-8.0 years. The results of the neurobehavioral assessments showed in general normal social adaptive levels and cognitive abilities, with mean total score of about 91.0 and 90.0, respectively. The prevalence of ADHD among preterm children was high, with result of 34.0% for the inattentive type and 11.3% for the hyperactive/ impulsive type. None of the preterm children repeats a grade, but 22.6% utilize a form of special educational supports. Some of the preterm children showed poor school performance in reading skills, writing skills and mathematics skills, with percentages of 26.4%, 28.3% and 15.1%, respectively. <strong>Conclusions</strong>: The present results emphasize that preterm children are a group of high-risk children who need regular follow-up to track the developmental conditions and to provide the early developmental intervention for optimal outcome.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "developmental",
    "featured",
    "neonatal",
    "neurobehavioral",
    "neuropsychology",
    "preterm children",
    "prevalence",
    "saudi arabia",
    "study",
    "risk factors"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "Journal of Pediatric and Neonatal Individualized Medicine",
    "abbreviation": "J Pediatr Neonat Individual Med",
    "volume": "5",
    "issue": "2"
  },
  "authors": [
    {
      "given": "Mohammed M.J.",
      "family": "Alqahtani",
      "authorship": "Primary Author",
      "sequence": 1
    }
  ],
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/doi__10.7363__050211.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.7363-050211"
}
