{
  "doi": "10.7759/cureus.42957",
  "slug": "10.7759-cureus.42957",
  "title": "The Prevalence of Video Game Addiction and Its Relation to Anxiety, Depression, and Attention Deficit Hyperactivity Disorder (ADHD) in Children and Adolescents in Saudi Arabia: A Cross-Sectional Study",
  "abstract": "Background and objective Video games have become a popular source of entertainment among children and adolescents, not only targeting the young generation but also increasingly popular among older demographics as well. This study aimed to assess the association between video game addiction and depression, anxiety, and attention deficit hyperactivity disorder (ADHD) among children and adolescents in Saudi Arabia. Materials and methods This was a cross-sectional study involving Saudi adolescents aged 12-16 years. A self-administered online survey was distributed on social media (Twitter, WhatsApp, and Snapchat). The survey addressed sociodemographic characteristics (i.e., age, gender, area of residence city, etc.). Arabic versions of the Patient Health Questionnaire-9 (PHQ-9), the seven-item Generalized Anxiety Disorder Scale (PHQ-GAD7), the ADHD Rating Scale-IV (ADHD-RS), and the seven-item Game Addiction Scale (GAS-7) questionnaires were distributed as well, including Arabic terms for depression, anxiety, and ADHD. Results A total of 393 surveys were completed (males: 58.3% vs. females: 41.7%). Of note, 63.1% of the respondents reported playing video games every day with an average of more than five hours of gaming time per day (25.2%). The prevalence of video game addiction was 62.1%. Independent risk factors of video game addiction included being young in age, playing video games every day, playing more than three hours per day, and playing multiplayer games. Furthermore, our findings suggest that a higher video game addiction score is correlated with higher scores in inattention, anxiety, and depression. Conclusion This study found a high prevalence of video game addiction among Saudi children and adolescents. Excessive video game playing negatively influences mental health and leads to issues including anxiety, depression, and ADHD. Also, younger males with an increased rate of regular playtime were more likely to exhibit video game addiction in comparison to the rest of the population. Further research is required to more comprehensively assess the prevalence rate of video game addiction and its effect on the mental health of the younger generation within the region.",
  "categories": [
    "Uncategorized"
  ],
  "authors": [
    {
      "given": "Nader",
      "family": "Alrahili",
      "sequence": 1
    },
    {
      "given": "Mohammad",
      "family": "Alreefi",
      "sequence": 2
    },
    {
      "given": "Issa M",
      "family": "Alkhonain",
      "sequence": 3
    },
    {
      "given": "Malak",
      "family": "Aldakhilallah",
      "sequence": 4
    },
    {
      "given": "Jamal",
      "family": "Alothaim",
      "sequence": 5
    },
    {
      "given": "Abdulwahed",
      "family": "Alzahrani",
      "sequence": 6
    },
    {
      "given": "Abdulrahman",
      "family": "Alshargi",
      "sequence": 7
    },
    {
      "given": "Nuran",
      "family": "Baabbad",
      "sequence": 8
    }
  ],
  "access": {
    "status": "open",
    "localPdfUrl": "library/doi__10.7759__cureus.42957.pdf",
    "sourceUrl": "https://assets.cureus.com/uploads/original_article/pdf/173219/20230804-2571-1fsuusp.pdf",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.7759-cureus.42957",
  "publication": {
    "year": 2023
  },
  "journal": {
    "name": "Cureus",
    "issn": "2168-8184"
  },
  "identifiers": {
    "doi": "10.7759/cureus.42957"
  }
}
