{
  "doi": "10.9734/jocamr/2018/45315",
  "slug": "10.9734-jocamr-2018-45315",
  "title": "Psychotropic Medications Weight Gain: A Clinical Dilemma Looked Through the Lens of Therapeutic Challenges, Complementary Approaches and Pharmacotherapies",
  "abstract": "<strong>Background:</strong> Psychotropic drugs especially second generation of antipsychotics and antidepressants are used in psychiatric patients with severe mental disorders. These disorders are associated with weight gain and obesity that poses clinical challenges. This needs individualised- tailored integrative interventions including the promotion of health and wellbeing. <strong>Objective:</strong> The review critically assimilates evidence-based data on several aspects of psychotropic-induced weight gain with a focus on therapeutic challenges and multidimensional integrative management strategies along with pharmacological interventions. <strong>Methods:</strong> Electronic searches of three databases (from 2000 to 2018) using Boolean operators and keywords retrieved thousands of peer-reviewed articles published in scientific journals. Based on exclusion and inclusion criteria 141 pertinent articles were retained for this review. <strong>Results:</strong> Overweight in psychiatric patients on weight increasing psychotropic medications is associated with a variety of adverse consequences and therapeutic challenges. Overweight and obesity is reported to need a multimodal patient-centred approaches regarding lifestyle changes, dietary modifications and medicinal herbs, cognitive behavioural therapy, motivational psychotherapy and weight controlling pharmacological interventions. Multimodal treatment directed towards overweight is often delivered by a multidisciplinary team in well-equipped clinical settings. Symptom relief from the primary psychiatric illness is necessary for this strategy to work. <strong>Conclusion:</strong> Although overweight or obesity secondary to psychotropic medication poses a number of treatment challenges, an integrative intervention that combines complementary therapies with conventional medications appears to work best. This review calls for comparative research to determine the most effective strategies to combat weight gain in psychiatric populations.",
  "categories": [
    "Uncategorized"
  ],
  "keywords": [
    "antipsychotics",
    "psychotropic",
    "weight gain"
  ],
  "publication": {
    "year": 2018
  },
  "journal": {
    "name": "Journal of Complementary and Alternative Medical Research",
    "abbreviation": "JOCAMR",
    "volume": "6",
    "issue": "3",
    "pages": {
      "start": "1",
      "end": "22"
    }
  },
  "authors": [
    {
      "given": "Naseem A",
      "family": "Qureshi",
      "sequence": 1
    },
    {
      "given": "Yaser S",
      "family": "Alahmari",
      "sequence": 2
    }
  ],
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/doi__10.9734__jocamr__2018__45315.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "id": "doi-10.9734-jocamr-2018-45315"
}
