{
  "id": "legacy-85daea8a29",
  "slug": "a-descriptive-study-of-attention-deficit-hyperactivity-disorder-in-sabia-city-saudi-arabia-2013",
  "title": "A Descriptive Study of Attention Deficit Hyperactivity Disorder in Sabia City, Saudi Arabia.",
  "abstract": "Introduction: Among childhood mental disorders, attention deficit hyperactivity disorder is a common yet under diagnosed condition. Few studies have addressed this problem in Saudi Arabia. Objectives: To assess proportion of attention deficit hyperactivity disorder (ADHD) positive students among primary school children in Sabia City, Jizan and study their personal characteristics. Subjects and Methods: Four primary schools in Sabia City were randomly selected. A total of 200 pupils (100 boys and 100 girls) were included in this study. Data collection tools included the personal characteristics questionnaire and the Arabic version of the ADHD Rating Scale. Results: A total of 13.5% of students were positive regarding ADHD, with higher percentage of positive results among male than female students (15% vs. 12%, respectively). Younger students had higher percentage of positive results than older students. Highest percentage of positive results were observed among students who were first born (20.7%) followed by those who were last born (14.8%). Students whose fathers were illiterate had the highest proportion of positive results (31.3%), while students whose mothers were illiterate had significantly highest proportion of positive results (40.8%, p10 members had the highest proportion of positive results. Conclusions: ADHD is common among primary school children in Sabia City. Symptoms of ADHD are more among boys than girls. There is higher proportion of ADHD symptoms among school children whose mothers are illiterate.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "boys",
    "featured",
    "girls",
    "prevalence",
    "primary school",
    "school",
    "study"
  ],
  "publication": {
    "year": 2013
  },
  "journal": {
    "name": "International Journal of Current Research and Review",
    "abbreviation": "Int J Cur Res Rev",
    "volume": "5",
    "issue": "11",
    "pages": {
      "start": "43",
      "end": "48"
    }
  },
  "access": {
    "status": "open",
    "license": "CC BY-NC 4.0",
    "licenseUrl": "https://creativecommons.org/licenses/by-nc/4.0/",
    "publisherUrl": "https://ijcrr.com/abstract.php?article_id=1317",
    "localPdfUrl": "library/a-descriptive-study-of-attention-deficit-hyperactivity-disorder-in-sabia-city-saudi-arabia-2013-de42a77b46.pdf"
  },
  "identifiers": {
    "url": "https://ijcrr.com/abstract.php?article_id=1317"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Raed A. H.",
      "family": "Abu Taleb",
      "sequence": 1
    },
    {
      "given": "Aesha",
      "family": "Farheen",
      "sequence": 2
    }
  ]
}
