{
  "id": "legacy-f8dedf2afc",
  "slug": "adhd-awareness-among-medical-students-2017",
  "title": "ADHD Awareness Among Medical Students",
  "abstract": "<strong>Background</strong>: Early recognition of attention deficit hyperactivity disorder (ADHD) is needed to prevent its psychosocial and educational consequences. We aimed to study ADHD awareness among medical students and identify correlating and contributing factors to their lack of knowledge. <strong>Methods</strong>: A cross sectional study included 5th year medical students attending their pediatric rotation from September 15, 2012 until June 15, 2013 at King Abdulaziz University hospital, Jeddah, Kingdom of Saudi Arabia. A structured 25-item questionnaire was designed to examine their demographics , educational experience, and awareness questions about ADHD. <strong>Results</strong>: Of 120 approached students, 111 were included with ages ranging from 20-29 years (mean 22) and 69% being females. Most students 69 (62%) were enrolled during their pediatric rotation and 97 (87%) already completed their psychiatry course. Although most students (67%) recognized ADHD, only 13 (12%) categorized their level of knowledge as very good or excellent. Only 24% correctly recognized ADHD subtypes and 58% did not know what is the initial required management step. Only 19 students (17%) correctly recognized all ADHD features based on the DSM IV criteria with a mean correct score of 69% (standard deviation 14). No correlations were found with their age, gender, completing their pediatric/ psychiatry rotation, or specialty interests. <strong>Conclusions</strong>: Medical student\"s level of knowledge about ADHD needs improvement. This has to be corrected in order to improve early recognition and intervention. Increased ADHD education and exposure during pediatric/neuroscience modules are needed in our region.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "awareness",
    "jeddah",
    "medical students"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "World Journal of Research and Review",
    "abbreviation": "WJRR",
    "volume": "4",
    "issue": "3",
    "pages": {
      "start": "61",
      "end": "64"
    }
  },
  "access": {
    "status": "open",
    "localPdfUrl": "library/adhd-awareness-among-medical-students-2017-48c707ffa7.pdf",
    "sourceUrl": "https://doi.org/10.31871/wjrr.4.3.14"
  },
  "identifiers": {
    "doi": "10.31871/wjrr.4.3.14"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Hebah F",
      "family": "Qashqari",
      "sequence": 1
    },
    {
      "given": "Abdulaziz",
      "family": "Alsulami",
      "orcid": "https://orcid.org/0000-0003-4083-4475",
      "sequence": 2
    },
    {
      "given": "Eman K",
      "family": "Kamal",
      "sequence": 3
    },
    {
      "given": "Mohammed M.",
      "family": "Jan",
      "orcid": "https://orcid.org/0000-0002-5188-8922",
      "sequence": 4
    }
  ],
  "doi": "10.31871/wjrr.4.3.14"
}
