{
  "id": "legacy-52f872bd30",
  "slug": "assessment-of-pediatricians-need-for-training-in-child-psychiatry-2008",
  "title": "Assessment of Pediatricians Need for Training in Child Psychiatry",
  "abstract": "<strong>Background: </strong> Psychosocial problems are common health concerns in children. Therefore, it is essential for pediatricians to be able to identify psychiatric disorders. This depends on the knowledge, practice and attitudes towards psychiatric disorders in childhood. <strong>Methods: </strong> A constructed questionnaire of items about knowledge, practice and attitudes of pediatricians toward psychiatric disorders in childhood was used. Four hundred and fifty questionnaires were distributed and collected from pediatricians in seven main governmental hospitals in Riyadh over a period of three months (between March 1 and May 30 2005). Findings were analyzed statistically. <strong>Results:</strong> About 88.8% of the samples had not had any training in child psychiatry during their residency. Forty-eight percent were hesitant in diagnosing psychiatric disorders in children, 76.5% were not confident enough to treat these children, 48.5% were not confident enough to follow them up after being managed by a child psychiatrist and 49.9% were not confident to treat common side effects of psychotropic medications. About 88.8% of the pediatricians thought that pediatricians needed training in child psychiatry during pediatric residency programs. <strong>Conclusion:</strong> A significant number of pediatricians reported a lack of training in child psychiatry during residency programs. This has an adverse impact on their knowledge, attitudes and possibly practices in dealing with childhood psychiatric disorders.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "diagnosis",
    "knowledge",
    "pediatricians",
    "study",
    "training",
    "awareness"
  ],
  "publication": {
    "year": 2008
  },
  "journal": {
    "name": "Journal of Family and Community Medicine",
    "abbreviation": "J. Fam. Community Med.",
    "volume": "15",
    "issue": "2",
    "pages": {
      "start": "71",
      "end": "75"
    }
  },
  "access": {
    "status": "closed",
    "localPdfUrl": "library/assessment-of-pediatricians-need-for-training-in-child-psychiatry-2008-bc7441e982.pdf"
  },
  "identifiers": {
    "doi": "10.4103/2230-8229.97051"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "FatimaA",
      "family": "Al-Haidar",
      "sequence": 1
    },
    {
      "given": "FahadD",
      "family": "Al-Osaimi",
      "sequence": 2
    }
  ],
  "doi": "10.4103/2230-8229.97051",
  "language": "English"
}
