{
  "id": "legacy-d0b8b8dc1d",
  "slug": "assessment-of-school-health-in-saudi-arabia-the-path-to-improved-future-students-health-implications-of-the-saudi-school-health-program-2022",
  "title": "Assessment of School Health in Saudi Arabia: The Path to Improved Future Students Health. (Implications of the Saudi School Health Program)",
  "abstract": "<strong>Background</strong>: The health and wellbeing of school students are of essential value to world communities. In Saudi Arabia (SA), a school health program was initiated with the strategic goal of enhancing the health of the students and the early detection of any health problems.\n\n<strong>Aims</strong>: This study aimed to identify the most common health problems and conditions among school students in SA based on the periodic examination program for school students (PEPSS).\n\n<strong>Method</strong>: A retrospective secondary data analysis from the Ministry of Health (MOH) was based on the program collected in 2018 across four school grades, namely, 1st primary, 4th primary, 1st intermediate, and 1st secondary grade, from 40 school complexes around SA. The collected data included variables related to sociodemographic, family history, past infec- tious diseases, completion of vaccinations, body mass index (BMI), visual acuity tests, dental examination, scoliosis tests, and attention deficit hyperactivity disorders (ADHD). Data were entered and analyzed using an SPSS program (version 20) where descriptive statistics were calculated, the association between an outcome and some main variables were also calcu- lated, and a p-value of less than 0.05 was considered as significant at a confidence interval of 95%.\n\n<strong>Results</strong>: From the overall 12,032 students, 46.6% were males, and 53.4% were females. The most common health problems reported were tooth decay (62%), low visual acuity (15.3%), overweight (9.7%), and obesity (8.8%). Although almost all students were fully immunized (99.4%), the health status was calculated as less likely lower among males than females (AOR 1.26; 95% CI: 1.17-1.37).\n\n<strong>Conclusion</strong>: The results concluded that dental caries and visual acuity were the highest health problems among students. The widespread prevalence of dental caries indicates the need for more research to appraise the public health implications of this developing problem.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "Periodic Examination Program",
    "School",
    "Students",
    "Health",
    "Saudi Arabia",
    "prevalence"
  ],
  "publication": {
    "year": 2022
  },
  "journal": {
    "name": "Journal of Public Health and Disease Prevention",
    "abbreviation": "J Public Health Dis Prev",
    "volume": "5",
    "issue": "102",
    "pages": {
      "start": "1",
      "end": "12"
    }
  },
  "access": {
    "status": "open",
    "researchGateUrl": "https://www.researchgate.net/publication/358642329_Assessment_of_School_Health_in_Saudi_Arabia_The_Path_to_Improved_Future_Students_Health_Implications_of_the_Saudi_School_Health_Program_Citation_Nora_Abdulrhman_Al-Shewear_Amen_A_Bawazir_2022_Assessme"
  },
  "visibility": {
    "hidden": false
  }
}
