{
  "id": "legacy-39a1037137",
  "slug": "attention-deficit-hyperactivity-symptoms-among-al-dawadmi-primary-schools-children-as-reported-by-their-teachers-2016",
  "title": "Attention Deficit Hyperactivity Symptoms among Al Dawadmi Primary Schools Children as Reported by Their Teachers",
  "abstract": "Attention deficit hyperactivity disorder (ADHD) is a neglected illness in both developing and developed countries; it represents a growing public health concern because of its long-term adverse effects, long-term treatment and the significant financial impact on families, schools and community. This study aimed to assess the prevalence of attention deficit hyper activity symptoms among Al dawadmi primary schools children as reported by their teachers and assess prevalence of symptoms according to children social characteristics. 52 students were included in the study from 6 primary schools in Al dawadmi city (3 males & 3 females) were chosen according all students suffer from ADHD symptoms as reported by their teachers and by their parents who accepted to their children participate in the study research. Data were collected during March 2015. Finding and conclusion: Nearly one third of the studied subjects suffer often from attention deficient symptoms aged from 10-<12, it was often manifested by female student (38.5%) more than male (30.7%) also hyperactivity/ impulsivity symptoms were often manifested by first child. More than half of studied subjects always had learning difficulties (55.8%) and avoid tasks which need concentration or mental effort (69%). One third of the studied subject has not guilt feeling. Recommendations: Early detection of the manifestations in affected children at early stage is significantly recommended to develop specific psychological intervention for them. All primary school children should be examined for prevalence of the manifestations.",
  "categories": [
    "Other"
  ],
  "keywords": [
    "Attention Deficit Hyperactivity symptoms",
    "Al Dawadmi",
    "primary schools"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "Egyptian Journal of Health Care",
    "abbreviation": "Egyptian Journal of Health Care",
    "volume": "7",
    "issue": "1",
    "pages": {
      "start": "1",
      "end": "16"
    },
    "issn": "1687-9546"
  },
  "access": {
    "status": "open",
    "sourceUrl": "https://ejhc.journals.ekb.eg/article_195279_26667e5d9a9d9b3aacbd0ee8887e3a9a.pdf",
    "license": "cc-by"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Sahar M. Abdull",
      "family": "Hameed",
      "sequence": 1
    },
    {
      "given": "Wafaa H. Al",
      "family": "Seraty",
      "sequence": 2
    }
  ],
  "doi": "10.21608/ejhc.2016.195279",
  "identifiers": {
    "doi": "10.21608/ejhc.2016.195279"
  }
}
