{
  "id": "legacy-c6882edf68",
  "slug": "attention-deficit-hyperactivity-disorder-knowledge-and-perception-of-dental-care-providers-2017",
  "title": "Attention Deficit Hyperactivity Disorder: Knowledge and Perception of Dental Care Providers",
  "abstract": "<strong>Aim:</strong> The aim was to measure the level of perception and knowledge of dental care providers to Attention Deficit Hyperactivity Disorder (ADHD) at King Abdulaziz University faculty of dentistry (KAUFD), Jeddah, Saudi Arabia. <strong>Materials and Methods:</strong> Three-part questionnaire with an explanatory method were mailed to 50 specialist pediatric faculty members and residents (Master, Doctorate degrees and Saudi Board) and 140 dental interns and externs. The first part of the questionnaire includes the participants\" demographic information. The second part related to the participants previous clinical and educational experiences with ADHD and the third part included questions related to the participants\" knowledge and management of ADHD. The respondents were asked to choose only one choice from 3 choices (agree, disagree, I do not know). <strong>Results:</strong> Working experience was found to be a significant factor (P ≤ 0.05) in relation to the background knowledge of the participants when comparing those with 10+ years of work experience to those with 1-3 years and 4-9 years work experience. Additionally, female participants had better knowledge than their male counterpart (p<0.001), as did married participants (p=0.007) and those who have children especially with regards to the adverse effects of drugs, oral health and dental management for ADHD patients (p=0.001, p=0.011, p=0.011). Interns also reported significant differences than consultants (P ≤ 0.05) in their knowledge and general information about oral health and dental management for ADHD. <strong>Conclusion:</strong> The background knowledge among a sample of oral health care providers in KAUFD was found to be statistically and positively related to the work experience in terms of years of practice as well as the social and demographic status of the participants.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "Comorbidity",
    "featured",
    "knowledge",
    "awareness"
  ],
  "publication": {
    "year": 2017
  },
  "journal": {
    "name": "Journal of Oral Health and Dental Management",
    "abbreviation": "OHDM",
    "volume": "16",
    "issue": "2",
    "pages": {
      "start": "1",
      "end": "7"
    }
  },
  "access": {
    "status": "unknown",
    "source": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Attention-Deficit-Hyperactivity-Disorder-Knowledge-and-Perception-of-Dental-Care-Providers-Nuwaiser-2017.pdf",
    "sourceUrl": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Attention-Deficit-Hyperactivity-Disorder-Knowledge-and-Perception-of-Dental-Care-Providers-Nuwaiser-2017.pdf",
    "localPdfUrl": "library/attention-deficit-hyperactivity-disorder-knowledge-and-perception-of-dental-care-providers-2017-13dbdcdbee.pdf"
  },
  "identifiers": {
    "url": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Attention-Deficit-Hyperactivity-Disorder-Knowledge-and-Perception-of-Dental-Care-Providers-Nuwaiser-2017.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
