{
  "id": "legacy-d808cfed03",
  "slug": "attention-deficit-hyperactivity-disorder-and-dental-traumatic-injuries-a-systemic-review-and-meta-analysis-2024",
  "title": "Attention deficit hyperactivity disorder and dental traumatic injuries: a systemic review and meta-analysis",
  "abstract": "<strong>OBJECTIVE:</strong> The objective of this study was to assess whether individuals with attention deficit hyperactivity disorder (ADHD) exhibit a higher prevalence of traumat- ic dental injuries (TDIs) compared to those with- out ADHD through a systematic review and me- ta-analysis of the existing literature.\n<strong>MATERIALS AND METHODS:</strong> A search strat- egy using the Medical Subject Heading (MeSH) vocabulary was employed for a comprehen- sive search across various databases, including PubMed, Scopus, Web of Science, Cochrane Li- brary, and Embase. The Joanna Briggs Institute Summary was utilized for data collection. Addi- tionally, quality assessment, meta-analysis, and bias control were conducted to ensure the reli- ability of the included studies. A meta-analysis was performed to consolidate the findings of the individual studies.\n<strong>RESULTS:</strong> The prevalence of TDIs among indi- viduals with ADHD ranged from 9.6% to 68.2%, while in the healthy control group, it ranged from 0.8% to 44.7%. The meta-analysis findings revealed that individuals with ADHD had 1.98 times higher odds (OR = 1.98, ranging from 1.51 to 2.59 with 95% CI) of experiencing TDIs com- pared to individuals without ADHD.\n<strong>CONCLUSIONS:</strong> The findings of this study suggest a significant association between ADHD and an increased risk of TDIs. Individ- uals with ADHD were found to be nearly twice as likely to experience TDIs compared to those without ADHD. Efforts should not only be direct- ed towards improving the oral health of this vul- nerable group of individuals, but also health- care practitioners need to be provided with op- portunities to create awareness and implement preventive measures to mitigate the risk of TDIs among individuals with ADHD.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "Dental injuries",
    "Attention deficit hyperactivity disorder",
    "Dental public health",
    "Disability",
    "Disabled individuals",
    "Oral health"
  ],
  "publication": {
    "year": 2024
  },
  "journal": {
    "name": "European Review for Medical and Pharmacological Sciences",
    "abbreviation": "ERMPS",
    "volume": "28",
    "pages": {
      "start": "3303",
      "end": "3312"
    }
  },
  "access": {
    "status": "open",
    "license": "CC BY-NC-ND 4.0",
    "source": "https://www.europeanreview.org/wp/wp-content/uploads/3303-3312.pdf",
    "sourceUrl": "https://www.europeanreview.org/wp/wp-content/uploads/3303-3312.pdf",
    "licenseUrl": "https://creativecommons.org/licenses/by-nc-nd/4.0/deed.en"
  },
  "identifiers": {
    "url": "https://www.europeanreview.org/wp/wp-content/uploads/3303-3312.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
