{
  "id": "legacy-bd5466d482",
  "slug": "attention-deficit-hyperactivity-disorder-adhd-among-male-primary-school-children-in-dammam-saudi-arabia-prevalence-and-associated-factors-2008",
  "title": "Attention deficit hyperactivity disorder (ADHD) among male primary school children in Dammam, Saudi Arabia: prevalence and associated factors",
  "abstract": "Attention Deficit Hyperactivity Disorder (ADHD) is one of the most common mental disorders that develop in children and becomes apparent in the preschool and early school years. Several family and maternal-related factors were shown to be associated with ADHD. The aim of the present study was to determine the prevalence of ADHD and associated family and psychosocial factors among male primary school children in Dammam city, Saudi Arabia. A sample size of 1287 students aged 6-13 years in 67 government and 10 private primary schools was selected by multistage systematic random sampling. Data was collected using two types of questionnaires: the modified Arabic version of the Attention Deficit Disorders Evaluation Scale (ADDES) school version, and Parents\" questionnaire to diagnose the three main subtypes of ADHD namely: inattention, hyperactivity-impulsivity, and combined ADHD. The majority of the boys were from government schools (83.0%), were of age 6-6-<9 years (40.5%) and of Saudi nationality (80.7%). The overall prevalence of combined ADHD was 16.4%, with a prevalence of 12.4% for hyperactivity-impulsivity and 16.3% for inattention disorders respectively. The study also revealed a variety of family factors to be significantly associated with the development of ADHD. The prevalence of each subtype of ADHD was higher if the child was the 6th one in the family. The prevalence of hyperactivity-impulsivity disorder was significantly higher among children living with single parents than those living with both parents (25.0% vs. 12.2% respectively; ρ =0.016). Inattention was significantly higher among those who had bottle feeding than breastfeeding (21.2% vs. 14.4% respectively; ρ=0.03). Conclusion and recommendations: several approaches directed to the child, family, the primary health care services, the school, and the community should be implemented to reduce the prevalence and incidence of ADHD.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "ADHD",
    "boys",
    "dammam",
    "featured",
    "prevalence",
    "primary school",
    "school",
    "study"
  ],
  "publication": {
    "year": 2008
  },
  "journal": {
    "name": "Journal of the Egyptian Public Health Association",
    "abbreviation": "J Egypt Public Health",
    "volume": "83",
    "issue": "0",
    "pages": {
      "start": "165",
      "end": "182"
    }
  },
  "access": {
    "status": "open",
    "license": "CC BY 4.0",
    "researchGateUrl": "https://www.researchgate.net/publication/24216395_Attention_Deficit_Hyperactivity_Disorder_ADHD_among_Male_Primary_School_Children_in_Dammam_Saudi_Arabia_Prevalence_and_Associated_Factors",
    "localPdfUrl": "library/attention-deficit-hyperactivity-disorder-adhd-among-male-primary-school-children-in-dammam-saudi-arabia-prevalence-and-associated-factors-2008-0486e30b27.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Jamal H Al",
      "family": "Hamed",
      "sequence": 1
    },
    {
      "given": "Attia Z.",
      "family": "Taha",
      "sequence": 2
    },
    {
      "given": "Amr",
      "family": "Sabra",
      "orcid": "https://orcid.org/0000-0001-8983-6231",
      "sequence": 3
    },
    {
      "given": "Hassan",
      "family": "Bella",
      "sequence": 4
    }
  ],
  "language": "English"
}
