{
  "id": "legacy-b73199cf28",
  "slug": "attention-deficit-hyperactivity-disorder-adhd-in-children-with-benign-childhood-epilepsy-with-centrotemporal-spikes-bect-2015",
  "title": "Attention Deficit Hyperactivity Disorder (ADHD) in Children with Benign Childhood Epilepsy with Centrotemporal Spikes (BECT)",
  "abstract": "<strong>Objective:</strong> The aim of this study is to estimate the occurrence of Attention Deficit Hyperactivity Disorder (ADHD) in children with Benign childhood epilepsy with centrotemporal spikes (BECT) Background: Benign childhood epilepsy with centrotemporal spikes (BECT) is the most common idiopathic focal epilepsy in children. ADHD is a common comorbidity in children with epilepsy especially BECT. Children with epilepsy and ADHD are likely to be at higher risk for more negative outcomes in school and terms of quality of life compared with children with epilepsy alone. <strong>Methods:</strong> This is a prospective hospital based study targeting a group of children who were diagnosed to have BECT and has been followed in neurology outpatient clinic at King Khalid University Hospital (KKUH), King Saud University, Riyadh, Saudi Arabia for four years from December 2010 - December 2014. BECT was diagnosed based on Commission on Classification and Terminology of the International League Against Epilepsy,1989. Children with neurometabolic, neurodegenerative disorders, mental retardation and evidence of hypoxic ischemic encephalopathy were excluded. All children included in the study were evaluated for ADHD by clinical evaluation and administering Vanderbilt scale. <strong>Results:</strong> Thirty four patients were enrolled, the age range from 6 -12 years, male 19 (56%) female 15 (44%). Age of seizure onset 3-12 years. Six children (17.6%) has ADHD. Three has Attention type represent (50%), and three patients has combined Attention with hyperactivity (50%). Twenty children(59%) were on antiepileptic drugs. The seizure was well controlled in all patients. <strong>Conclusion:</strong> ADHD is a common comorbidity in children with BECT. Patient with BECT should be routinely screened for ADHD. Applying scale like Vanderbilt scale for assessing the presence of ADHD in BECT patients is a good initial screening scale followed by proper psychiatric evaluation.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "ADHD",
    "Comorbidity",
    "Epilepsy",
    "study"
  ],
  "publication": {
    "year": 2015
  },
  "journal": {
    "name": "Neurology",
    "abbreviation": "Neurology",
    "volume": "86",
    "issue": "16",
    "pages": {
      "start": "3.258"
    }
  },
  "access": {
    "status": "unknown"
  },
  "visibility": {
    "hidden": false
  }
}
