{
  "id": "legacy-091250efdd",
  "slug": "attention-deficit-and-hyperactivity-disorder-adhd-symptoms-in-saudi-children-parental-knowledge-and-awareness-archives-of-pharmacy-practice-2023",
  "title": "Attention-Deficit and Hyperactivity Disorder (ADHD) Symptoms in Saudi Children: Parental Knowledge and Awareness - Archives of Pharmacy Practice",
  "abstract": "Attention deficit/hyperactivity disorder (ADHD) is the most common mental health condition in children, affecting social interaction and self-esteem. ADHD is characterized by symptoms such as inattention, hyperactive-impulsive behavior, or both. There is limited research on parental knowledge and awareness of ADHD in Saudi Arabia. Understanding parental knowledge is crucial for effective parenting and treatment compliance. We are aiming to assess parental knowledge and awareness regarding ADHD symptoms. This cross-sectional study utilizes a structured questionnaire developed by the authors. The study includes Saudi parents who have at least one child diagnosed with ADHD and are actively involved in raising their children. Parents of children with intellectual disabilities and those residing outside Saudi Arabia are excluded. The study included 327 participants, the majority of respondents fall within the 21-30 and 31-40 age, comprising 37.0% and 29.1% of the sample. Females constitute a significant majority at 80.7% compared to males at 19.3%. The majority of the population, comprising 52.9%, belongs to the \"Moderate knowledge level\" category, followed by 30.9% to the \"Good knowledge level\" category, and 16.2% low knowledge level. Age, gender, and occupation were the only parameters to have a significant association with knowledge scores, 0.002, 0.012, and 0.005 respectively. In conclusion, ADHD is a prevalent disorder among children in Saudi Arabia, and parents need to be aware of the symptoms and seek proper diagnosis and treatment. Our study findings showed that participants exhibited sufficient knowledge scores compared to other studies held in Saudi Arabia.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "Attention deficit-hyperactivity disorder",
    "Parents",
    "Knowledge",
    "Saudi Arabia",
    "awareness"
  ],
  "publication": {
    "year": 2023
  },
  "journal": {
    "name": "Archives of Pharmacy Practice",
    "abbreviation": "Arch Pharm Pract",
    "volume": "14",
    "issue": "1",
    "pages": {
      "start": "6231523"
    }
  },
  "access": {
    "status": "open",
    "license": "CC BY-NC-SA 4.0",
    "localPdfUrl": "library/attention-deficit-and-hyperactivity-disorder-adhd-symptoms-in-saudi-children-parental-knowledge-and-awareness-archives-of-pharmacy-practice-2023-8829ca6437.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
