{
  "id": "legacy-f8f1f4a6f7",
  "slug": "awareness-and-knowledge-of-attention-deficit-hyperactivity-disorder-among-the-population-of-hail-saudi-arabia-2020",
  "title": "Awareness and Knowledge of Attention Deficit Hyperactivity Disorder among the Population of Hail, Saudi Arabia",
  "abstract": "<strong>Background:</strong> The prevalence of attention deficit hyperactivity disorder in Saudi Arabian children aged 6–12 years is approximately 4–12%. The current study assessed beliefs and awareness regarding ADHD among Hail population.\n\n<strong>Methods:</strong> This cross-sectional study was conducted in Hail region, via online questionnaire for 422 participants aged 15 years or greater and residing in Hail.\n\n<strong>Results:</strong> 94.1% had heard of ADHD, 5.9% had not. Of the former, 20.1% obtained their information from previous experience with a patient, 19.9% knew about the disorder through a medical website, 13.1% from books and journals, 37.0% through social media, and 9.9% did not mention the source. 54.3% believed ADHD to be a mixed disorder, that has behavioral, neurological, and psychiatric aspects while 26.8% believed it to be a behavioral disorder, 6.6% with neurological, 6.4% considered it a psychiatric disorder and 5.9% of respondents didn’t know. Regarding the cause, 11.4% believed it is genetic, 5.5% attributed the causes to nutritional habits, 5.6% attributed causes to food preservatives, 0.2 % believed it's caused by smoking, and 77.3%thought it's a multi-cause disorder.\n\n<strong>Conclusion:</strong> This study reveals that the level of knowledge appears to be good among the population of Hail compered to Madina region.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "ADHD",
    "awareness",
    "saudi arabia"
  ],
  "publication": {
    "year": 2020
  },
  "journal": {
    "name": "Saudi Medical Journal for Students",
    "abbreviation": "Saudi Med J Students",
    "volume": "1",
    "issue": "1",
    "pages": {
      "start": "69",
      "end": "79"
    }
  },
  "access": {
    "status": "open",
    "license": "Unknown",
    "researchGateUrl": "https://www.researchgate.net/publication/340862428_AWARENESS_AND_KNOWLEDGE_OF_ATTENTION_DEFICIT_HYPERACTIVITY_DISORDER_AMONG_THE_POPULATION_OF_HAIL_SAUDI_ARABIA"
  },
  "visibility": {
    "hidden": false
  }
}
