{
  "id": "legacy-b144566913",
  "slug": "behavioral-problems-associated-with-attention-deficithyperactivity-disorder-among-students-as-perceived-by-elementary-school-teachers-in-riyadh-arabic-2015",
  "title": "Behavioral Problems Associated with Attention Deficit/Hyperactivity Disorder Among Students As Perceived by Elementary School Teachers in Riyadh [Arabic]",
  "abstract": "This study was aimed at measuring the differences of elementary school teachers\" perceptions of behavioral problems that appear in pupils with attention deficit hyperactivity disorder (ADHD). The study focused on measuring any statistically significance differences of some variables and their relationship to the extent of realization of teachers. These variables included gender, level of education, years of experience, teacher's current position, previous experience in teaching pupils with ADHD, and training. This research applied the descriptive approach, using a questionnaire. The study sample included 304 male elementary school teachers and 301 female elementary school teachers. The study found several results; no statistically significant differences at the 0.05 level or less regarding teachers\" perceptions of behavioral problems in pupils with ADHD and level of education. The study also showed statistically significant differences between the perceptions of teachers and gender, years of experience, teacher's current position, previous experience in teaching pupils with ADHD, and training. [Full study is in Arabic]",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "behavior",
    "elementary school",
    "featured",
    "riyadh",
    "school",
    "study",
    "awareness"
  ],
  "publication": {
    "year": 2015
  },
  "journal": {
    "name": "Journal of Educational Sciences",
    "abbreviation": "JES",
    "volume": "27",
    "issue": "3",
    "pages": {
      "start": "405",
      "end": "427"
    }
  },
  "access": {
    "status": "open",
    "license": "Unknown",
    "localPdfUrl": "library/behavioral-problems-associated-with-attention-deficithyperactivity-disorder-among-students-as-perceived-by-elementary-school-teachers-in-riy-2015-2386e87051.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
