{
  "id": "legacy-7f94fc30a9",
  "slug": "challenging-gifted-children-and-the-phenomenon-of-adhd-a-qualitative-study-of-teachers-and-parents-perceptions-in-a-saudi-arabian-primary-school-2010",
  "title": "Challenging Gifted Children and the Phenomenon of AD/HD: A Qualitative Study of Teachers’ and Parents’ Perceptions in a Saudi Arabian Primary School",
  "abstract": "This study overviews the circumstances surrounding gifted children who manifest challenging behaviours at school, and where the explanatory use of the diagnostic descriptor, AD/HD, is invoked. Specifically, this qualitative research study in Saudi Arabia investigated the phenomenological and diagnostic confusion between giftedness and AD/HD. Three mainstream regular classroom teachers, one specialist teacher of gifted children, and the parents of three gifted children were interviewed. All participants’ perceptions focused on the behavioural dimensions of teacher-nominated gifted children at school and at home. In general, the results indicate that diagnostic confusions between giftedness and AD/HD were manifest, and teachers’ and parents’ perspectives differed. Some unanticipated and interesting data also emerged from the research. In discussion of the results, a number of themes relating to the misidentification of gifted children are discussed. Some educational implications for future research directions are offered.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "featured",
    "gifted",
    "jeddah",
    "study",
    "awareness"
  ],
  "publication": {
    "year": 2010
  },
  "journal": {
    "name": "Australasian Journal of Gifted Education",
    "abbreviation": "Australasian Journal of Gifted Education",
    "volume": "19",
    "issue": "1",
    "pages": {
      "start": "6",
      "end": "15"
    }
  },
  "access": {
    "status": "unknown",
    "source": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/G-Education-2010-Alamiri.pdf",
    "sourceUrl": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/G-Education-2010-Alamiri.pdf",
    "localPdfUrl": "library/challenging-gifted-children-and-the-phenomenon-of-adhd-a-qualitative-study-of-teachers-and-parents-perceptions-in-a-saudi-arabian-primary-sc-2010-9fddf0b28d.pdf"
  },
  "identifiers": {
    "url": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/G-Education-2010-Alamiri.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
