{
  "id": "legacy-3a3325c748",
  "slug": "effect-of-omega-3-fatty-acid-supplementation-on-some-of-the-physiological-changes-in-boys-with-moderate-adhd-symptoms-2018",
  "title": "Effect of Omega-3 Fatty Acid Supplementation on Some of the Physiological Changes in Boys with Moderate ADHD Symptoms",
  "abstract": "Attention deficit hyperactivity disorder (ADHD) may persist into adolescence and adulthood. It is suggested that insufficient nutritional supply of LC-PUFAs (long-chain polyunsaturated fatty acids) and minerals (including serum levels of zinc, iron, magnesium, calcium and copper) may develop ADHD symptoms. However, clear and convincing evidence is lacking. Subjects in the present report were boys with moderate ADHD symptoms who were categorized into control group (C; mean age: 8.34 years), ADHD group (mean age: 8.72 years), and ADHD-O group (or ADHD- supplemented with omega-3 fatty acids (mean age: 8.69 years). Significant reduction in serum zinc, iron, magnesium and calcium in ADHD group without omega-3 supplementation compared to healthy control subjects, and significant increase in these nutrient bioelements after omega-3 supplementation in ADHD reaching to the levels found in healthy non-ADHD control subjects were the findings in our present study. Although the definite cause/ causes of ADHD are not yet known, omega-3 and other long-chain polyunsaturated fatty acids (LCPUFA) seem promising in understanding the pathophysiology and exploring additional management of ADHD.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "boys",
    "omega-3",
    "serum nutrient bioelements",
    "symptoms"
  ],
  "publication": {
    "year": 2018
  },
  "journal": {
    "name": "International Journal of Biology and Biotechnology",
    "abbreviation": "Int. J. Biol. Biotech",
    "volume": "15",
    "issue": "1",
    "pages": {
      "start": "13",
      "end": "17"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/effect-of-omega-3-fatty-acid-supplementation-on-some-of-the-physiological-changes-in-boys-with-moderate-adhd-symptoms-2018-8e17cdd737.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
