{
  "id": "legacy-9b0fefa772",
  "slug": "effectiveness-of-health-educational-program-on-parents-coping-strategies-and-their-children-with-attention-deficit-hyperactivity-disorder-2013",
  "title": "Effectiveness of Health Educational Program on Parents’ Coping Strategies and their Children with Attention Deficit Hyperactivity Disorder",
  "abstract": "Attention Deficit Hyperactivity Disorder (ADHD) is considered the most common psychiatric disorder that. (ADHD) is a developmental condition that involves problems with inattention and hyperactivity- impulsivity inconsistent with the age of the child. The affected child often has difficulty learning, giving rise to special educational needs that, combined with poor peer and family relationship, can lead to lack of self-esteem. Because the nature of illness is unknown, parents are usually not aware of how the illness will be managed. So the present study aimed to identify the effectiveness of health educational program on parents' coping strategies and their children with Attention Deficit Hyperactivity Disorder. A quasi-experimental design was utilized in this study. The study has been carried out in the Psychiatric Out-patient Clinic in Al-Amal Complex for Mental Health in Dammam. A total sample of (30) parents and their children with ADHD has been selected. Pre-post assessment were carried out using the following tools: Socio demographic data sheet for both: parents and children. Knowledge assessment was measured by Psychosocial Problems of Parents Scale. developed by Pruyn, 1983 . The last one is The Parental Coping Strategy Inventory (PCSI)Yeh. The result of the current study revealed a statistically significant difference in level of parents knowledge and coping strategies between pre-post assessment. Therefore, researchers recommended the necessity to increase the awareness of illness by health care professionals through counseling, family therapy, free work shops for parents because they really in need.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "health education",
    "study",
    "awareness"
  ],
  "publication": {
    "year": 2013
  },
  "journal": {
    "name": "Journal of Novel Applied Sciences",
    "abbreviation": "J Nov. Appl Sci",
    "volume": "2",
    "issue": "10",
    "pages": {
      "start": "461",
      "end": "472"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/effectiveness-of-health-educational-program-on-parents-coping-strategies-and-their-children-with-attention-deficit-hyperactivity-disorder-2013-22f2efe825.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
