{
  "id": "legacy-d3d12e34cf",
  "slug": "emotional-and-behavioral-problems-among-male-saudi-schoolchildren-and-adolescents-prevalence-and-risk-factors-2004",
  "title": "Emotional and Behavioral Problems Among Male Saudi Schoolchildren and Adolescents: Prevalence and Risk Factors",
  "abstract": "<strong>Background:</strong> Young people can have mental, emotional, and behavioral problems that are real, painful, and costly. Objectives: determination of the prevalence rate of emotional and/or behavioral problems among male Saudi school- children and identifying their possible risk factors. <strong>Method:</strong> All male schoolchildren of Al-Abnae schools specialized for the sons of the employees of the Saudi Ministry of Defense (military and civilians) in Taif Governorate, Saudi Arabia were included. This study was conducted through two phases: A screening phase for all schoolchildren and adolescents included in the study through a cross sectional approach to assess their emotional and behavioral problems. A case-control phase to study risk factors. The screening phase was conducted using the Child Behavior Checklist ’Parents\" form\". <strong>Results:</strong> Among 1313 participated in the study, 109 (8.3%) were emotionally and/or behaviorally disturbed students (according to cut-off score for boys estimated at the 90th percentiles). Among studied socio-demographic variables, educational level (intermediate versus primary) and mother occupation (working versus non-working) were associated with a higher risk higher risk of developing emotional and/or behavioral disturbance. Unwanted pregnancy (OR=4.77, CI: 3.68-5.86), history of meningitis (OR=7.50, CI: 5.12-9.88), accidents (OR=4.07, CI: 2.87-5.26) and bronchial asthma (OR=2.96, CI: 2.16-3.76) had an increased risk of emotional and/or behavioral disturbance.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "Taif",
    "behavior",
    "boys",
    "emotion",
    "featured",
    "school",
    "study",
    "prevalence",
    "risk factors"
  ],
  "publication": {
    "year": 2004
  },
  "journal": {
    "name": "German Journal of Psychiatry",
    "abbreviation": "GIPSY",
    "volume": "7",
    "issue": "2",
    "pages": {
      "start": "1",
      "end": "9"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/emotional-and-behavioral-problems-among-male-saudi-schoolchildren-and-adolescents-prevalence-and-risk-factors-2004-0acdb44c21.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
