{
  "id": "legacy-23de0f6948",
  "slug": "enhancement-the-awareness-of-family-care-givers-caring-their-children-with-attention-deficit-hyperactivity-disorder-of-the-general-administration-of-intellectual-education-centers-in-the-city-of-abha-2013",
  "title": "Enhancement the Awareness of Family Care givers Caring their Children With Attention Deficit Hyperactivity Disorder of the General Administration of Intellectual Education Centers in the city of Abha",
  "abstract": "ADHD is the most common neurobehavioral disorder that affects large number of children world-wide. It characterized by three main symptoms; inattentiveness, hyperactivity and impulsivity. Caring of children with ADHD can be challenging for the whole family, Parents may be hurt by their children's behavior as well as by the way other people respond to it. The purpose of this study was to enhance the awareness of parent caregivers about caring of their ADHD children's through the Implementation of the research Program, quasi-experimental design was selected for this study. Subjects were consists of (30) mothers caregivers of ADHD children's. The study was conducted in the General Administration of Intellectual Education Centers in the city of Abha. Data were collected by using two tools, the first was an interview questionnaire used to assess the family care givers Knowledge, attitude & practice toward their ADHD children behaviors in daily living activities, and the second was concerned with Attention deficit hyperactivity disorders scale. The results denoted that there was highly statistical significant relation between pre and post program implementation regarding family caregivers positive attitude and practice. So the study recommended that further studies should be done on large group of family caregivers to improve the parenting skills in managing their ADHD children behaviors.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "abha",
    "featured",
    "parents",
    "school",
    "study",
    "awareness"
  ],
  "publication": {
    "year": 2013
  },
  "journal": {
    "name": "Journal of American Science",
    "abbreviation": "J Amer Sci",
    "volume": "9",
    "issue": "8",
    "pages": {
      "start": "46",
      "end": "53"
    }
  },
  "access": {
    "status": "unknown",
    "source": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/J-Amer-Sci-2013-Zaki.pdf",
    "sourceUrl": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/J-Amer-Sci-2013-Zaki.pdf",
    "localPdfUrl": "library/enhancement-the-awareness-of-family-care-givers-caring-their-children-with-attention-deficit-hyperactivity-disorder-of-the-general-administr-2013-4de38a1136.pdf"
  },
  "identifiers": {
    "url": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/J-Amer-Sci-2013-Zaki.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
