{
  "id": "legacy-2ca4ba4f7d",
  "slug": "how-teachers-knowledge-of-attention-deficit-hyperactivity-disorder-makes-difference-in-doctors-diagnostic-decisions-and-management-2015",
  "title": "How teachers’ knowledge of attention deficit hyperactivity disorder makes difference in doctors’ diagnostic decisions and management?",
  "abstract": "Objective: The teacher's knowledge plays a key role in the process of assessing, screening, and diagnosing attention deficit hyperactivity disorder. This was a cross-sectional study aimed at surveying teachers' knowledge about attention-deficit hyperactivity disorder, one of the most prevailing neurodevelopmental disorders. Materials and Methods: One hundred and thirteen female elementary school teachers were randomly chosen from six regular female public and private schools in Al-Khobar in the Eastern Province of Saudi Arabia. They completed a self-reported questionnaire on their general \"factual\" knowledge of the nature of attention-deficit hyperactivity disorder, and the management \"action knowledge\" of the condition. Factors which might affect their knowledge were also examined. Results: About 48.7% of the total sample had adequate factual knowledge, but only 27 (23.9%) showed adequate action knowledge about how to deal with attention-deficit hyperactivity disorder. Teachers' knowledge of attention-deficit hyperactivity disorder (factual and action) was not significantly correlated with their years of experience, level of education (qualification) and duration of training in educational methodology. Conclusion: It was concluded that teachers in female primary schools had inadequate knowledge about attention-deficit hyperactivity disorder. Implications and recommendation for health and educational professional are outlined.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "study",
    "awareness"
  ],
  "publication": {
    "year": 2015
  },
  "journal": {
    "name": "Saudi Journal of Medicine and Medical Sciences",
    "abbreviation": "Saudi J Med Med Sci",
    "volume": "3",
    "issue": "2",
    "pages": {
      "start": "151"
    }
  },
  "access": {
    "status": "unknown",
    "source": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/SaudiJMedMedSci32151-1190371_031823.pdf",
    "sourceUrl": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/SaudiJMedMedSci32151-1190371_031823.pdf",
    "localPdfUrl": "library/how-teachers-knowledge-of-attention-deficit-hyperactivity-disorder-makes-difference-in-doctors-diagnostic-decisions-and-management-2015-06f4fdf9eb.pdf"
  },
  "identifiers": {
    "url": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/SaudiJMedMedSci32151-1190371_031823.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
