{
  "id": "legacy-571b6073e3",
  "slug": "implementation-of-peer-tutoring-strategies-in-teaching-students-with-adhd-teachers-attitudes-in-saudi-education-2016",
  "title": "Implementation of Peer Tutoring Strategies in Teaching Students with ADHD: Teachers' Attitudes in Saudi Education",
  "abstract": "This study aimed to measured teachers\" attitudes toward implementation of peer tutoring strategies in teaching students with ADHD in Saudi Arabia. The study moreover examined the relationship between teachers\" attitudes of implementation of peer tutoring strategies and variables of demographic characteristics. Five hundred thirty eight teachers employed at public schools in Riyadh City responded to a survey questionnaire. The results of the study showed teachers realized the benefits of implementing a peer tutoring strategy, they considered there to be a lack in implementing this strategy, they were unsure of the barriers faced by teachers, and they supposed there to be teachers\" needs. The study found significant differences in teachers\" attitudes regarding teachers\" gender, teaching position in schools, and previous teaching experience. No significant differences were found in the school level of teaching. Implications are discussed.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "attitudes",
    "peer tutoring",
    "riyadh"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "Journal of Education and Practice",
    "abbreviation": "JEP",
    "volume": "7",
    "issue": "30",
    "pages": {
      "start": "52",
      "end": "59"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/implementation-of-peer-tutoring-strategies-in-teaching-students-with-adhd-teachers-and-rsquo-attitudes-in-saudi-education-2016-290f9811db.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Abdulrahman Abdullah",
      "family": "Abaoud",
      "orcid": "https://orcid.org/0000-0001-5719-6591",
      "sequence": 1
    }
  ]
}
