{
  "id": "legacy-7657c978f9",
  "slug": "involving-children-with-adhd-and-their-parents-in-research-in-saudi-arabia-2014",
  "title": "Involving Children with ADHD and Their Parents in Research in Saudi Arabia",
  "abstract": "ADHD is the term that has been afforded to those children who seem to have problems in the areas of Attention and Hyperactivity. This paper offers a number of different considerations surrounding the formation and development of the socio-political context of studies in the Educational domain. This paper also centres on local, national, international, discursive and social; therefore, it is necessary for a researcher to ensure the awareness of all of these aspects when carrying out a study. The Saudi context, in this vein, is known to be concerned about the necessity to verify the background and foundation of ADHD in Saudi Arabia. It is recognized that, an overview in this arena would enable the readers to develop an understanding of the context in which the study is carried out. This research attempts to explain the importance and recommend the parents to be involved with children\"s ADHD (Attention Deficit Hyperactivity Disorder) in Saudi Arabia.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "children",
    "families",
    "research",
    "study"
  ],
  "publication": {
    "year": 2014
  },
  "journal": {
    "volume": "8",
    "issue": "2",
    "pages": {
      "start": "1",
      "end": "6"
    },
    "name": "i-manager’s Journal on Educational Psychology"
  },
  "access": {
    "status": "closed",
    "localPdfUrl": "library/involving-children-with-adhd-and-their-parents-in-research-in-saudi-arabia-2014-03db9a0409.pdf"
  },
  "identifiers": {
    "doi": "10.26634/jpsy.8.2.2899"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Mohaned G.",
      "family": "Abed",
      "orcid": "https://orcid.org/0000-0002-3425-4725",
      "sequence": 1
    }
  ],
  "doi": "10.26634/jpsy.8.2.2899",
  "language": "English"
}
