{
  "id": "legacy-72f6b41455",
  "slug": "knowledge-of-kindergarten-teachers-of-adhd-and-its-relationship-with-some-variables-arabic-2020",
  "title": "Knowledge of Kindergarten Teachers of ADHD and Its Relationship with Some Variables [Arabic]",
  "abstract": "The present study aims to uncover the knowledge of kindergarten teachers about Attention Deficit Hyperactivity Disorder (ADHD) in children and the influence of educational level, years of experience, and specialization on their level of knowledge. The study's sample consists of (128) female teachers. To achieve the objectives of the study, the researchers uses the Knowledge of Attention Deficit Disorder Scale (KADDS) (Sciutto, Terjesen & Frank, 2000) and the descriptive survey method for data collection. Findings of this empirical study reflect that the level of knowledge of kindergarten teachers of ADHD is somewhat low. Interestingly, results also display no statistically significant differences in the level of knowledge of kindergarten teachers of ADHD in terms of the total degree of knowledge of the disorder according to the educational level variable. Moreover, participants of this study show no statistically differences in their specialization regarding the general information about the nature and causes of the disorder and the diagnosis process according to the variable of specialization. In addition, no statistically significant differences found in the level of knowledge of kindergarten teachers according to the variable of years of experience. Therefore, the study recommends providing pre and in-service training programs related to raising the level of awareness and cognitive competence of ADHD disorder of kindergarten teachers.\n\n \n\n<strong>معرفة معلمات مرحلة رياض الأطفال باضطراب فرط الحركة وتشتت الانتباه عند الأطفال وعلاقته ببعض المتغيرات</strong>\n\nهدفت الدراسة الحالية إلى الكشف عن مستوى معرفة معلمات مرحلة رياض الأطفال باضطراب فرط الحركة وتشتت الانتباه عند الأطفال، وأثر المستوى التعليمي وسنوات الخبرة والتخصص على مستوى المعرفة لديهن، تكونت عينة الدراسة من (128) معلمة، ولتحقيق أهداف الدراسة استخدم الباحثان مقياس المعرفة باضطراب فرط الحركة وتشتت الانتباه The Knowledge of Attention Deficit Disorder Scale (KADDS) Sciutto, Terjesen & Frank,2000)) والمنهج الوصفي المسحي لجمع البيانات، وأظهرت نتائج الدراسة أن مستوى معرفة معلمات مرحلة رياض الأطفال باضطراب فرط الحركة وتشتت الانتباه عند الأطفال منخفض إلى حد ما، كما أظهرت النتائج عدم وجود فروق دالة إحصائياً في مستوى معرفة معلمات مرحلة رياض الأطفال باضطراب فرط الحركة وتشتت الانتباه فيما يتعلق بالدرجة الكلية للمعرفة بالاضطراب وفقاً لمتغير المستوى التعليمي، كما توصلت النتائج إلى عدم وجود فروق دالة إحصائياً في مستوى معرفة معلمات مرحلة رياض الأطفال باضطراب فرط الحركة وتشتت الانتباه وفقاً لمتغير التخصص، فيما يتعلق بالأبعاد التالية: معلومات عامة عن طبيعة وأسباب الاضطراب؛ وعلاج الاضطراب، بينما وجدت فروق ذات دلالة إحصائية في مستوى معرفة معلمات مرحلة رياض الأطفال بأعراض الاضطراب وعملية التشخيص تبعاً لمتغير التخصص، كما أشارت النتائج إلى عدم وجود فروق ذات دلالة إحصائية في مستوى المعرفة لدى معلمات مرحلة رياض الأطفال وفقاً لمتغير سنوات الخبرة.\n\nSource Link: <a href=\"https://jeps.qu.edu.sa/index.php/jep/%20article/view/2400\" target=\"_blank\" rel=\"noopener\">JEPS.QU.edu.sa</a>",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "knowledge",
    "ADHD",
    "kindergarten teachers",
    "awareness"
  ],
  "publication": {
    "year": 2020
  },
  "journal": {
    "name": "Journal of Educational and Psychological Sciences (Qassim University)",
    "abbreviation": "Journal of Educational and Psychological Sciences",
    "volume": "13",
    "issue": "4",
    "pages": {
      "start": "1702",
      "end": "1727"
    }
  },
  "access": {
    "status": "open",
    "license": "Unknown",
    "researchGateUrl": "https://www.researchgate.net/publication/365778420_mrft_mlmat_mrhlt_ryad_alatfal_badtrab_frt_alhrkt_wtshtt_alantbah_nd_alatfal_wlaqth_bbd_almtghyrat",
    "localPdfUrl": "library/knowledge-of-kindergarten-teachers-of-adhd-and-its-relationship-with-some-variables-arabic-2020-216b6eab20.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
