{
  "id": "legacy-9b1451b604",
  "slug": "legislative-rules-for-students-with-disabilities-in-the-united-states-and-saudi-arabia-a-comparative-study-2013",
  "title": "Legislative Rules for Students with Disabilities in the United States and Saudi Arabia: A Comparative Study",
  "abstract": "This study provides a brief overview in regard to the successful policy that guarantees the right of students with disabilities to obtain a free appropriate public education, such as the Individuals with Disabilities Education Act (IDEA). The paper also presents a general background of the Saudi legislation in terms of the major elements of this legislation and its similarities with and differences from the IDEA. Additionally, this paper investigates the problems in implementing the Regulations of Special Education Programs and Institutes (RSEPI) and the reasons behind these issues. Furthermore, the researcher develops a set of regulations that address the elements of problems in the implementation of the RSEPI. This paper also identifies some ways that might be considered by the policy makers, media, educators, and professional organizations that assist in informing the teachers (special and regular), administrators, related service personnel and families of children with disabilities about these regulations. Finally, the researcher modifies and suggests a system of accountability that assists the schools and school districts with complying with the regulations of the RSEPI.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "children",
    "disability",
    "learning disorder",
    "legislation",
    "policy",
    "rights",
    "school",
    "study"
  ],
  "publication": {
    "year": 2013
  },
  "journal": {
    "name": "International Interdisciplinary Journal of Education",
    "abbreviation": "IIJE",
    "volume": "2",
    "issue": "6",
    "pages": {
      "start": "601",
      "end": "614"
    }
  },
  "access": {
    "status": "closed",
    "localPdfUrl": "library/legislative-rules-for-students-with-disabilities-in-the-united-states-and-saudi-arabia-a-comparative-study-2013-253847f62f.pdf"
  },
  "identifiers": {
    "doi": "10.12816/0002942"
  },
  "visibility": {
    "hidden": false
  },
  "authors": [
    {
      "given": "Turki",
      "family": "Alquraini",
      "orcid": "https://orcid.org/0000-0002-8148-2106",
      "sequence": 1
    }
  ],
  "doi": "10.12816/0002942",
  "language": "English"
}
