{
  "id": "legacy-bb540cd20e",
  "slug": "medical-and-psychiatric-comorbidity-in-the-patients-with-intellectual-disability-in-a-rehabilitation-setting-kingdom-of-saudi-arabia-2022",
  "title": "Medical and psychiatric comorbidity in the patients with intellectual disability in a rehabilitation setting, Kingdom of Saudi Arabia",
  "abstract": "<strong>Introduction</strong>: Intellectual disability (ID) is a prevalent neurodevelopmental issue globally. People having ID suffer invariably from psychiatric, behavioral, and emotional disturbances. It is reported that a high rate of comorbidity predisposes the patients to a poorer prognosis and quality of life especially if undiagnosed and untreated. We specifically aimed to study the comorbid physical and psychiatric disorders in this vulnerable population group and to find any association with various related variables.\n\n<strong>Material</strong>: The observational cross-sectional study was conducted on male and female patients admitted with disabilities in Rehabilitation Centre Majmaah. The data was entered and analyzed using IBM SPSS 26.0.\n\n<strong>Results</strong>: The number of participants (n) was 147. The mean age of the patients was 24.32+2.19 years. Out of all patients, 17 (11.6%) had mild, 33 (22.4%) had moderate, 56 (38.1 %) had severe and 41 (27.9%) had profound ID. About 72% of the sample (n=42) had comorbidity with either a medical or a psychiatric illness whereas 12 participants (8.17%) suffered from both physical and psychiatric disorders. In this study, n= 30/147 (20.40%) had psychiatric comorbidity. There was a preponderance of ADHD (attention deficit hyperactivity disorder) and Behavioural Disorders. Around 87 patients out of 147 (59.2%) had one or more physical comorbidities. The most common medical comorbidities were Epilepsy (26.53%). Overall, significant association was found between severity of and psychiatric diseases (p=0.023).\n\n<strong>Conclusion</strong>: Physical and psychiatric comorbidities are common in ID patients. ADHD, Behavioural Disorders and Epilepsy were predominant in the research.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "Physical comorbidity",
    "psychiatric comorbidity",
    "intellectually disabled",
    "rehabilitation",
    "prevalence"
  ],
  "publication": {
    "year": 2022
  },
  "journal": {
    "name": "Academic Journal of Health Sciences",
    "abbreviation": "Academic Journal of Health Sciences",
    "volume": "37",
    "issue": "3",
    "pages": {
      "start": "113",
      "end": "119"
    }
  },
  "access": {
    "status": "closed",
    "researchGateUrl": "https://www.researchgate.net/profile/Angel-Lopez-Gonzalez/publication/360067910_AJHS_373_May-Jun/links/626001108cb84a40ac7c5ab4/AJHS-373-May-Jun.pdf#page=113"
  },
  "visibility": {
    "hidden": false
  },
  "language": "English"
}
