{
  "id": "legacy-032fa16c20",
  "slug": "prevalence-of-attention-deficit-and-hyperactivity-disorder-adhd-in-children-attending-paediatric-endocrine-clinic-at-king-khalid-university-hospital-riyadh-saudi-arabia-2019",
  "title": "Prevalence of Attention Deficit and Hyperactivity Disorder (ADHD) in Children Attending Paediatric Endocrine Clinic at King Khalid University Hospital, Riyadh, Saudi Arabia",
  "abstract": "Background: Attention-deficit/hyperactivity disorder (ADHD) is a chronic neurobehavioral disorder with a substantial lifelong impact on the health system in general. It is one of the most frequent childhood-onset psychiatric conditions, with an estimated worldwide-pooled prevalence exceeding 5% in school-age children, and a prevalence of 1.3-16% in Arab countries. We hypothesized that pediatric endocrine clinics are one of the potential places of ADHD. Thus present study aims to investigate the prevalence of ADHD in children attending pediatric endocrine clinic, determine which gender group is affected more, and address the possible associated factors of ADHD. Method: A quantitative, observational cross-sectional approach was used to estimate the prevalence of ADHD. The study population was children attending pediatric endocrine clinic at KKUH in Riyadh, Saudi Arabia, approached during their regular visit in the clinic from November2015 to March2016, and interviewed to fill a questionnaire includes social demographic questions, medical profile, and a valid screening tool for ADHD. Results: Analysis revealed that the prevalence of ADHD in the study sample was 14.9% (46 cases out of 309 children). 67.39% of these cases were males (31 male case out of 309 children). Results provided evidence that ADHD was associated with low social economic status (SES), and other social demographic characteristics. There was no evidence to suggest any association between ADHD and obesity, thyroid dysfunction, and growth deficit. Conclusion: ADHD occurs in males more than females. It has a high prevalence in children with different endocrine pathologies although there was no relation between (growth deficit, thyroid dysfunctions, and Obesity) and ADHD, except diabetes where diabetic child was found to be less likely to develop ADHD. Anyhow, further studies with bigger sample size will help understanding this link.",
  "categories": [
    "Prevalence"
  ],
  "keywords": [
    "Attention Deficit",
    "ADHD",
    "Child",
    "Endocrine",
    "Hyperactivity",
    "Neurobehavioral",
    "Saudi Arabia",
    "Prevalence"
  ],
  "publication": {
    "year": 2019
  },
  "journal": {
    "name": "Indo American Journal of Pharmaceutical Sciences",
    "abbreviation": "Indo Am. J. P. Sci.",
    "volume": "6",
    "issue": "2",
    "pages": {
      "start": "1",
      "end": "7"
    }
  },
  "access": {
    "status": "unknown"
  },
  "visibility": {
    "hidden": false
  }
}
