{
  "id": "legacy-20b3c46f55",
  "slug": "saudi-arabian-teachers-knowledge-and-beliefs-about-adhd-2014",
  "title": "Saudi Arabian Teachers’ Knowledge and Beliefs about ADHD",
  "abstract": "Attention Deficit Hyperactivity Disorder (ADHD) is considered one of the most frequently diagnosed psychiatric childhood disorders. It affects 3-7% of school-aged children, interfering with their academic performance and social interactions. This study explored the knowledge and beliefs of teachers in Saudi Arabia about children with ADHD. The Knowledge about Attention Deficit Disorder Questionnaire (KADD-Q) was administered to a sample of teachers, followed by interviews with a subset of the total respondents. The results indicated that the teachers knew more about the characteristics of ADHD than they knew about its related causes and treatment. Overall, the findings indicated that these teachers had some knowledge about general characteristics of ADHD, but they had little understanding of causes and possible interventions. These results suggest an important need for more formal teacher training regarding all aspects of ADHD in school-age children.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "awareness",
    "featured",
    "jeddah",
    "study",
    "teacher"
  ],
  "publication": {
    "year": 2014
  },
  "journal": {
    "name": "Journal of the International Association of Special Education",
    "abbreviation": "JIASE",
    "volume": "15",
    "issue": "1",
    "pages": {
      "start": "67",
      "end": "74"
    }
  },
  "access": {
    "status": "unknown",
    "source": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Saudi-Arabian-Teachers-Knowledge-and-Beliefs-about-ADHD-Abed-M.-2014.pdf",
    "sourceUrl": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Saudi-Arabian-Teachers-Knowledge-and-Beliefs-about-ADHD-Abed-M.-2014.pdf",
    "localPdfUrl": "library/saudi-arabian-teachers-knowledge-and-beliefs-about-adhd-2014-8dbf146157.pdf"
  },
  "identifiers": {
    "url": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Saudi-Arabian-Teachers-Knowledge-and-Beliefs-about-ADHD-Abed-M.-2014.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
