{
  "id": "legacy-9de67bd5b0",
  "slug": "saudi-children-with-attention-deficit-hyperactivity-disorder-adhd-and-their-assessment-of-teachers-knowledge-2022",
  "title": "Saudi children with attention deficit hyperactivity disorder (ADHD) and their assessment of teachers' knowledge",
  "abstract": "<p>Aims: Attention deficit hyperactivity disorder (ADHD) is really a medical condition that effect on children and adults. To identify the teachers' knowledge and attitude regarding ADHD is vital for this progression of psycho-academic and exercising methods for teachers. The present cross-sectional study was conducted among male school teachers to know the knowledge and awareness of ADHD. Methods: A Structured questionnaire was distributed among 120 school teachers. The questionnaire component consists of 7 multiple-choice questions regarding the symptoms of ADHD, 5 queries regarding the etiology of the issue, 5 questions regarding the therapy, and 6 queries concerning the outcomes of ADHD. Data was collected and statistical analysis done. Results: Their mean age was 38.38 ± 5.77 years, ranging from 25 to 58 years, with a mean level of teaching experience of 12.63 ± 4.11 years. The teachers' understanding was more specific regarding the symptoms of ADHD (73%), accompanied by their consequence's knowledge of ADHD (64.9%). A mean of 61.1% and 56.8% of teachers offered appropriate answers concerning the etiology and therapy for the problem, respectively. Conclusion: Concluded that teachers got satisfactory knowledge of ADHD and suggested they should improve even more knowledge on its causes, symptoms, and treatment to boost the educational functionality of students.</p>",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "ADHD",
    "Special Education Needs (SEN)",
    "Knowledge",
    "Questionnaire",
    "Teachers",
    "Children",
    "Saudi Arabia",
    "Awareness"
  ],
  "publication": {
    "year": 2022
  },
  "journal": {
    "name": "Journal of Research in Medical and Dental Science",
    "abbreviation": "J Res Med Dent Sci",
    "issn": "2347-2367",
    "volume": "10",
    "issue": "10",
    "pages": {
      "start": "37",
      "end": "43"
    }
  },
  "access": {
    "status": "open",
    "license": "CC BY-NC 4.0",
    "source": "https://www.jrmds.in/articles/saudi-children-with-attention-deficit-hyperactivity-disorder-adhd-and-their-assessment-of-teachers-knowledge-95098.html",
    "sourceUrl": "https://www.jrmds.in/articles/saudi-children-with-attention-deficit-hyperactivity-disorder-adhd-and-their-assessment-of-teachers-knowledge-95098.html",
    "licenseUrl": "https://www.jrmds.in/editorial-policies.html#openAccessPolicy"
  },
  "identifiers": {
    "url": "https://www.jrmds.in/articles/saudi-children-with-attention-deficit-hyperactivity-disorder-adhd-and-their-assessment-of-teachers-knowledge-95098.html"
  },
  "visibility": {
    "hidden": false
  },
  "language": "English"
}
