{
  "id": "legacy-365526532b",
  "slug": "sensation-seeking-and-delinquency-among-saudi-adolescents-2011",
  "title": "Sensation Seeking and Delinquency among Saudi Adolescents",
  "abstract": "Juvenile delinquents in Saudi Arabia pores a serious social issue in today's society. The most frequent types of offences reported in Saudi\"s juvenile offences statistics are theft offences followed by assault offences, traffic violations, drugs offences and property damage or vandalism.The primary purpose of the present paper was to understand the relationship between sensation seeking and the most common offences (Theft, assault, traffic violations, substance use, and vandalism) among rural and urban male adolescents in Saudi Arabia. Moreover, the second purpose of the present paper was to explore delinquent adolescents\" perspectives for giving up their engagement in delinquency behaviours. Data was collected through quantitative and qualitative methods. Quantitative data was collected through the use of questionnaires and derived from a survey of 2168 high school students (16- 18 year old), 1676 adolescents were randomly recruited from urban areas, while 492 were randomly recruited from rural areas. Moreover, the interviews were presented to provide support for the quantitative results and further explanation for the purpose of this study. The qualitative findings are derived from conducting interviews with 24 delinquent adolescents who had engaged in delinquent activities as leisure by snowball sampling technique (urban= 16 adolescents, rural=8 adolescents). Sensation seeking differences emerged between the two geographical locations. The result revealed that urban adolescents significantly higher in Sensation seeking than rural adolescents. In terms of delinquency behaviours, results showed that there was no significant difference between urban and rural adolescents in total delinquency; however, the patterns of delinquency are not homogeneous across locations. Urban adolescents reported significantly higher rates of involvement in assault, traffic violations and vandalism offences. However, however, substance use was significantly higher in rural areas than urban areas. While, theft offences and arrests there were no significant differences between them. The result (based on quantitative and qualitative findings) revealed that adolescents committed delinquent activities not only as an escape-based coping strategy from boredom but because such activities have provided the delinquent adolescents with the desired sensation of arousal as they described.In light of study findings, participants keenly expressed a big desire to participate in recreation activities and extreme recreation activities in particular. However, there is a distinct lack of leisure and recreation facilities within both of the two geographical areas. Therefore, there is a need to provide adolescents with recreation facilities. Recreation activities especially extreme recreation activities should be offered for them to be a legal alternative source of arousal for high sensation seekers because exciting recreation activities sustain and fulfill their thirst for excitement and provide the sensation seekers with the desired sensation of arousal.",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "adolescents",
    "antisocial",
    "boys",
    "delinquency",
    "study",
    "teenagers"
  ],
  "publication": {
    "year": 2011
  },
  "journal": {
    "name": "European Journal of Social Sciences",
    "abbreviation": "EJSS",
    "volume": "21",
    "issue": "2",
    "pages": {
      "start": "265",
      "end": "286"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/sensation-seeking-and-delinquency-among-saudi-adolescents-2011-fef8f2b09e.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
