{
  "id": "legacy-f09df003c6",
  "slug": "study-regarding-the-level-of-awareness-and-understanding-about-adhd-among-teachers-when-dealing-with-adhd-students-2022",
  "title": "Study regarding the level of awareness and understanding about ADHD among teachers when dealing with ADHD students",
  "abstract": "<p>Attention deficit and hyperactivity disorder (ADHD) is one of the most common disorders, which describes students with learning and behavioral difficulties. It is a severe developmental disorder with inattention, impulsivity, and hyperactivity symptoms. Sometimes, teachers intend to refer ADHD students to mental health professionals to prevent these problems. The objective of this research is: 1) To investigate Saudi elementary and kindergarten teachers' understanding and knowledge of ADHD. 2)To demonstrate how the impact of teaching strategies increases awareness of ADHD and helps students with ADHD to improve their academic performance. 3)To recommend to the Ministry of Education in Jeddah to set up a general training program for learning disabilities for all teachers in Saudi Arabia. The study focused on K-6 female teachers; four schools were selected in this study. A mixed-methods design was used to evaluate teachers 'knowledge and understanding of ADHD. The researcher gathered data from the questionnaire and interviews. For the questionnaire, (N=15) teachers were selected for kindergarten and (N=15) for Elementary. (N=8) teachers were interviewed to discuss their beliefs and strategies for dealing with students with ADHD. The interview questions were about how teachers understand the situation of ADHD students. The qualitative and quantitative data were collected separately. The fifteen kindergarten teachers who participated in the questionnaire had an average number of 11.33 of knowledge about ADHD. The 15 Elementary teachers had an average number of 9.53%. In general, the findings showed that both Kindergarten and teachers had some knowledge about the general characteristics of ADHD, but they had little understanding of causes and interventions.</p>\n<p>In conclusion, Saudi teachers indicated that they had truly little training about ADHD, especially in the classroom, which affects their acknowledgment of this disorder. This study did not assess attitudes and behavior toward children with ADHD. Therefore, it is important that future researchers must assess teachers' attitudes and behavior toward those children.</p>",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "Saudi Arabia",
    "Jeddah",
    "Knowledge",
    "Understanding",
    "elementary",
    "kindergarten",
    "attention deficit hyperactivity disorder",
    "dealing with ADHD students",
    "students with ADHD",
    "Saudi teachers",
    "ADHD in Saudi Arabia",
    "ADHD"
  ],
  "publication": {
    "year": 2022
  },
  "journal": {
    "name": "Journal of Thought Flash Research",
    "abbreviation": "Wameed Alfikr",
    "issue": "15"
  },
  "access": {
    "status": "open",
    "license": "Unknown",
    "source": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Oraif-2022-Study-regarding-the-level-of-awareness-and-underst.pdf",
    "sourceUrl": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Oraif-2022-Study-regarding-the-level-of-awareness-and-underst.pdf",
    "localPdfUrl": "library/study-regarding-the-level-of-awareness-and-understanding-about-adhd-among-teachers-when-dealing-with-adhd-students-2022-ca98630382.pdf"
  },
  "identifiers": {
    "url": "https://res.adhd.org.sa/wp-content/uploads/sites/9/formidable/8/Oraif-2022-Study-regarding-the-level-of-awareness-and-underst.pdf"
  },
  "visibility": {
    "hidden": false
  }
}
