{
  "id": "legacy-79751c0ee5",
  "slug": "the-impact-of-parents-medication-beliefs-on-adhd-management-2015",
  "title": "The Impact of Parents’ Medication Beliefs on ADHD Management",
  "abstract": "Adherence behaviour to medication for attention deficit hyperactivity disorder (ADHD) is frequently suboptimal. Parents have several beliefs and experiences about ADHD medication and they going to make their decisions based on that background. This study aims to investigate qualitatively the parental experiences regarding using medication of ADHD for their children with ADHD. A qualitative approach was chosen to gain an in-depth insight into the experiences and beliefs. The investigations approached more than 60 parents during their follow-up. And the final sample included 44 parents. Parents generally were reluctant to medicate their children. Some parents revealed positive experiences about ADHD’s medication, mainly when that medication associated with positive performance at their schools. Parents described their hesitancy to continue the medication as a result of having uncertain assessments, side-effects of that medication and stigma. It was rare to hear from parents that behavioural or educational intervention could be used to manage ADHD, mainly when they decide to discontinue medication. There is a need to develop intervention program that educate, encourage, and support parents in following behaviour and pharmacological recommendations.",
  "categories": [
    "Awareness"
  ],
  "keywords": [
    "attitudes",
    "featured",
    "parents",
    "riyadh",
    "awareness"
  ],
  "publication": {
    "year": 2015
  },
  "journal": {
    "name": "Indian Journal of Pharmaceutical Science & Research",
    "abbreviation": "IJPSR",
    "volume": "5",
    "issue": "3",
    "pages": {
      "start": "144",
      "end": "150"
    }
  },
  "access": {
    "status": "unknown",
    "localPdfUrl": "library/the-impact-of-parents-medication-beliefs-on-adhd-management-2015-f6539c5f2f.pdf"
  },
  "visibility": {
    "hidden": false
  },
  "language": "English"
}
