{
  "id": "legacy-349e32f4b5",
  "slug": "the-new-educators-the-reasons-for-saudi-arabia-to-invest-more-in-student-counseling-programs-2016",
  "title": "The New Educators: The Reasons for Saudi Arabia to Invest More in Student Counseling Programs",
  "abstract": "Student counseling programs can provide many benefits to students in schools all around the world. In theory, the government of the Kingdom of Saudi Arabia (Saudi Arabia) has committed itself to school counseling programs in educational institutions throughout the country. Student counselors face a number of burdens and obstacles that impact student counseling programs. It is also widely known that Saudi Arabia has extremely high prevalence rates for overweight and obesity, anxiety and depression, and diabetes in children. It has also been demonstrated that teachers and staff are inadequately prepared when dealing with health issues relating to diabetes in schools in Saudi Arabia. this study will clearly demonstrate how student counselors in Saudi Arabia could become 'New Educators' in Saudi schools in relation to these health issues. This would allow them to leverage their position as student counselor to improve the quality of care provided to schools children, and to overcome burdens and obstacles that are currently negatively affecting student counseling in Saudi schools. <a href=&#34;http://scholar.waset.org/1999.10/10005489&#34; target=&#34;_blank&#34;>scholar.waset.org/1999.10/10005489",
  "categories": [
    "Legacy / No DOI"
  ],
  "keywords": [
    "anxiety",
    "counseling",
    "depression",
    "policy"
  ],
  "publication": {
    "year": 2016
  },
  "journal": {
    "name": "International Journal of Social, Behavioral, Educational, Economic, Business and Industrial Engineering",
    "abbreviation": "IJSBEEBIE",
    "volume": "10",
    "issue": "10",
    "pages": {
      "start": "3154",
      "end": "3159"
    }
  },
  "access": {
    "status": "unknown"
  },
  "visibility": {
    "hidden": false
  }
}
